{"id": 476, "title": "Ticket #476: standard universe and uid domains and SLOTx_USER", "description": "<blockquote>\nWe hit this on CHTC:\n\n<p>If SOFT_UID_DOMAIN is false and the submitting uid is not in the password file on the execute side and either TRUST_UID_DOMAIN is true or the starter's uid domain is a substring of the submit machine's host name, then the starter excepts:\n\n</p><p>EXCEPT(\"Uid not found in passwd file &amp; SOFT_UID_DOMAIN is False\");\n\n</p><p>Other than the hostname, there doesn't appear to be anything one can change on the submit side to avoid this (e.g. changing UID_DOMAIN on the submit side doesn't help).  There are two workarounds that can be applied on the execute side: setting SOFT_UID_DOMAIN=true and changing UID_DOMAIN to something that won't match any submit host domains.  The soft uid solution doesn't work very well on CHTC, because we use privsep, which is not happy to just allow jobs to run as arbitrary uids (probably a good thing).\n\n</p><p>I should also note that we have SLOTx_USER defined, but apparently the standard universe starter doesn't pay any attention to SLOTx_USER either.  I only ever see it running jobs as nobody.\n\n</p><p>This is all inconsistent with the way vanilla universe works.  If standard universe goes away soon, then so will this mess.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Aug-23 17:42:37 by adesmet:</em> <br/>\n\nBulk change of target version from v070403 to v070404 using ./ticket_target_mover.\n<hr/>\n<em>2010-Oct-27 16:39:01 by adesmet:</em> <br/>\n\nBulk change of target version from v070404 to v070405 using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2010-Oct-27 16:39", "status": "new", "created": "2009-May-11 12:05", "fixed_version": "2009-May-11 12:05", "broken_version": "v060800", "priority": "4", "subsystem": "Std", "assigned_to": "", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "other", "visibility": "public", "notify": "psilord@cs.wisc.edu,danb@cs.wisc.edu", "due_date": ""}