{"id": 1253, "title": "Ticket #1253: condor_negotiator ran out of fds", "description": "<blockquote>\nThe gist of the problem, from the ticket:\n\n<p></p><div class=\"verbatim\">\n<pre>Below is an excerpt from yesterday's NegotiatorLog on the Condor central\nmanager at LHO.  Rest of log is available, if needed.  Cluster consists\nof 250 machines, 2000 slots, running CentOS 5.3, Condor 7.4.1 and there\nwere 5000+ jobs being negotiated at the time.  Negotiator was still\nworking its way through the first 1000 before running out of FDs.  I've\nsince increased \"nofile\" from the default 1024 in\n/etc/security/limits.conf, and all seems fine.\n</pre></div>\n\n\n<p>My question is, were there more than 1024 slots open for which the negotiator\nwas negotiating? How many fds should the negotiator consume in normal operation? Is there a nonblocking tcp connect to each slot when looking for a match? Should we recommend the fd limits for negotiation machines be increased?</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Jun-16 00:31:10 by matt:</em> <br/>\n\nMy question is, were there more than 1024 slots open for which the negotiator was negotiating?\n\n<p><strong>Most likely, possibly 2000</strong>\n\n</p><p>How many fds should the negotiator consume in normal operation?\n\n</p><p><strong>One for Collector (get ads), one per schedd (or submitter?) (get jobs), one per match (notify slot)</strong>\n\n</p><p>Is there a nonblocking tcp connect to each slot when looking for a match?\n\n</p><p><strong>Yes, when a match occurs</strong>\n\n</p><p>Should we recommend the fd limits for negotiation machines be increased?\n\n</p><p><strong>Yes</strong>\n\n</p><p><strong>We should also consider queueing the slot notification instead of queueing the open TCP connection -- self draining queue anyone?</strong></p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2015-Sep-21 11:35", "status": "defer", "created": "2010-Mar-02 16:33", "fixed_version": "2010-Mar-02 16:33", "broken_version": "v070401", "priority": "5", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "psilord", "rust": "a20316", "customer_group": "ligo", "visibility": "public", "notify": "psilord@cs.wisc.edu,pcouvare@caltech.edu", "due_date": ""}