{"id": 1268, "title": "Ticket #1268: condor cron with local universe not cleaning up execute dir", "description": "<blockquote>\nmore evidence needs to be collected, but i saw a local_univ_execute dir that was maxed out with dir_&lt;pid&gt;, where every pid existed.  i suspect there is a simple bug in cleaning up (since the starter is under the schedd, not startd), or possibly a privilege problem when using local universe with cron functionality.  i am looking into it with scot.  no new local universe jobs can execute once this state is reached.</blockquote>", "remarks": "<blockquote>\n<em>2010-Mar-10 16:27:28 by kronenfe:</em> <br/>\n\nI saved the config files and log files in vdt-itb:~kronenfe/condor-cron-problem/\n\n<p>I checked with another site running the same version of Condor-Cron, and they did not have a problem with the directory filling up.  They had recently restarted condor-cron (but so had I, I think).\n\n</p><p>Since no other site has seen this problem since running RSV for the last year+ - that we're aware of at least - I think this is not high priority.  I'm a bit nervous that this problem exists, and I'd like to know what triggered it, but it seems like a really rare case that is probably not worth too much time investigating.\n</p><hr/>\n<em>2010-Aug-23 17:42:37 by adesmet:</em> <br/>\n\nBulk change of target version from v070403 to v070404 using ./ticket_target_mover.\n<hr/>\n<em>2010-Oct-27 16:39:01 by adesmet:</em> <br/>\n\nBulk change of target version from v070404 to v070405 using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2010-Oct-27 16:40", "status": "new", "created": "2010-Mar-08 16:26", "fixed_version": "2010-Mar-08 16:26", "broken_version": "v070205", "priority": "3", "subsystem": "Daemons", "assigned_to": "zmiller", "derived_from": "#848", "creator": "zmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}