{"id": 130, "title": "Ticket #130: Review KVM patch", "description": "<blockquote>\nFrom Ben K of Red Hat (I have the patch in my e-mail):\n\n<p></p><div class=\"verbatim\">\n<pre>Greg --\n\nI have attached a patch that adds support for KVM in Condor. The patch is\na bit large, because it renames \"XenType\" to \"VirshType,\" so a lot of lines\nof patch are just simple one-liners. It also adds two new classes, XenType\n(which differs from the previous XenType) and KVMType, with appropriate XML\ngenerating code for each. The patch is based on the 7.2 branch.\n\nThank you for taking the time to review this.\n\n-- Ben\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2009-Feb-23 00:34:20 by vmathew:</em> <br/>\n\nI went through the patch more as an attempt to understand the XEN/KVM implementation and code.\n\n<p>Overall, the patch looks good !\nThese are the comments and questions that I have..\n\n</p><p>1. From VMProc::Ckpt()\nit looks to me that checkpointing is not supported for KVM in this patch. Is that correct? If yes, is this because, KVM will write to the disk file even after a making a checkpoint rather than use a new file to store changeset? isn't there any way of doing a checkpointing?\n\n</p><p>2. Why is the call to checkXenParams() in VirshType::testXen() removed?\n\n</p><p>3. VMUniverseMgr::killVM(VMStarterInfo *info)\n @line 859 no case for\n   \"|| (strcasecmp(vmtype.Value(), CONDOR_VM_UNIVERSE_KVM) == 0)) {\"\n Wondering if this was missed or was intentional.\n\n</p><p>4. CreateVirshConfigFile():\n4.1 As for the virshIOError() used to avoid the use of goto, I'd recommend having a virshFileWrite function, which will try to write the value and throw an exception if the wrtie fails. And then we can have the CreateVirshConfigFile() function have a try-catch clause. This can be done for both Xen and KVM.\n\n</p><p>4.2 Also, Can there only be one network interface for virsh/xen/kvm?\n\n</p><p>5. If I understand the patch correctly, configuration values of KVM are still named with \"XEN\" as prefix. (this is repeated below in the cosmetic comments, but I think we'll have to fix this before release).\n\n</p><p>--- cosmetic comments ---\n\n</p><p>Error Messages need to be altered to include KVM also. else user who submitted KVM job gets an error talking of xen. Likewise with some member names, config parameters etc too.\n - xen_type.h  The file, and the member function with Xen in the name may be\n   renamed.\n\n</p><p>XenType::CreateConfigFile\nThe comments/errors have been edited to say virsh, but they actually need not be, since this is now in <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=XenType\" title=\"Xen Type\">XenType</a></span> class.\n\n</p><p></p><hr/>\n<em>2009-Feb-23 14:19:32 by tannenba:</em> <br/>\n\nFor better or worse, throwing C++ exceptions is currently against Condor's coding guidelines.  Perhaps we wanna revisit that, but for now structured exceptions are not permitted.\n\n<p></p><hr/>\n<em>2009-Feb-23 14:22:05 by tannenba:</em> <br/>\n\nThanks Varghese.  Next up to the review plate is Jaime, then Ben will have all the feedback he needs for a round of edits before we merge it into the code.\n\n<p></p><hr/>\n<em>2009-Feb-28 19:37:50 by bkreuter:</em> <br/>\n\nvmatthew:\n\n<p>1.  Checkpointing in KVM is beyond the scope of this patch.  As a future direction, we might want to look at using the \"QCOW\" disk image format that KVM can use, which is a copy-on-write scheme.  The idea would be to suspend the VM, and while it was suspended, use its current disk image as the base for a new QCOW image, which would then be swapped in.  I am not sure how feasible that is.  If there is a better way to do checkpointing, I am open to it.\n\n</p><p>2.  The call was not removed, it was relocated.  The reason is that it is a static function, but still needs to be specialized on the type of VM we are creating (KVM should check for the existence of /dev/kvm, for example).  Since we cannot use dynamic dispatch, I moved to call up one level, to the client code for VirshType::testXen.\n\n</p><p>3.  That was a mistake, thanks for catching it.\n\n</p><p>4.  Someone else pointed out that exceptions are not used in Condor, so I will not touch this right now.\n\n</p><p>4.2  Can you clarify this?\n\n</p><p>5.  Yes, that is something that should be fixed.  Unfortunately, changing the names of configuration values right now would break existing installations, so it is something that will have to happen later.  KVM and Xen share several configuration values, so it does not really make sense for two sets of configuration values to be maintained.\n\n</p><p>--\n\n</p><p>I will wait for Jaime's comments, then send an updated patch.\n\n</p><p></p><hr/>\n<em>2009-Mar-09 11:01:39 by bkreuter:</em> <br/>\n\nStill waiting on Jaime's comments; does anyone know what is going on?  I'll give it a few more days and then just upload a revised patch addressing Varghese' comments.\n\n<p></p><hr/>\n<em>2009-Mar-09 17:12:50 by jfrey:</em> <br/>\n\nSorry for the delay in responding. I've looked over the patch and don't have any comments beyond those Varghese made.\n\n<p></p><hr/>\n<em>2009-Mar-14 22:51:59 by bkreuter:</em> <br/>\n\nI have uploaded a new patch to be reviewed.\n\n<p></p><hr/>\n<em>2009-Mar-17 15:19:02 by jfrey:</em> <br/>\n\nI've looked at the new patch and have a few minor comments:\n\n<p></p><ul>\n<li>In VMUniverseMgr::testVMGahp() (vmuniverse_mgr.cpp), around line 454, there's no case for printing an error message for type KVM jobs.\n\n<p></p></li><li>In condor_vm_xen.sh, you have a new 'virsh' command at the bottom that doesn't get used anywhere that I can see.\n\n<p></p></li><li>Inv VMGahp::killAllProcess() (vmgahp.cpp), you're missing a case for KVM jobs.\n\n<p></p></li><li>In main_init() (vmgahp_main.cpp), <code>XenType::killVMFast()</code> should be <code>VirshType::killVMFast()</code>.\n</li></ul>\n\n<p></p><hr/>\n<em>2009-Mar-19 09:21:13 by bkreuter:</em> <br/>\n\nI uploaded another updated patch.\n\n<p></p><hr/>\n<em>2009-Apr-01 11:48:36 by jfrey:</em> <br/>\n\nThe new patch looks good to me.\n\n<p></p><hr/>\n<em>2009-Apr-01 12:56:17 by matt:</em> <br/>\n\nAre you going to commit it to master?\n\n<p></p><hr/>\n<em>2009-Apr-02 12:53:31 by jfrey:</em> <br/>\n\nThe patch does not apply cleanly to the master branch. Give me a version that does and I'll commit it.\n\n<p></p><hr/>\n<em>2009-Apr-04 15:45:16 by bkreuter:</em> <br/>\n\nI attached a new patch that should apply and compile cleanly.\n\n<p></p><hr/>\n<em>2009-Apr-07 10:23:30 by jfrey:</em> <br/>\n\nThe new patch is only a few characters different than the old one and still doesn't apply cleanly. I'm trying to apply the patch to the master branch of the Condor git repo. Are you making the patch from a Red Hat repo that contains a copy of the V7_2 Condor codebase?\n\n<p></p><hr/>\n<em>2009-Apr-08 16:44:47 by bkreuter:</em> <br/>\n\nSorry about that, I was working off of an old copy of the 7_3 branch.  This latest patch should apply cleanly, I just tested it on the most up-to-date snapshot.\n\n<p></p><hr/>\n<em>2009-Apr-09 11:35:20 by jfrey:</em> <br/>\n\nI just committed the patch to the master branch. It's git commit 72b74f6839dcd6f697c9af8ed12251b71b7ce298, id <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/72b74f6839dcd6f697c9af8ed12251b71b7ce298\">[14445]</a></span> in gittrac.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/19/kvm-7.2.patch\">kvm-7.2.patch</a>\n32919 bytes added by gquinn on 2009-Feb-04 22:45:59 UTC.\n</li><li><a href=\"../files/35/kvm-7.2.31409.patch\">kvm-7.2.31409.patch</a>\n33296 bytes added by bkreuter on 2009-Mar-15 03:51:32 UTC.\n<br/>\nCorrected patch based on Varghese' comments.  Still need clarification on issue 4.2...<br/>\n</li><li><a href=\"../files/39/kvm-7.2.31909.patch\">kvm-7.2.31909.patch</a>\n34874 bytes added by bkreuter on 2009-Mar-19 14:20:55 UTC.\n<br/>\nCorrected patch based on Varghese' and Jaime's comments.<br/>\n</li><li><a href=\"../files/43/kvm-7.3.40409.patch\">kvm-7.3.40409.patch</a>\n34877 bytes added by bkreuter on 2009-Apr-04 20:45:47 UTC.\n</li><li><a href=\"../files/45/kvm-7.3.40809.patch\">kvm-7.3.40809.patch</a>\n34049 bytes added by bkreuter on 2009-Apr-08 21:45:18 UTC.\n</li></ul>\n</blockquote></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Apr-09 11:30</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/72b74f6839dcd6f697c9af8ed12251b71b7ce298\">[14445]</a></span>: Add support for KVM in the vm universe. Committer: Jaime Frey  (By Benjamin Kreuter )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2010-Jan-31 13:16", "status": "resolved", "created": "2009-Jan-27 12:12", "fixed_version": "2009-Jan-27 12:12", "broken_version": "", "priority": "3", "subsystem": "Daemons", "assigned_to": "jfrey", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu", "due_date": ""}