{"id": 137, "title": "Ticket #137: Improve documentation for testing system", "description": "<blockquote>\nThe current testing system (in /src/condor_tests ) is documented, but it's erratic, incomplete, complex, and in some cases out of date.\n\n<p></p><ul>\n<li>Documentation is scattered between several files. They have a recommended reading order.  The reader is encouraged to ignore the WISDOM* files.  These should be unified.  (The files in question are: <a class=\"file\" href=\"rlog?f=src/condor_tests/README\">/src/condor_tests/README</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/README.filenames\">/src/condor_tests/README.filenames</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/README.imake\">/src/condor_tests/README.imake</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/README.running\">/src/condor_tests/README.running</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/README.testclass\">/src/condor_tests/README.testclass</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/WISDOM.C-tests\">/src/condor_tests/WISDOM.C-tests</a> <a class=\"file\" href=\"rlog?f=src/condor_tests/WISDOM.Fortran\">/src/condor_tests/WISDOM.Fortran</a> )\n\n<p></p></li><li>The documentation needs to be reviewed to ensure that it is up to date.\nsrc/condor_tests/README.filenames suggests that output goes into the condor_tests directory, but new practices are to give each test its own subdirectory.\n\n<p></p></li><li>The documentation needs to be complete.  For example, <a class=\"file\" href=\"rlog?f=src/condor_tests/README.testclass\">/src/condor_tests/README.testclass</a> documents 4 different test classes, but the code currently contains about 15 (btdebug condorc core dagman env filexfer framework full lib local long performance quick quicknolink simple)\n\n<p></p></li><li>CondorTest.pm needs better, and more complete documentation.  Every function a test might use should be documented.  The file as a whole needs some general guidelines on a big picture usage, perhaps with a simple test case.  The documentation should probably be valid <a class=\"external\" href=\"http://perldoc.perl.org/perlpod.html\">POD</a>, so that someone can generate a nice document if they want.\n\n<p></p></li><li>We might want to move sort or all of the documentation into the <a href=\"/wiki\">the wiki</a>.  Advantages to keeping it in the code: it's Right There; and it's visible to external collaborators until the wiki is public.  Advantages to the wiki: Details about the test are usually cross-version, so we don't need to maintain and merge forks of the documentation; the wiki becomes increasingly The Place for developer documentation; and pretty formatting.</li></ul>\n</blockquote>", "remarks": "<blockquote>\nThe Readme files are as they originally were and are still accurate. There have been a few instances of new tests going in separate directories but the mass of 1000s of files has been this way since derek set it up. I'd love to not find things by using ls and sub patterns. Its just another case of priorities... :-(</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "doc", "last_change": "2009-Dec-17 14:26", "status": "active", "created": "2009-Jan-28 13:35", "fixed_version": "2009-Jan-28 13:35", "broken_version": "", "priority": "4", "subsystem": "Tests", "assigned_to": "bt", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}