{"id": 1972, "title": "Ticket #1972: execution_history - startd/er equivalent to the job history", "description": "<blockquote>\nAnswer questions about goodput/badput across a pool is hard.  Indeed, lots of information about what happens on execute machines is hard to collect.  jmeehean ran into this exact problem trying to ask the seemingly simple question, \"How much badput does CHTC have?\"  The information is scattered about.  The local history can't help you because it doesn't know about jobs that were suspended and it doesn't know about work fetch.\n\n<p>The daemons that actually know what is running, for how long, and the like are the startd and starter.  They could keep a log of classads of jobs they've run (similar to the history the schedd keeps).  For each job, it would track:\n\n</p><p></p><ul>\n<li>Source schedd, fetch work script, etc\n</li><li>username\n</li><li>cmd\n</li><li>arguments\n</li><li>Time/Date the job was accepted to\n</li><li>Cumulative time spent running\n</li><li>Cumulative time spent suspended\n</li><li>Cumulative time spent in input file transfer before the jobs starts\n</li><li>Cumulative time spent in output file transfer after the jobs finishes\n</li><li>Size of the sandbox after transfer in, and before transfer out.\n</li><li>Cumulative time spent in overhead (from the time the startd forgets about the job - the time the startd accepted the job, minus all of the above cumulative entries)\n</li><li>Reason the job stopped running (exited, exited with signal, preempted, removed)\n</li><li>Exit code (if appropriate)\n</li><li>exit signal (if appropriate)\n</li><li>Slot number\n</li><li>Machine name (useful if aggregating multiple logs)\n</li></ul>\n\n<p>Like the job history it needs options, probably defaulting to on, to roll this log over.\n\n</p><p>This isn't everything, it ignores complexities like aggregating results across machines.  However, the information to be able to answer a question like, \"What percentage of our work time is badput?\"</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Mar-16 14:34", "status": "new", "created": "2011-Mar-16 14:25", "fixed_version": "2011-Mar-16 14:25", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}