{"id": 2321, "title": "Ticket #2321: Misconfigured collector straddling public and private networks", "description": "<blockquote>\nThe OSG Grid School had trouble configuring a pool that spanned a private network and the public internet. Execute nodes sat on either the private network or the public network. The central manager and submit nodes were dual-homed machines that straddled the two networks. The public addresses of the dual-homed machines were routeable from the private network.\n\n<p>Their schedd could not be reached by the startds on the public network. This was because the schedd was advertising its private address in its ads to the collector. The schedd was advertising its public address in its local address file. CONDOR_HOST was set to the public name of the central manager. When advertising themselves to the collector, daemons will advertise the interface they used to connect to the collector. So why was the schedd advertising its private address when it should be connecting to the collector via the public address?\n\n</p><p><code>NETWORK_INTERFACE</code> was set to the private address on the central manager. This meant that the collector was binding to all interfaces, but advertising the private address in the collector ad it advertises to itself. When the schedd wanted to send an ad to the collector, it contacted the collector via the address in COLLECTOR_HOST, retrieved the collector ad, looked up the collector's address there, then reconnected to the collector via that address. Since that address was the private one, the schedd advertised its private address.\n\n</p><p>This non-obvious behavior appears to be caused by the way the DCCollector class works.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2011-Jul-19 14:21", "status": "new", "created": "2011-Jul-19 14:21", "fixed_version": "2011-Jul-19 14:21", "broken_version": "v070601", "priority": "4", "subsystem": "Unknown", "assigned_to": "", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "", "due_date": ""}