{"id": 2928, "title": "Ticket #2928: Hide jobs in X within job lease duration from condor_q", "description": "<blockquote>\nJobs may linger in X (Removed) for a while.  So long as the job lease hasn't expired, this is probably fine, it most likely indicates some sort of communication problem between the shadow and the starter.  Eventually either communications will be restored or the lease will expire, the shadow will be killed, and the job in X will politely move into the history.\n\n<p>However, users see jobs in X and worry.  They asked the job to go away, and it just won't go away!  So they are prone to resorting to -forcex.  This is not a good idea.  A forcex'd job may unnecessarily continue running.  We may lose information about real problems.  This is particularly a problem on systems where the execute \"machines\" are virtual machines that are frequently killed with little notice, and so see jobs in X with some frequency, and thus become habitual uses of -forcex.\n\n</p><p>Proposed: condor_q should, by default, hide jobs where (<em>unverified!</em>)\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">(JobStatus==3)&amp;&amp;(CurrentTime &lt; (LastJobLeaseRenewal+JobLeaseDuration))\n</pre></div>\n\n\n<p>Now for properly functioning jobs a user will never see a job in X.  After the job lease passes, if a job is still in X Something Has Gone Wrong, and we want it visible.  Hopefully these will be far less common and users will be prone to asking their administrator or us for help.\n\n</p><p>For administrators there would be a \"-all\" or \"-showx\" to include the excluded jobs.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Apr-06 14:43", "status": "new", "created": "2012-Apr-06 14:37", "fixed_version": "2012-Apr-06 14:37", "broken_version": "v060000", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}