{"id": 294, "title": "Ticket #294: Launching Condor from the command-line on Mac OS X Launchinproblematic", "description": "<blockquote>\nLaunching the Condor daemons from the command-line can be problematic\ndue to Mach bootstrap namespaces and security contexts. These are tied\nto the session under which the daemons are spawned. When the session\nends, the daemons lose the ability to access some system services.\nMost notable of these is the <span class=\"quote\">DirectoryService</span>, which handles lookups of\nuser account information among other things.\n\n<p>In NMI, we observed getpwnam() returning NULL for user accounts defined in OpenLDAP and calls to the <span class=\"quote\">DirectoryService</span> command-line client returning the error eServerNotRunning.\n\n</p><p>If possible, the Condor daemons should attempt to put themselves in the proper Mach bootstrap namespace and security context when they daemonize themselves.\n\n</p><p>This article has information about pitfalls with running daemons on Mac OS X: <a class=\"external\" href=\"http://developer.apple.com/technotes/tn2005/tn2083.html\">http://developer.apple.com/technotes/tn2005/tn2083.html</a></p></blockquote>", "remarks": "<blockquote>\n<em>2009-Sep-18 13:37:31 by cstruble:</em> <br/>\n\nA hack to work around this limitation on OS X 10.5 is to launch condor_master using the command\n\n<p></p><div class=\"verbatim\">\n<pre>launchctl bsexec PID condor_master\n</pre></div>\n\n\n<p>as the root user, where <code>PID</code> is the process id of a process running in the global bootstrap namespace. I tried this with the PID of <code>/usr/sbin/DirectoryService</code> and Condor was able to run jobs and restart even after logging out. Before, Condor behaved incorrectly and couldn't restart when started from the command line.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2010-Jan-31 13:21", "status": "new", "created": "2009-Mar-03 14:30", "fixed_version": "2009-Mar-03 14:30", "broken_version": "", "priority": "4", "subsystem": "Daemons", "assigned_to": "jfrey", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}