{"id": 368, "title": "Ticket #368: Add functionality to the GC code to optionally use a tool to hibernate", "description": "<blockquote>\nIt has been suggested that it would be nice to be able to give Condor hints with regards to how to \"hibernate\" a machine.  We've discovered, with some user feedback, that it can be difficult, if not impossible, to always automatically determine which \"hibernation\" states a particular machine can enter; further, it is also difficult to determine the tools to use in order to enter the desired \"hibernation\" state.\n\n<p>As such, it seems reasonable that an administrator could explicitly specify which \"hibernation\" states are supported as well as the tools required to enter these states.  For instance, an administrator could approximate <code>S5</code> support with shutdown.\n\n</p><p><strong>Edit:</strong> This will be used a general framework for all hibernation capabilities in Condor.  The code from the startd will be ripped out and embedded into the <code>condor_power</code> tool.  The startd will then only be in charge of evaluating the <code>HIBERNATE</code> expression and passing the result to the defined hibernate command.  In the general case, the command will be a script that uses <code>condor_power</code> to affect the state of a given machine.  If the tool is exercised on the startd, the machine will likely enter hibernation; conversely, if the tool is invoked on the negotiator, it will likely wake the machine in question.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jun-10 13:36:33 by tannenba:</em> <br/>\n\nBen, please update this ticket to reflect the design decisions we made when we discussed this issue after the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=FlightWorthy\" title=\"Flight Worthy\">FlightWorthy</a></span> meeting last week, thanks.\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 14:50", "status": "new", "created": "2009-Apr-08 14:16", "fixed_version": "2009-Apr-08 14:16", "broken_version": "v070300", "priority": "4", "subsystem": "Daemons", "assigned_to": "", "derived_from": "#383", "creator": "tannenba", "rust": "", "customer_group": "other", "visibility": "public", "notify": "burnett@cs.wisc.edu, nleroy@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}