{"id": 3704, "title": "Ticket #3704: Python bindings in condor should be in a separate RPM", "description": "<blockquote>\nHTcondor RPMS for RHEL platforms are built with a python-2.6 dependency.  According to TJ Knoeller, this is due to the rather recent inclusion of HTCondor Python bindings.  Fedora 16+ platforms do not have python-2.6 available - they use 2.7 instead.  Thus a failure incurs when one tries to \"yum install condor\" on a Fedora platform.  This breaks automated HTCondor upgrades in BaTLab.  I recommend either:\n<ul>\n<li>making the HTCondor RPM dependent on python-2 (minor version agnostic)\n</li><li>putting the python bindings in their own RPM\n</li></ul>\n\n<p>I personally do not recommend just removing the dependency, since this could cause grief for users and admins in the future if use of python bindings becomes prevalent.\n\n</p><p>Some helpful rpm query output:\n</p><div class=\"code\">\n<pre class=\"code\">[moate@exec-112 ~]$ sudo rpm -q --requires condor | grep python\n/usr/bin/python\nlibpython2.6.so.1.0()(64bit)\npython(abi) = 2.6\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2013-Jun-18 17:04:24 by edquist:</em> <br/>\n\nSince the dependencies are automatically generated, I don't think there's a(n easy) way to just require python 2.x.\n\n<p>If you put it into a separate package / subpackage it would still have the same problem if a user wanted to install the python stuff in Fedora...\n\n</p><p>Maybe the best thing would be to make a separate rpm for Fedora, which would at least get the requirements right...\n\n</p><p></p><hr/>\n<em>2013-Jun-18 18:11:16 by bbockelm:</em> <br/>\n\nInstead of breaking features of the RHEL6 RPM, why not just release the Fedora RPM we already produce?\n\n<p></p><hr/>\n<em>2013-Jun-19 13:31:01 by edquist:</em> <br/>\n\nYeah, I didn't realize UW was already producing Fedora rpms -- seems like it would be best to just use those...  (Whether we want to mark them as 'officially supported' I guess is another question)\n\n<p></p><hr/>\n<em>2013-Aug-22 11:38:22 by edquist:</em> <br/>\n\nIn the unified rpm, the python requirement is moved into the condor-python subpackage.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Aug-01 21:20", "status": "resolved", "created": "2013-Jun-18 15:24", "fixed_version": "2013-Jun-18 15:24", "broken_version": "v070904", "priority": "4", "subsystem": "Packaging", "assigned_to": "edquist", "derived_from": "#3638", "creator": "moate", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "tannenba@cs.wisc.edu", "due_date": ""}