{"id": 3891, "title": "Ticket #3891: Get Pegasus to fix sub-DAG submit files", "description": "<blockquote>\nPegasus currently doesn't generate sub-DAG (at least) submit files by running condor_submit_dag (so they lack information like -CsdVersion).\n\n<p>We would like to move to a model where Pegasus always runs condor_submit_dag to generate the submit files.  This may mean adding additional options to condor_submit_dag to add the information that Pegasus needs for sub-DAGs.\n\n</p><p>Note:  Version above isn't terribly useful, because it doesn't refer to a Pegasus version.</p></blockquote>", "remarks": "<blockquote>\n<em>2014-Mar-07 10:53:05 by wenger:</em> <br/>\n\nOkay, the basic problem here is that Pegasus needs to change/add some stuff in the .condor.sub file.  So there are three options:\n<ol>\n<li>Pegasus writes the .condor.sub file directly.\n</li><li>Pegasus calls condor_submit_dag -no_submit with some special arguments.\n</li><li>Pegasus adds information to the DAG file or some other file, and DAGMan calls condor_submit_dag -no_submit.\n</li></ol>\n\n<p>Number 1 is what we're currently doing, but that's not good.\n\n</p><p>At this point I'm leaning towards number 3.  My idea is that we'd have something like a condor_submit_dag template file (with a name based on the DAG file name) and that file would contain things that override and/or add to stuff in the normal .condor.sub file.\n\n</p><p>I think we should have something like a -use_submit_templates flag to condor_submit_dag that gets passed down to sub-DAGs -- I'm kind of leery of people getting unexpected behaviour of if we always use the template files without the user explicitly asking for it.\n\n</p><p></p><hr/>\n<em>2014-Mar-19 15:59:53 by wenger:</em> <br/>\n\nI just had a phone conversation with Karan about this.  Pegasus has several requirements:\n\n<p></p><ol>\n<li>Be able to set/change initialdir, log, error, and output.\n</li><li>Add various custom classad attribute/value pairs.\n</li><li>Specify whether or not to do autorescue.\n</li><li>Specify the path to the .condor.sub file that will be created.\n</li></ol>\n\n<p>Item 1 should be pretty easy, except maybe for initialdir -- I'll have to think about whether that will cause complications.\n\n</p><p>Item 2 should be very easy.\n\n</p><p>Item 3 should also be pretty easy -- I think we could just add the capability to append to the arguments line in the .condor.sub file.  (If we have to change something that already exists in the arguments line it would get trickier.)\n\n</p><p>Item 4 is a little trickier -- right now DAGMan expects the .condor.sub file for a sub-DAG to be in the same directory as the DAG file.  Pegasus doesn't want this for a number of reasons, including that they don't generate the directory that the sub-DAG lives in until the planning step.  (Although that may not be as much of a problem if DAGMan itself runs condor_submit_dag.)  At any rate, they currently put the sub-DAGs in subdirectories, but put the .condor.sub files in the parent directory.  (Hmm -- maybe one solution could be to put the .dag file for the sub-DAG in the parent directory, but put all of the other stuff, such as the node job submit files, in a subdirectory.)\n\n</p><p>The other thing is, if we go with the template file idea, my thought was that the template file name would be based on the DAG file name, for example foo.dag.sub.tmpl or something.  (The template file name would have to be automatically derivable from the DAG file name so that condor_submit_dag could automatically apply it.)  I guess Pegasus could generate the template file after creating the subdirectory for the sub-DAG, so maybe this isn't such a problem.\n\n</p><p></p><hr/>\n<em>2015-Sep-22 11:21:11 by tpdownes:</em> <br/>\n\nThis is a general Pegasus/HTCondor problem rather than a specific LIGO problem. Removing LIGO tag from ticket.\n\n<p>De-prioritizing ticket to 3 (\"before next series release\") since if it were still causing fires, we'd know about it. Nevertheless, I suggest that Karan and Kent talk to discuss whether this is still a problem in 8.2/8.4 series so that they can remove ticket if appropriate.\n\n</p><p>Tom\n\n</p><p></p><hr/>\n<em>2016-Apr-06 12:56:49 by wenger:</em> <br/>\n\nI'm suspicious that this is causing the problem LIGO just reported with condor_rm not removing node jobs, so I cranked up the priority on this.\n\n<p></p><hr/>\n<em>2016-Apr-26 09:12:25 by wenger:</em> <br/>\n\nCreated V8_5-gittrac_3891-branch for this.\n\n<p></p><hr/>\n<em>2016-Apr-26 09:16:47 by wenger:</em> <br/>\n\nOh, yeah -- as per the April 6 remark, we did confirm that this was causing the problem that LIGO ran into.\n\n<p></p><hr/>\n<em>2016-Apr-26 11:31:54 by wenger:</em> <br/>\n\nPhone conference today about this with Karan -- basically we need an option to condor_submit_dag that allows the user to specify the full path of the .condor.sub file that we create; the main work, though, is that we need to modify all of the paths in the .condor.sub file so that when it is submitted from the directory it's in, the .out, .log, etc., files end up in the same directory as the .dag file.\n\n<p></p><hr/>\n<em>2016-Apr-26 12:03:23 by wenger:</em> <br/>\n\nHmm -- check whether -usedagdir will fix up the paths the way we need...\n\n<p></p><hr/>\n<em>2016-Jul-18 16:55:35 by wenger:</em> <br/>\n\nJust trying to understand this a little more clearly.\n\n<p>Suppose we have a DAG file:\n\n</p><p></p><pre>  foo/my.dag\n</pre>\n\n<p>and we want to be able to do something like this:\n\n</p><p></p><pre>  condor_submit_dag -no_submit -out bar/my.dag.condor.sub foo/my.dag\n</pre>\n\n<p>and end up with a submit file:\n\n</p><p></p><pre>  bar/my.dag.condor.sub\n</pre>\n\n<p>And we want to then be able to do this:\n\n</p><p></p><pre>  cd bar\n  condor_submit my.dag.condor.sub\n</pre>\n\n<p>That's my understanding of what Pegasus wants to do.\n\n</p><p>But I want to clarify:  does this mean that all of the paths for the node jobs of foo/my.dag are relative to bar, not foo?  Otherwise this shouldn't work.\n\n</p><p>I think it would help if the Pegasus developers could give me a tarball of a small example, with the .dag file, .condor.sub file, node job submit files, etc., in various directories, with the paths all set up the way they want them. assuming there was something like a -out option to condor_submit_dag.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2019-May-14 06:30", "status": "active", "created": "2013-Sep-03 17:55", "fixed_version": "2013-Sep-03 17:55", "broken_version": "v080000", "priority": "2", "subsystem": "Dag", "assigned_to": "coatsworth", "derived_from": "#3882", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, pfcouvar@syr.edu,vahi@isi.edu,anderson@ligo.caltech.edu, coatsworth@cs.wisc.edu", "due_date": ""}