{"id": 4161, "title": "Ticket #4161: further clarify PREEMPTION_RANK definition", "description": "<blockquote>\nFrom HTCondor-users:  the definition of what MY and TARGET refer to is not crystal clear.  Make it better.\n\n<p>Here is the prose from the email:\n</p><div class=\"verbatim\">\n<pre>-----Original Message-----\nFrom: HTCondor-users [mailto:htcondor-users-bounces@cs.wisc.edu] On Behalf Of Todd Tannenbaum\nSent: Wednesday, January 15, 2014 8:40 PM\nTo: HTCondor-Users Mail List\nSubject: Re: [HTCondor-users] PREEMPTION_RANK Trouble\n\nHi Uri,\n\nWelcome to HTCondor!\n\nRe the below, I think I see the issue.\n\nYou have\n\n  PREEMPTION_RANK = -TARGET.JobPrio\n\nbut in PREEMPTION_RANK, TARGET.xxx refers to an attribute from the candidate queued (idle)\njob classad that is being considered to preempt the job running on a machine.\nSo in context of your test setup, -TARGET.JobPrio is referencing the JobPrio\nof a given User B job.  The PREEMPTION_{REQUIREMENTS|RANK} expressions are evaluated within the context\nof the candidate machine ClassAd and the candidate idle job ClassAd; the MY scope prefix refers\nto the machine ClassAd, and the TARGET scope prefix refers to the ClassAd of the idle (candidate) job.\nThere is no direct access to attributes from the currently running job, but attributes of the currently\nrunning job that need to be accessed in PREEMPTION_REQUIREMENTS can be placed in the machine ClassAd using\nSTARTD_JOB_EXPRS.\n\nSo you want to rank by the JobPrio of the job that is running on a given machine, which normally\n would not appear in either the candidate job ad or in the machine classad.  So to deal with this,\nyou want to use STARD_JOB_EXPRS to tell the condor_startd to copy an attribute out of the job classad\n of the job running on a slot, and publish it into the machine classad.  So to get what you want,\nI think you want the append the following in your condor_config.local (or edit the knobs directly\nin condor_config, whatever):\n\n   # Publish JobPrio of running jobs into machine ad\n   STARTD_JOB_EXPRS = $(STARTD_JOB_EXPRS) JobPrio\n   # Preempt based on JobPrio of running job found in machine ad\n   PREEMPTION_RANK = -MY.JobPrio\n\nHope the above makes sense.\n\nGive the above a whirl.  Note the STARTD_JOB_EXPRS change needs to be seen by all your execute nodes,\nand the PREEMPTION_RANK change needs to be seen by your central manager.  Don't forget to issue\na \"condor_reconfig -all\" for the settings to take effect.\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2015-Jan-21 15:08:37 by smoler:</em> <br/>\n\nLooks like the definition was updated long ago, so resolving this ticket without a fixed version field.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "doc", "last_change": "2015-Jan-21 15:08", "status": "resolved", "created": "2014-Jan-16 15:05", "fixed_version": "2014-Jan-16 15:05", "broken_version": "v080000", "priority": "4", "subsystem": "", "assigned_to": "smoler", "derived_from": "", "creator": "smoler", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}