{"id": 4180, "title": "Ticket #4180: Report on tunneling/delegation/reversal", "description": "<blockquote>\nMiron requested a document enumerating the advantages and disadvantages of connection tunneling, delegation, and reversal.\n\n<p><strong>WORK IN PROGRESS</strong>\n\n</p><p>Tunneling, delegation, and reversal solve slightly different problems.  A given solution might include any subset of them, including possibly some multiple times.\n\n</p><p>Network Address Translation is considered to be a special case of firewalls.\n\n</p><p>\"Connectivity from X to Y\" means that X can initiate a two-way communications channel to Y. This may be thwarted by firewalls, network failures, and more.\n\n</p><p>In the interest of not drowning the document is qualifiers, almost every claim that appears to be universal actually means \"overwhelmingly in practice.\"  For example, overwhelmingly in practice, a direct connection is the fastest connection to initialize.  But in very unusual situations, connection tunneling can be faster.\n\n</p><p>\"Intermediary processes\" refers to processes that handle the stream between the client and the server beyond the routers, switches, firewalls, and NATs encountered in normal network operations.  Routers, switches, and firewalls are excluded from this definition.\n\n</p><p><span class=\"section\"></span></p><h2>Direct Connection</h2>\n\n<p>The client establishes a direct network connection to the server.\n\n</p><p>Advantages:\n</p><ul>\n<li>Connections are initialized quickly.  The minimal amount of work is done by the client and server to establish the connection.  There are no intermediary processes adding delays.\n</li><li>Connections have minimal latency. There are no intermediary processes adding latency.\n</li><li>Connections have maximum bandwidth.  There is no diversion adding unnecessary links which may limit bandwidth, and no intermediary processes which may limit bandwidth as a result of limited processor, RAM, or other constraints.\n</li><li>Most robust. All other options involve more processes.\n</li></ul>\n\n<p>Disadvantages:\n</p><ul>\n<li>Requires connectivity from the client to the server.\n</li><li>Client and server cannot establish a \"better\" (lower latecy, higher bandwidth, lower price) connection based on local knowledge.\n</li></ul>\n\n<p><span class=\"section\"></span></p><h2>Connection Tunneling</h2>\n\n<p>Examples:\n</p><ul>\n<li>SOCKS\n</li><li>HTTP proxy with CONNECT support\n</li><li>GCB (no longer available)\n</li></ul>\n\n<p>Advantages:\n</p><ul>\n<li>Can allow protocol jumping.  For example, a client with IPv4-only access might connect to a mixed-mode tunnel which makes the connection to an IPv6-only server.\n</li><li>Can potentially bypass firewalls.\n</li></ul>\n\n<p>Disadvantages:\n</p><ul>\n<li>Turns a single connection into two: a connection from the client to the tunnel provider, then a connection from the tunnel provider to the server.  These connections are subject to any disadvantages for the techniques used to establish them (direct, reversed, delegated).\n</li><li>Requires connectivity from the client to the tunnel provider.\n</li><li>Requires some sort of collaboration from the server-side.\n<ul>\n<li>(SOCKS, GCB) For some tunnel providers where the server registers an intent to use the tunnel, the server requires outbound connectivity to the tunnel.\n</li><li>(HTTP CONNECT) For other tunnel providers where the server does not register with the tunnel provider, any firewall must be configured to allow inbound connections from the tunnel provider to the server.\n</li></ul>\n</li></ul>\n\n<p><span class=\"section\"></span></p><h2>Connection Reversal</h2>\n\n<p>Examples:\n</p><ul>\n<li>CCB\n</li><li>GCB (no longer available)\n</li></ul>\n\n<p>Advantages:\n</p><ul>\n<li>Connections generally have maximum bandwidth.  There is no diversion adding unnecessary links which may limit bandwidth, and no intermediary processes which may limit bandwidth as a result of limited processor, RAM, or other constraints.\n</li><li>Can potentially bypass firewalls.\n</li></ul>\n\n<p>Disadvantages:\n</p><ul>\n<li>Requires connectivity from the server to the connection reversal provider.\n</li><li>Requires connectivity from the server to the client.\n</li><li>Requires connectivity from the client to the connection reversal provider.\n</li><li>Turns a single connection into three: server to reversal provider, client to reversal provider, server to client.  These connections are subject to any disadvantages for the techniques used to establish them (direct, reversed, delegated).\n</li></ul>\n\n<p><span class=\"section\"></span></p><h2>Connection Delegation</h2>\n\n<p>Examples:\n</p><ul>\n<li>condor_shared_port\n</li></ul>\n\n<p>Advantages:\n</p><ul>\n<li>Allows sharing of otherwise limited inbound IP ports.\n</li></ul>\n\n<p>Disadvantages:\n</p><ul>\n<li>Limited to a single host. Absent specialized hardware, there is no way to hand a TCP connection to a process on another computer.\n</li><li>Requires connectivity from the client to the server.\n</li></ul>\n\n<p><span class=\"section\"></span></p><h2>NOTES </h2>\n\n<p>Minimizing port/fd usage.</p></blockquote>", "remarks": "<blockquote>\nResolving to declutter IPv6 todo list.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2015-May-27 15:37", "status": "resolved", "created": "2014-Jan-24 17:30", "fixed_version": "2014-Jan-24 17:30", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "adesmet", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "adesmet@cs.wisc.edu", "due_date": ""}