{"id": 439, "title": "Ticket #439: DAGMan internal data structures need improvement", "description": "<blockquote>\nIn dagman, there are two important objects: Job and Dag. The dag edge connection information, shoved into a _queues[] array of sets--one for parents, waiting, and children, is stored in the <strong>Job</strong> object.\n\n<p>Of course, this is insanity. The Dag object should store the connection information as related to a node key on each node.\n\n</p><p>At this time, the Dag object asks for references for the _queues array from the nodes, and futzes about with them. In addition the Job object has a delegation API for those queues which is used primarily by the Dag object. The Job object doesn't appear to care that it actually contains the edge information....\n\n</p><p>I propose removing the _queues variable from the Job object and storing that information exclusively into the Dag object, since that is where it should have been all along.\n\n</p><p>A great benefit for this encapsulation change would be that the implementation for the Job objects can be altered to store its information into an ephemeral sqlite database on disk. This would probably allow dag structures into the 10 million node range. The storage of the connection information can remain in memory as part of the Dag object until it is deemed necessary to shove it out to a sqlite database as well--though I don't see that needing to happen any time soon since it doesn't take up all that much memory, really.\n\n</p><p>After a tiny bit of code inspection, it would appear that the lifting of the splice algorithm would have to change slightly to honor transferal of the edge connection data from the splice dag into the enclosing dag.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Jul-07 13:46", "status": "new", "created": "2009-Apr-30 15:11", "fixed_version": "2009-Apr-30 15:11", "broken_version": "", "priority": "5", "subsystem": "Dag", "assigned_to": "PitS", "derived_from": "#2810", "creator": "nwp", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu", "due_date": ""}