{"id": 459, "title": "Ticket #459: Create anonymous account", "description": "<blockquote>\nTo make gittrac public an anonymous account must be created.\n\n<p>Steps:\n\n</p><p></p><ol>\n<li>Enable Wiki Read - this will give public access to only the wiki <strong>[DONE]</strong>\n</li><li>Enable Read - provides read access to tickets and reports <strong>[DONE]</strong>\n</li><li>Enable Checkout-Out - provides read access to the source repository <strong>[DONE]</strong>\n</li></ol>\n\n<p>(1) should be available immediately. The exposure is access to the wiki content only. The wiki content has been created in such a way that it provides no private UW information, yet contains much useful information including Dan's howtos, information previously hidden on the developer pages, and new content such as Ben's Excel and Windows hints. Additionally, community members would like to add content, but doing so to a private forum is not attractive. Email should be sent to condor-users/devel to announce this change. <strong>[DONE]</strong>\n\n</p><p>(2) should happen after some discussion with the parties who are able to write tickets. Things to discuss are appropriate information for tickets, how to use private tickets and if they are even appropriate, .... Users with write access need to be fully responsible for their actions.\n\n</p><p>(3) should follow on from (2) and expand any processes to commit messages. Also relevent here is the handling of security related commits, if it is desirable to keep them hidden.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jul-13 09:44:28 by matt:</em> <br/>\n\nOn Friday 10 July 2009, the <code>anonymous</code> user was created giving visibility to the Wiki and commit messages in the Timeline.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2011-Aug-11 12:41", "status": "resolved", "created": "2009-May-07 11:54", "fixed_version": "2009-May-07 11:54", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "tannenba", "derived_from": "#47", "creator": "matt", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu", "due_date": ""}