{"id": 469, "title": "Ticket #469: condor_submits fails intermittently", "description": "<blockquote>\nSays Fermi in the linked Rust ticket (which also contains logs and other history):\n\n<p>\"Since the upgrade to condor 7.2.0 both on our submit client\nand on our general purpose grid cluster, we have started to\nsee condor_submits fail intermittently for a number of different users.\nRetries of these condor_submits generally succeed.  But the\nfailures are very concerning and shouldn't be happening\nand never did happen before the upgrade.  this is x86_64 condor 7.2.0\nrunning on Sci. Linux 5.\"\n\n</p><p>We need to investigate this and/or provide a mechanism for condor_submit to have an intelligent retry policy --- by intelligent, I mean one that isn't going to make the load on an overloaded schedd worse.\n\n</p><p>GregT mentions another user which has relatively light schedd load, and yet reports that about 1 in 3000 submits fail -- so there may be something more insidious than just schedd load.  Perhaps a correlation w/ start of negotiation cycle or ?</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Nov-17 10:52:48 by zmiller:</em> <br/>\n\nsince this isn't the kind of thing that is easily reproducible, we should at least run some of our own tests, submitting in a tight loop against schedds of varying business.  perhaps this will yield some failures which can be analyzed.\n\n<p></p><hr/>\n<em>2009-Nov-17 11:00:45 by matt:</em> <br/>\n\nI've had reports, and occasionally seen myself, condor_q get delayed or timeout occasionally.\n\n<p>To make any progress on this we'd need a better understanding of what \"fail\" means - is it just a delay, is it a timeout error, is it a failure during submission, and then some information about what the schedd is doing at the time of the failure.\n\n</p><p></p><hr/>\n<em>2009-Dec-16 08:30:18 by matt:</em> <br/>\n\nSuggested workaround is to increase condor_submit's timeout with TIMEOUT_MULTIPLIER, e.g. SUBMIT_TIMEOUT_MULTIPLIER = 3. The default timeout is 20 second, with a multiplier of 3 it will be 60 seconds. Presumably that will be enough to significantly decrease the likelihood of a timeout \"failure\".\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2012-Oct-16 19:34", "status": "new", "created": "2009-May-08 15:13", "fixed_version": "2009-May-08 15:13", "broken_version": "v070200", "priority": "1", "subsystem": "Tools", "assigned_to": "zmiller", "derived_from": "", "creator": "tannenba", "rust": "a19008", "customer_group": "other", "visibility": "public", "notify": "timm@fnal.gov, nleroy@cs.wisc.edu", "due_date": ""}