{"id": 48, "title": "Ticket #48: Implement Private Tickets", "description": "<blockquote>\nThis ticket must be resolved before going public!\n\n<p>An idea I had was to make a table which relates people and visibility groups, and\neach query would be written such that only the people who can see the right visibility groups can see the right queries. This may mean altering the SQL in the code to tack on this WHERE information so even if arbitrary people make a SQL query and don't write the where clause properly, it is still in effect.\n\n</p><p>There are probably other solutions, and this must be explored.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jan-21 09:16:00 by tannenba:</em> <br/>\n\nIn anticipation of this I created the \"public\" attribute on tickets.  I was thinking we could have a patch in the source code to limit viewing of private tickets only to people w/ Admin rights.  That would be pretty easy to do.\n\n<p>We would need to decide how to handle reports that hit private tickets.\n\n</p><p></p><hr/>\n<em>2009-Jan-21 09:27:17 by matt:</em> <br/>\n\nFor any given private ticket Admin and the ticket's Creator should be able to view it, IMHO.\n\n<p></p><hr/>\n<em>2009-Apr-18 16:28:45 by matt:</em> <br/>\n\nI've attached two patches to help implement private tickets. They apply to ticket.c and attach.c. They work in a somewhat hackish manner by treating the extra3 column specially. If we ever change visibility to be a different column these changes will stop working. Feel free to change the schema on tickets to make the visibility column (extra3) first class.\n\n<p>Caveats:\n</p><ul>\n<li>These patches do not hide the existence of private tickets from the ticket reports. Anyone can see private ticket information provided by reports.\n</li><li>These patches do not prevent anyone with the ability to create a report from seeing all information in a private ticket. Only admin should be allowed to create or edit reports.\n</li><li>Only users with the admin bit can view or operate on private tickets.\n</li><li>I tried to cover all the cases where a private ticket or attachment to a private ticket would be viewed, and I hope I got them all. Specifically: tktview, tktedit, tkthistory, attach_get, attach_del, attach_add. I also got tktappend, for kicks.\n</li></ul>\n\n<p></p><hr/>\n<em>2009-May-01 14:17:21 by tannenba:</em> <br/>\n\nPatches applied to the production server code, and is now running.  Resolving.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/49/attach.c.private.patch\">attach.c.private.patch</a>\n1974 bytes added by matt on 2009-Apr-18 21:14:03 UTC.\n<br/>\nPatch for attach.c to implement private attachments on private tickets<br/>\n</li><li><a href=\"../files/50/ticket.c.private.patch\">ticket.c.private.patch</a>\n2113 bytes added by matt on 2009-Apr-18 21:29:13 UTC.\n<br/>\nPatch for ticket.c to implement private tickets<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "todo", "last_change": "2009-Dec-26 20:11", "status": "resolved", "created": "2009-Jan-20 14:35", "fixed_version": "2009-Jan-20 14:35", "broken_version": "", "priority": "4", "subsystem": "Unknown", "assigned_to": "tannenba", "derived_from": "#47", "creator": "psilord", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu", "due_date": ""}