{"id": 4820, "title": "Ticket #4820: condor_status -generic does not show ads with UPDATE_AD_GENERIC", "description": "<blockquote>\nGlideinwms services advertises custom classads to collector as follows:\n\n<p></p><ul>\n<li>Factory advertises glidefactory classads to WMS Collector (Factory specific collector) using UPDATE_MASTER_AD\n</li><li>Factory advertises glideinfactoryclient classads to WMS Collector (Factory specific collector) using UPDATE_LICENSE_AD\n</li><li>Frontend advertises glideinclient classads to WMS Collector (Factory specific collector) using UPDATE_MASTER_AD\n</li><li>Frontend advertises glideresource classads to User Collector (VO specific collector) using UPDATE_AD_GENERIC\n</li></ul>\n\n<p>We plan to implement HA in Frontend and use special type of classads to User Collector to determine the active Frontend to serve the requests. We cannot use UPDATE_MASTER_AD for efficiency purposes since user collector is likely to have a O(10K) of masters registered with them already.\n\n</p><p>For time being we can use UPDATE_LICENSE_AD and use \"condor_status -license -pool &lt;usercollector&gt;\" for efficient lookups, but UPDATE_AD_GENERIC seems more logical choice over UPDATE_LICENSE_AD which maybe deprecated in future. But currently \"condor_status -generic\" is broken and returns empty results.\n\n</p><p>Can condor_status -generic be fixed? Do you foresee any issues with this scheme?</p></blockquote>", "remarks": "<blockquote>\n<em>2015-Jan-11 15:58:29 by bbockelm:</em> <br/>\n\nWithout answering the question, but going toward the motivation -\n\n<p>Poking around the collector source code, there's a separate hash table for HAD ads.  Wouldn't that be more reasonable for HA ads?\n\n</p><p></p><div class=\"verbatim\">\n<pre>$ condor_status -pool vocms097.cern.ch -subsystem had\n\nMyType               TargetType           Name\n\nHAD                  None                 root@vocms097.cern.ch\nHAD                  None                 root@vocms099.cern.ch\n</pre></div>\n\n\n<p>I don't have a collector with generic ads to test, but does \"condor_status -subsystem generic\" work? (i.e., is it a client issue or server issue?)\n\n</p><p></p><hr/>\n<em>2015-Jan-24 13:59:55 by bbockelm:</em> <br/>\n\nHi Parag,\n\n<p>Can you test against an 8.3.x collector?  Seems to work for me on newer versions...\n\n</p><p>Brian</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2015-Jan-24 13:59", "status": "new", "created": "2015-Jan-09 13:15", "fixed_version": "2015-Jan-09 13:15", "broken_version": "v080206", "priority": "3", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "parag", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "", "due_date": ""}