{"id": 4906, "title": "Ticket #4906: Add DAG node job timeout", "description": "<blockquote>\nMats Rynge at ISI just ran into a bug in which a job exited the queue without a terminated event getting written for that job.  (Solving the problem of the event not getting written is obviously outside the scope of DAGMan).\n\n<p>Anyhow, Mats would like DAGMan to deal with this case in a better way, the proposal being something like that you define (at the DAG level) a timeout, and if DAGMan hasn't seen any events for a job for more than the timeout, the job is considered failed (and, probably, condor_rm'ed).\n\n</p><p>There are a number of issues to consider, such as:\n</p><ul>\n<li>Should the user also be able to define different timeouts for specific jobs?\n</li><li>Should there be different timeouts for different states?  (E.g., should we wait longer between a submit event and an execute event than between an execute event and a terminated event?)\n</li><li>Probably some more that I haven't thought of yet.\n</li></ul>\n\n<p>Something else to think about is how to implement this.  The obvious way is to add a \"last event time\" field to the Job object.  On the other hand, we only care about that for jobs that are actually in the queue, so maybe it would be better off having some separate data structure so that we don't increase the size of the Job object.\n\n</p><p>Another issue is what to do about multi-proc clusters -- would we need to keep track of \"last event time\" individually for each proc, or could we just do it for the cluster as a whole?</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Feb-20 11:00", "status": "new", "created": "2015-Feb-20 11:00", "fixed_version": "2015-Feb-20 11:00", "broken_version": "v080303", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu,zmiller@cs.wisc.edu, rynge@isi.edu", "due_date": ""}