{"id": 4952, "title": "Ticket #4952: Improvements for LogReader API", "description": "<blockquote>\nA few things of note when trying to use the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LogReader\" title=\"Log Reader\">LogReader</a></span> API in \"real applications\":\n<ul>\n<li>There's no default constructor; you must explicitly feed it a filename.  Should default to the JOB_QUEUE_LOG.\n</li><li>No error reporting if fed an invalid file (i.e., no exception on EPERM).\n</li><li>There's no event type corresponding to the CondorLogOp_LogHistoricalSequenceNumber.  This makes log rotation detection impossible for the external script - the whole log must be processed upon startup.\n<ul>\n<li>For example, if I want to run a cron job that periodically parses the log and uploads interesting events, I could write a separate state file containing the sequence number and offset of the last event processed.  Then, on startup, if the sequence number matches, I could skip to the offset I care about.\n</li><li>There might be some value to exposing the beginning and end of a transaction - but I'm not 100% certain there's a use case.\n</li></ul>\n</li><li>A higher-level API which tracked the contents of <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAds\" title=\"Class Ads\">ClassAds</a></span> in memory (handling cluster/proc parentage and whatnot) would be less error prone.  For example, something that emitted an event once per successful transaction containing the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span> at the beginning of the transaction and all the changes would be very useful.\n</li></ul>\n\n<p>It's a useful API, but addressing the above would take out some of the sharp edges.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Mar-21 13:56", "status": "new", "created": "2015-Mar-21 13:56", "fixed_version": "2015-Mar-21 13:56", "broken_version": "", "priority": "4", "subsystem": "Tools", "assigned_to": "bbockelm", "derived_from": "", "creator": "bbockelm", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}