{"id": 5082, "title": "Ticket #5082: Package HTCondor as an AMI and/or Docker image.", "description": "<blockquote>\nIt would be super cool (for lame values of cool) to be able to provide a(n \"offical\") Docker image for tutorial use.  The image would contain a personal condor and example submit files, or whatever; the idea would be to be able to say \"docker run centos6 htcondor\" and more-or-less immediately arrive at a shell where 'condor_q', 'condor_status', and 'condor_submit' would do useful things.  Creating the image would be part of the release process (so people could easily test to new features, and also to prevent it from bit-rotting), but we'd also need effort writing/narrating/etc the tutorials using Docker.\n\n<p>It would also be super cool to have an \"official\" AMI or two.  The first idea was to make it easy to spin up a single startd at a time, having it join an existing pool (using the instance information, ideally in a way that lets us point people at a <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=CloudFormation\" title=\"Cloud Formation\">CloudFormation</a></span> widget for a GUI).  The second idea was to have two AMIs, one a central manager/submit point and the other a startd.  Ideally, creating a startd instance in the same VPN as the CM would automatically cause it to join the pool.  This configuration could perhaps be turned into the startd-only pool extension by having the central manager do the forwarding (and CCB?).  The key is to make sure everything Just Works as easily as possible, and make it easy to customize as necessary (e.g., to join your pool).</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Jun-05 14:59", "status": "new", "created": "2015-Jun-05 14:59", "fixed_version": "2015-Jun-05 14:59", "broken_version": "", "priority": "4", "subsystem": "Packaging", "assigned_to": "", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tim@cs.wisc.edu, tannenba@cs.wisc.edu, tlmiller@cs.wisc.edu, gthain@cs.wisc.edu, jfrey@cs.wisc.edu, johnkn@cs.wisc.edu", "due_date": ""}