{"id": 5542, "title": "Ticket #5542: Add priority to scheduler universe?", "description": "<blockquote>\nThe Hubble Space Telescope people currently have a setup where they are running a lot of small DAGs (~10 nodes per DAG).  They are also setting priorities at the per-DAG level, because they have three general priorities of runs (highest is calibration, medium is processing new data, and low is reprocessing old data).  (I had a phone conversation with Mary Romelfanger about this on Tuesday.)\n\n<p>Anyhow, DAG priorities work for them, except for the following problem:  they often have more than 200 DAGs in the queue, so when the submit a new one, it goes to the back of the scheduler universe queue, even if it's higher priority than everything else in the queue.  Mary was able to identify some changes she thinks they'll be able to make on their end to stay below 200 queued DAGs, which would solve their immediate problem.  But I figure this is something that HTCondor should be able to handle itself.\n\n</p><p>Their DAGs are relatively short-lived, so it sounds like adding priority to the scheduler universe would solve their problem (this meaning that a higher-priority job would immediately go to the front of the queue, but not that it would preempt running jobs).\n\n</p><p>I'm not sure that this is the right way to solve the underlying problem -- another possible solution is to have the option to run the DAGMans themselves as vanilla universe jobs (although handling the file transfer issues could be a pain).\n\n</p><p>Also, the Hubble people are in a single-user scenario -- it occurred to me that in a multi-user scenario, people could abuse the scheduler universe priority, so if we implement it maybe it should be off by default, with a config knob to turn it on.\n\n</p><p>At any rate, I wanted to record this so we can do some thinking about how to better handle large numbers of small DAGs...</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2016-Mar-03 11:18", "status": "new", "created": "2016-Mar-03 11:18", "fixed_version": "2016-Mar-03 11:18", "broken_version": "v080503", "priority": "4", "subsystem": "DaemonsSubmitNode", "assigned_to": "", "derived_from": "", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, miron@cs.wisc.edu, zmiller@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}