{"id": 582, "title": "Ticket #582: Add the Condor binaries to the PATH on Windows", "description": "<blockquote>\nThe current Windows installer does not add the Condor binaries to the PATH statement, so Condor commands need to be run with a full path.\n\n<p>Please add a step that gives the user the option to add the binaries to their path statement (this should be the default), the system path (i.e. for everyone--so call the option \"for all users of this machine\" and not \"the system path\") or to neither.\n\n</p><p>For consistency, use the <span class=\"quote\">\"RunOrSubmitJobs\"</span> dialog in the <code>condor.mm</code> script as a template for the new options.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jun-19 15:18:26 by tannenba:</em> <br/>\n\nAn alternative but related idea to the above:  how about an option to add a Start Menu category for Condor that includes opening a command shell w/ the proper PATH setup?  In addition, the menu category could include links to condor_birdwatcher, to uninstall Condor, to open up the Condor Manual (perhaps via the installer laying down the version of the manual?), ....\n\n<p>Thoughts?\n\n</p><p></p><hr/>\n<em>2009-Jun-19 15:41:23 by burnett:</em> <br/>\n\nThat sounds even better.  Although, I still really like the idea of having the option to add it to your path for good, but that may be personal preference, and people could always add it themselves if they really want it.\n\n<p></p><hr/>\n<em>2010-Aug-16 13:15:51 by ziliang:</em> <br/>\n\nI have a shortcut that will open a command prompt window that has the path to c:\\condor\\bin.  It just needs to be added to the install step.  The starting directory is the user's home directory.\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.\n\n<p></p><hr/>\n<em>2011-Mar-30 15:11:58 by tstclair:</em> <br/>\n\nI added this a long time ago to the windows installer.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2014-Aug-04 11:50", "status": "abandoned", "created": "2009-Jun-19 09:10", "fixed_version": "2009-Jun-19 09:10", "broken_version": "v070300", "priority": "4", "subsystem": "Win32", "assigned_to": "ziliang", "derived_from": "", "creator": "burnett", "rust": "", "customer_group": "other", "visibility": "public", "notify": "burnett@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}