{"id": 7420, "title": "Ticket #7420: Collector.directQuery cannot return multiple ads", "description": "<blockquote>\n<code>Collector.directQuery</code> always returns exactly the first ad it gets, which is not the correct semantics for its nominal command line equivalent <code>condor_status -direct &lt;address&gt;</code>, which can return multiple ads.\n\n<p>We probably can't directly fix <code>Collector.directQuery</code> for backwards compatibility right now, but we can add a new method that does the right thing.\n\n</p><p>Wild thought: maybe add a flag to the signature that switches between the old bad behavior and the correct behavior, old behavior by default? Might be a better deprecation/transition path. Could do this in Python if it's tricky in C++, leveraging a new \"private\" method <code>Collector._directQuery</code> that we don't document but does implement the right behavior.\n\n</p><p><code>Collector.directQuery</code> has other flaws as well.\n\n</p><p></p><ul>\n<li>There is no way to pass in a daemon address, this method <strong>always</strong> does a locate and then a direct query to the first locate result,\n  but a direct query should be able to work even if the daemon isn't advertising to a collector.\n</li><li>Both the Schedd and Startd can return ads of multiple types, some of which have no corresponding daemon_type\n</li><li>There is no constraint argument\n</li><li>The query command has a classad payload, and is thus extensible, but not all daemons accept the same options\n</li></ul>\n\n<p>Thus the proper solution is probably to deprecate this method, and add methods on the various daemon objects that do the equivalent of direct query\nbut without the locate.  Users that want to be able to do a direct query and get multiple ads back will have to\n</p><div class=\"code\">\n<pre class=\"code\">startd = htcondor.Startd(coll.locate(...))\nstartd.directQuery()\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2020-Apr-10 07:46:37 by tim:</em> <br/>\n\nBulk change of target version from v080906 to v080907 using ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2020-Nov-09 12:25", "status": "new", "created": "2019-Dec-09 13:51", "fixed_version": "2019-Dec-09 13:51", "broken_version": "", "priority": "4", "subsystem": "PythonBinding", "assigned_to": "johnkn", "derived_from": "", "creator": "karpel", "rust": "", "customer_group": "other", "visibility": "public", "notify": "johnkn@cs.wisc.edu karpel@wisc.edu", "due_date": ""}