{"id": 7686, "title": "Ticket #7686: Enforce per-submitter limits", "description": "<blockquote>\nFrom Stuart:\n<div class=\"code\">\n<pre class=\"code\">I would like to discuss the possibility of adding a pool-level limit on the maximum amount of resources that can be claimed by a specific user at any given point in time. I am primarily concerned with cpu jobs, but if this is wroth doing it is probably worth considering generalizing to also be able to limit GPU devices, cpu-cores, jobs, ...\n\nThe problems that a new or naive user can cause are legion, and I think such a knob would be a helpful throttle until a user has graduated condor flight school. We have made due for a long time with submit time throttles (and administrative scripts to dynamically query/hold/release jobs in individual schedd queues), but I would like to reconsider doing this centrally at the Negotiator.\n\nFor example,\n* condor_clip gregory.thain@ligo.org 10cpu\n  - Greg is hoping to pass flight school next year, but until then the negotiator will not match any jobs beyond a total of 10 cpu-cores\n* condor_clip james.clark@ligo.org 100gpu\n  - Rift GPU code is working well, but James isn't ready to take over the whole cluster yet\n* condor_clip joshua.willis@ligo.org 200gpu\n  - GPU version of PyCBC is working well and everything in Texas should be bigger\nor the one I really want to run right now at CIT,\n* condor_clip eric.howell@ligo.org 1000job\n  - This user has multiple DAGs running but at somewhere around 2000 concurrent jobs running they overload a backend filesystem that impacts other users, and has lost opportunity costs while the jobs are blocked on I/O rather than flipping CPU transistors.\n\n\nP.S. condor_limit might be a more intuitive name than codor_clip. And it would be nice if 0 really meant 0, i.e., a pool-level block on claiming any such pool resources, and \"unlimited\" (ala ulimit) meant no limit (presumably the default for backward compatibility).\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2020-Oct-20 10:53:29 by pfc:</em> <br/>\n\nStuart, anything left to do on this or is it delivered?\n\n<p>Works like a charm. Marking Resolved as I believe there are sub-tickets to support displaying and removing pre-existing ceiling values.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Oct-21 14:18", "status": "resolved", "created": "2020-Jun-15 08:40", "fixed_version": "2020-Jun-15 08:40", "broken_version": "v080900", "priority": "3", "subsystem": "", "assigned_to": "gthain", "derived_from": "", "creator": "gthain", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "stuart.anderson@ligo.org", "due_date": ""}