{"id": 7742, "title": "Ticket #7742: make having a credential optional when using krb/kerberos and credmon", "description": "<blockquote>\nCurrently, if the administrator sets up their pool to use kerberos credentials and a kerberos credmon, it is expected that all users on the system will in fact have a kerberos credential to use.  This might not always be the case, and it should be possible to operated in a mode where kerberos credentials are sent with the job if they exists, or if desired, but also allow for submissions without.\n\n<p>Probably this means we'll need a couple settings to express admin and user requirements and preferences.  The below model mimics the security model (<strong>N</strong> ever, <strong>O</strong> ptional, <strong>P</strong> referred, <strong>R</strong> equired).  However, this model has been known to be confusing for many, so suggestions are welcome for a better mechanism for both admins and users alike to describe this.\n\n</p><p><strong>config setting</strong> settings would be: <strong>N</strong> ever send cred, <strong>O</strong> ptionally send cred but don't by default, <strong>P</strong> refer to send cred by default but no error if no cred is sent, <strong>R</strong> equire that krb cred is sent.\n\n</p><p><strong>submit file</strong> settings would be: <strong>N</strong> ever allow my credential to be sent, <strong>O</strong> ptionally send cred if needed but don't request that behavior, <strong>P</strong> refer to send my cred but submit my job even if its not sent, <strong>R</strong> equire my cred be sent for this job.\n\n</p><p>A user can already specify which OAuth creds they need, by OAuth type, so maybe we should just make krb another \"type\".  However, krb creds might need special treatment because HTCondor does do special handling for krb creds in order to obtain AFS tokens. (More preceisly, the shipped krb credmon does the handling using a convention for keyring names that HTCondor can follow)\n\n</p><p>For example: unlike their OAuth tokens, users might not even know about krb/afs, and they shouldn't have to do anything special in their submit file for their jobs to use have those creds/tokens.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Nov-09 12:13", "status": "new", "created": "2020-Jul-20 11:08", "fixed_version": "2020-Jul-20 11:08", "broken_version": "v080900", "priority": "2", "subsystem": "Security", "assigned_to": "zmiller", "derived_from": "", "creator": "zmiller", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "zmiller@cs.wisc.edu", "due_date": ""}