{"id": 957, "title": "Ticket #957: slot resource monitoring is confusing and could be more useful", "description": "<blockquote>\n<code>VirtualMemory</code> is <em>not</em> how big the job's <code>ImageSize</code> can get before the job has taken more virtual memory than is allocated to the slot.\n\n<p><code>Disk</code> is <em>not</em> how big the job's <code>DiskUsage</code> can get before the job has taken more than is allocated to the slot.\n\n</p><p><code>VirtualMemory</code> is how much <em>swap space</em> is currently <em>free</em>, divided across the slots.  This implies that if all jobs are using 100% of the swap space allocated to their slot, <code>VirtualMemory</code> on all slots will be 0.  <code>VirtualMemory</code> on all slots would also be 0 if one job is using 100% of total swap space and the jobs on the other slots are using 0%.  This is clearly not very useful when enforcing usage limits.\n\n</p><p>Similarly, <code>Disk</code> is how much space is currently <em>free</em>, not how much was originally promised to the job.\n\n</p><p>Finally, the units of <code>Memory</code> differ from everything else, and there is no measure of free memory, unlike the other resources that are monitored.\n\n</p><p><span class=\"section\"></span></p><h2>Proposal </h2>\n\n<p>Rename and rescale:\n\n</p><p></p><pre>  VirtualMemory --&gt; FreeSwapMB  (was in KB)\n  Disk --&gt; FreeDiskMB           (was in KB)\n</pre>\n\n<p>Add:\n\n</p><p></p><pre>  FreeMemoryMB\n</pre>\n\n<p>Also add:\n\n</p><p></p><pre>  MatchedSwapMB\n  MatchedDiskMB\n  MatchedMemoryMB\n</pre>\n\n<p>The Matched attributes are simply copies of the corresponding Free attributes at the time when the claim was requested.  They do not change while the claim exists, and when the claim is closed, they go away.  They represent how much was promised to the job and are therefore appropriate for use in preemption policies that enforce resource usage.\n\n</p><p>Given the above renames and rescaling of attributes, it would also make sense to do the following:\n\n</p><p></p><pre>  Memory --&gt; MemoryMB\n  DiskUsage --&gt; DiskUsageMB  (was in KB)\n  ImageSize --&gt; ImageSizeMB  (was in KB)\n</pre>\n\n<p>For backwards compatibility we would probably want to retain all of the existing attributes, perhaps only when some CRUFT knob is turned on.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2010-Jan-31 13:49", "status": "new", "created": "2009-Nov-16 15:48", "fixed_version": "2009-Nov-16 15:48", "broken_version": "v070500", "priority": "4", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "other", "visibility": "public", "notify": "dan@hep.wisc.edu,matt@cs.wisc.edu", "due_date": ""}