{"id": 530, "title": "Ticket #530: RFE: long submission sessions with condor_submit", "description": "<blockquote>\ncondor_submit can read job descriptions from standard input. It's the default if you don't provide a submit file. This is quite nice for scripting condor_submit. However, there's a catch. After the first queue command is sent the clock is ticking. When the queue command is received condor_submit makes a connection to the condor_schedd. If queue commands aren't sent fast enough after that the connection will be silently broken - an error is raised on the queue following the disconnection. A second problem is that the condor_schedd is blocked during this time. It won't handle other connections, e.g. condor_q or other condor_submits.\n\n<p>Seems this could be mitigated in two ways: 1) (Todd's initial thought) allow the Schedd to have multiple CEDAR transactions open at once; 2) (Matt's initial thought) have condor_submit make a new connection to the Schedd for each queue command and don't keep the connection open for long between them.\n\n</p><p>(1) is probably the ideal, and may even eliminate other contention issues such as concurrent submissions. It'd probably be a few solid weeks of Todd's time to get right.\n\n</p><p>(2) has an obvious downside of probably causing each queue to create a new cluster, though that's maybe not a big deal. It'd probably take anyone 3 days to get done by only touching condor_submit, and probably touch condor_schedd and double the time to handle any downsides.\n\n</p><p>An alternative is to use something like the SOAP interface to condor_schedd, which already supports multiple concurrent transactions.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 14:51", "status": "new", "created": "2009-May-28 16:59", "fixed_version": "2009-May-28 16:59", "broken_version": "", "priority": "3", "subsystem": "Tools", "assigned_to": "", "derived_from": "", "creator": "matt", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu", "due_date": ""}