{"id": 261, "title": "Ticket #261: Condor MSI installer fails", "description": "<blockquote>\nThere are a variety of apparent problems with the Windows MSI installer.  I've reproduced the issue that Sam Beckler reported on condor-users (<a class=\"external\" href=\"https://lists.cs.wisc.edu/archive/condor-users/2009-February/msg00235.shtml\">https://lists.cs.wisc.edu/archive/condor-users/2009-February/msg00235.shtml</a>) and have observations of different (more critical) failure cases to report.\n\n<p>The first issue is that installing with \"start the service after installation\" fails because it can't start the service.  Quite by accident, I successfully used the same workaround as Beckler:  rebooting the machine and having the service start on system startup.\n\n</p><p>I have reports from one of our Red Hat QA guys, though, in which this workaround is not effective.  In these cases, the service fails to start on install (with \"Error 1920 - Service\n'Condor' failed to start.  Verify that you have sufficient privileges to start\nsystem services.\") as before.  However, it also fails to start after a reboot.  If the user then attempts to manually start the condor service after rebooting, it fails with a Windows \"Error 1067: The process terminated unexpectedly.\"\n\n</p><p>I will attach application and event logs associated with the failure-case reports.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Feb-26 13:08:37 by burnett:</em> <br/>\n\nIt looks as if XP does not recognize the manifests in our executables.  I'll check if this is a known problem, or if it is something specific to our current build settings.\n\n<p></p><hr/>\n<em>2009-Mar-11 14:16:52 by burnett:</em> <br/>\n\nSo far I have been unable to reproduce the installer error.  I'm in the midst of configuring a Windows XP SP1a machine (it works fine on Windows XP SP0 (aka Windows XP Build 2600).\n\n<p>My suspicion is that the problem exists in the gap between Windows XP SP2 and Windows XP SP3, which is huge.\n\n</p><p>I'll first try comparing the logs, to looks for any anomalies (other than the failure at the end) and then start incrementally patching a Windows XP2 VM until I can reproduce the behavior.\n\n</p><p>It might also be an idea to get a list of hot-fixes (and other updates) installed on the already problematic machine.  This list can be generated with <a class=\"external\" href=\"http://www.nirsoft.net/utils/wul.html\">WinUpdatesList</a>.\n\n</p><p></p><hr/>\n<em>2009-Mar-11 16:04:32 by burnett:</em> <br/>\n\nWill gave me a copy of the MSI he built, and I've managed to reproduce the problem using it.  This seems to suggest that the method by which the MSI is created is somehow broken (possibly environment, updates, etc.).  I haven't established how, but I do have a collection of logs from failed installs to compare.\n\n<p>What's really weird, is that the installer won't even install on Windows XP (2600).\n\n</p><p></p><hr/>\n<em>2009-Mar-11 17:21:38 by burnett:</em> <br/>\n\nAnd the culprit is error code 1290:\n\n<p>System error code 1290 means \"The service start failed since one or more services in the same process have an incompatible service SID type setting. A service with restricted service SID type can only coexist in the same process with other services with a restricted SID type. If the service SID type for this service was just configured the hosting process must be restarted in order to start this service.\" This error code may also display as \"ERROR_INCOMPATIBLE_SERVICE_SID_TYPE\" or as the value 0x50A.\n\n</p><p>It seems a rouge <code>msiexec.exe</code> running as <code>SYSTEM</code> may be responsible for the failures.  I've reproduced the installation failure on XP SP3 and can also successfully install on XP SP3.  I can't be certain, but this seems to be a problem with <code>msiexec.exe</code> and <strong>not</strong> our installer.\n\n</p><p></p><hr/>\n<em>2009-Mar-11 17:53:49 by burnett:</em> <br/>\n\nIt also appears that having spaces in the path to the MSI can decide its fate: with spaces it fails, without spaces it is ok.  This, again, only happens with the redhat MSI, I cannot reproduce it with ours.\n\n<p>Also, removing the previous installation of Condor, and remnant directories (like spool, log, etc.) seems to help the installer.  Even deleting the \"MAKEMSI_VBSCA-Condor for Windows(7.2.2)-Wednesday.log\" sometimes helps.\n\n</p><p>This is just plain weird.\n\n</p><p></p><hr/>\n<em>2009-Apr-24 16:17:07 by matt:</em> <br/>\n\nWhat was the resolution?</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/30/application.evt\">application.evt</a>\n19988 bytes added by willb on 2009-Feb-26 17:26:34 UTC.\n<br/>\nApplication event log from the case in which the workaround fails.<br/>\n</li><li><a href=\"../files/31/system.evt\">system.evt</a>\n43468 bytes added by willb on 2009-Feb-26 17:27:07 UTC.\n<br/>\nSystem event log from the case in which the workaround fails.<br/>\n</li><li><a href=\"../files/34/condor-install.log\">condor-install.log</a>\n226410 bytes added by burnett on 2009-Mar-11 19:04:18 UTC.\n<br/>\nInstaller log from <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=RedHat\" title=\"Red Hat\">RedHat</a></span> QA. From an installation on Windows XP SP2.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Apr-29 17:04</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/9ac3bf175318db60a51f77af50f8c566c4a126b3\">[14600]</a></span>: Ticket <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=261\" onclick=\"get_ticket_and_populate_wrapper('261'); return false;\" title=\"Condor MSI installer fails\">#261</a></span>: Updated installer such that it installs the correct runtime libraries and reboots the machine before starting the service.  (By Ben Burnett )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2010-Jan-08 08:11", "status": "resolved", "created": "2009-Feb-26 11:24", "fixed_version": "2009-Feb-26 11:24", "broken_version": "v070201", "priority": "2", "subsystem": "Win32", "assigned_to": "burnett", "derived_from": "", "creator": "willb", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tannenba@cs.wisc.edu, burnett@cs.wisc.edu, willb@redhat.com, matt@cs.wisc.edu", "due_date": ""}