{"id": 4041, "title": "Ticket #4041: RFE: Provide additional statistics and counters in negotiator", "description": "<blockquote>\nFrom downstream RFE:\n\n<p></p><div class=\"verbatim\">\n<pre>Provide Rejection counts broken down by the unique values you'd expect to\nsee in LastRejMatchReason when looking at a job classad - e.g. \"no match\nfound\", \"concurrency limit reached\", \"group quota exceeded\", etc. This will help resolve utilization problems.\n\nWe can't just count these messages as we encounter them since we now stop\nnegotiation in some cases to avoid seeing the messages. But, I think this can\nbe gleaned from using autocluster size, number of submitters.\n\n...\n\nI think the stats could either be tracked in the accountant log on a per user/group basis or attached to the submitter ads. The idea being that one could query things like users or #users hitting \"no match found\" and submitters not negotiating because of concurrency limits.\n</pre></div>\n\n\n<p>Also from downstream (copied from <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=4042\" onclick=\"get_ticket_and_populate_wrapper('4042'); return false;\" title=\"RFE:  implement timings for various phases within Phase 4 Duration\">#4042</a></span>)\n\n</p><p></p><div class=\"verbatim\">\n<pre>(from downstream rfe)\n\nProvide a timing stats that correspond to various stages within Phase 4. This is to help resolve utilization/performance problems.\n\n...\n\nIdeally what I'm trying to get in a Phase4Duration breakdown are answers to\nquestions like:\n\nWhat percentage time is being spent in the negotiator vs. in communication with\n the schedd's? If the negotiator is spending all it's Phase4 time not\ncommunicating, there's likely a code problem.\n\nHow much time am I spending in each schedd? Is there a particular schedd that\nI'm spending all of my time in? Was I experiencing communication problems with\nthat schedd in addition to spending lots of time with it, and how much wait\ntime was introduced due to communications recovery?\n\n\nHow much time is being lost to rejections vs. valid matches?\n\nToday we just get 1 number, total time spent.\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2013-Nov-05 15:11:29 by tannenba:</em> <br/>\n\nAgree that having more useful statistics in the negotiator would be good.\n\n<p>Next stop is a specific design document that spells out the statistics to add and the motivation/reason/usage scenario for the stat (e.g. why the majority of admins would want to see it), and for each statistic identifying name, which stat class will be used, default reporting level.\n\n</p><p>We have failed in the past because we have added a huge pile of raw statistics into the code without thinking about if/who/when the statistics would ever be used.  Most have not.  I do not want to make the same mistake again; I would rather see a design that identifies a very small set of useful statistics than a design that adds in a dozen (or dozens) of \"might be useful sometimes to someone\" statistics.\n\n</p><p></p><hr/>\n<em>2013-Nov-21 18:37:44 by eje:</em> <br/>\n\nDesign doc:\n<a class=\"external\" href=\"https://docs.google.com/document/d/1kRmlQHiO-Ow90xHW0PJkJLWdGPUx4vNHS6DxEKEUWZ8\">https://docs.google.com/document/d/1kRmlQHiO-Ow90xHW0PJkJLWdGPUx4vNHS6DxEKEUWZ8</a>\n\n<p></p><hr/>\n<em>2014-Jan-28 15:43:36 by gthain:</em> <br/>\n\nThis design looks good.  One question:  The doc wants these statistcs to live in the submitter ad, but that's maintained by the schedd.  I don't think there's a way today to update certain attributes in an ad in the collector.\n\n<p></p><hr/>\n<em>2014-Feb-12 10:44:43 by eje:</em> <br/>\n\nYes, the submitter ad idea is (I think) contingent on the negotiator being able to 'co-maintain' submitter ads with the scheduler.   It seems feasible, but it is a nontrivial design component.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2014-May-21 10:44", "status": "reviewdesign", "created": "2013-Nov-04 16:27", "fixed_version": "2013-Nov-04 16:27", "broken_version": "", "priority": "3", "subsystem": "DaemonsCM", "assigned_to": "gthain", "derived_from": "", "creator": "eje", "rust": "", "customer_group": "other", "visibility": "public", "notify": "eje@cs.wisc.edu, matt@cs.wisc.edu, tstclair@redhat.com, gthain@cs.wisc.edu, tannenba@cs.wisc.edu, johnkn@cs.wisc.edu, jthomas@redhat.com", "due_date": ""}