{"id": 5599, "title": "Ticket #5599: Query any daemon type via condor_config_val", "description": "<blockquote>\nThe condor_config_val tool can be used to query a running daemon for configuration values that it is currently using. This can be done easily for major daemon types (master, schedd, startd, collector, negotiator) via a command line argument like -master. But for other daemon types (e.g. the defrag daemon), you must supply the daemon's sinful string with the -address option. Unlike with condor_status, you cannot use -subsystem to specify the type of daemon you wish to query.\n\n<p>The -subsystem option has a different meaning in condor_config_val. It changes how the tool interprets parameters when reading the local configuration files, acting like the specified subsystem would. For example, with -subsystem startd, it would use the value of <code>STARTD.START</code> over <code>START</code>.\n\n</p><p>When condor_config_val is told to query a running daemon with -name, there should be a way to tell it what type of daemon is being queried, so that it can find the appropriate daemon ad in the collector. This should work for all types of daemons with ads in the collector, not just the big five.\n\n</p><p>One possibility would be to use -subsystem for this purpose. When used with -name, it would no longer alter the tool's subsystem type, but instead identify the daemon type to be queried, just as it does in condor_status.\n\n</p><p>A second possibility would be to introduce a new option, say -daemon-type, which work like -subsystem in condor_status.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2016-Apr-04 11:57", "status": "new", "created": "2016-Apr-04 11:52", "fixed_version": "2016-Apr-04 11:52", "broken_version": "v080400", "priority": "4", "subsystem": "Tools", "assigned_to": "jfrey", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}