{"id": 2279, "title": "Ticket #2279: Condor-C Failure in the OSG Summer School", "description": "<blockquote>\nWe observed a pretty severe failure of Condor-C in the OSG Summer School this morning.  About 30 students submitted jobs from a schedd in Wisconsin to a pool/schedd at UCSD.\n\n<p>Basically, we saw a huge number from the CGAHPWorkerThread in talking to the remote schedd.  The remote schedd was very unresponsive to a hand-run \"condor_q\".  When I did a few \"pstack\" on the remote schedd, it was always blocked in condor_read.  The FD it was reading from could be tracked back to a CGAHP worker thread.\n\n</p><p>Talking to danb, I believe the issue is the blocking qmgmt interface.  Dan claims that each attribute in the classad of a submitted job is sent as a separate round trip.  So, a job with 10 attributes and a 100msec RTT would block the schedd for 1 sec.\n\n</p><p>I believe that we had enough threads trying to submit in parallel that the blocking behavior caused most of them to basically fail.  This would not show up in usage where the latency is small, or if there's a small number of submitters (assuming the working theory is correct).</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Jun-28 16:18:51 by jfrey:</em> <br/>\n\nJob submission appears to be the main problem here. The c-gahp is pushing multiple full job ads to the remote schedd with a round-trip per attribute. We need a method in the schedd's qmgmt client interface that allows the sending of one or more full job ads in a single round-trip, essentially a complement to GetAllJobsByConstraint().\n\n<p></p><hr/>\n<em>2012-Sep-07 13:21:55 by jfrey:</em> <br/>\n\n<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2575\" onclick=\"get_ticket_and_populate_wrapper('2575'); return false;\" title=\"Limit c-gahp's time connected to the schedd\">#2575</a></span> should solve this problem.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2012-Sep-07 13:30", "status": "resolved", "created": "2011-Jun-28 15:54", "fixed_version": "2011-Jun-28 15:54", "broken_version": "", "priority": "2", "subsystem": "Grid", "assigned_to": "tannenba", "derived_from": "#2574", "creator": "bbockelm", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "bbockelm@cse.unl.edu, tstclair@redhat.com", "due_date": ""}