{"id": 2363, "title": "Ticket #2363: move CCB server to its own daemon", "description": "<blockquote>\nCurrently, the collector is the CCB server.  An incident in CHTC resulted in CCB problems causing a denial of service problem for the whole collector (see <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2360\" onclick=\"get_ticket_and_populate_wrapper('2360'); return false;\" title=\"CCB command handlers can block for 20s due to misbehaving client\">#2360</a></span>).  Although this specific problem has been addressed, there is a concern that something like this could happen again.\n\n<p>Why was CCB service originally put in the collector?\n\n</p><p></p><ul>\n<li>simplicity: the collector already has a well-known port that everything in the pool must be able to connect to, so in a simple deployment, we can just make use of that\n\n<p></p></li><li>possibility of optimizing things so that the security session used by the CCB connection is the same as the one used by daemons to advertise themselves, thus reducing authentication overhead.  This is not currently implemented, because the CCB registration happens at DAEMON authorization level, whereas the publication happens at something more specific, such as ADVERTISE_SCHEDD.\n</li></ul>\n\n<p>Question: should daemons discover the CCB server by querying the collector?  Or should they have a hard-coded CCB address, as they currently do?  If they discover the CCB server, how should they pick which CCB server(s) to use?  A name or list of names?  An expression matching the CCB daemon ads?</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Nov-22 09:11", "status": "new", "created": "2011-Aug-08 15:39", "fixed_version": "2011-Aug-08 15:39", "broken_version": "v070700", "priority": "3", "subsystem": "", "assigned_to": "danb", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "", "due_date": ""}