{"id": 2424, "title": "Ticket #2424: windows startd does not scale beyond 12 slots", "description": "<blockquote>\nIan Chesal reports scaling problems when the startd is managing more than 12 slots.  The system is a 40-core Dell server running Win2k8 Enterprise Server with SP2.\n\n<p>The problem appears when many shadows try to activate claims to the startd around the same time.  The first few succeed.  The rest fail.\n\n</p><p>After some investigation, we determined that the reason for failure is that the startd is spending lots of time (and burning CPU) in <code>Starter::percentCpuUsage()</code>.  This led us to discover that USE_PROCD was set to FALSE in the Condor configuration.\n\n</p><p>Ian turned on the procd and there was a noticeable improvement, but the problem is still not completely solved.  He is able to get simple sleep jobs running on all the slots, but if he runs a real workflow that uses CPU, many slots spend a lot of time in Claimed/Idle.  The procd is spending 100% of its time burning CPU.\n\n</p><p>Looking at the logs, I see some starters exiting with status 1.  No starter log exists in these cases, so whatever is causing the starter to fail is happening very early in the process, before logging is initialized.\n\n</p><p>I notice that <code>ProcFamilyMonitor::register_subfamily()</code> starts by taking a snapshot.  Since this operation is so expensive in this environment, this likely explains the procd being so busy.  However, I do not see why this would cause the starter to fail.\n\n</p><p>Ian tried tests with the following, but he reports no improvement:\n\n</p><p></p><pre>   PID_SNAPSHOT_INTERVAL = 90\n   JOB_START_COUNT = 1\n   JOB_START_DELAY = 1</pre>\n</blockquote>", "remarks": "<blockquote>\ndup of <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2441\" onclick=\"get_ticket_and_populate_wrapper('2441'); return false;\" title=\"Condor startd on Windows can't run more than 8 jobs simultaneously\">#2441</a></span></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2011-Dec-07 16:18", "status": "abandoned", "created": "2011-Aug-26 09:56", "fixed_version": "2011-Aug-26 09:56", "broken_version": "v070602", "priority": "4", "subsystem": "", "assigned_to": "danb", "derived_from": "#2441", "creator": "danb", "rust": "a22489", "customer_group": "users", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}