{"id": 3241, "title": "Ticket #3241: Partitionable Slots enhancements for 7.9", "description": "<blockquote>\n<span class=\"subsection\"><h3>Milestones </h3></span>\n\n<p></p><ul>\n<li>[? days] Milestone 1 [gthain]\n</li></ul>\n\n<p></p><div>\n<table border=\"1\" cellpadding=\"2\" cellspacing=\"0\" summary=\"EMBED: Status Table of Derived Tickets\">\n<caption>\n  <a href=\"rptview?rn=86\" rel=\"nofollow\" title=\"EMBED: Status Table of Derived Tickets\">EMBED: Status Table of Derived Tickets</a>\n</caption>\n<tbody><tr>\n<td colspan=\"11\"><form action=\"rptview\" method=\"GET\">\n<input name=\"rn\" type=\"hidden\" value=\"86\"/>\nTN: <input name=\"TN\" type=\"text\" value=\"3241\"/>\n<input type=\"submit\" value=\"Go\"/>\n</form></td></tr> \n<tr>\n<th><a href=\"rptview?rn=86&amp;order_by=2&amp;order_dir=ASC&amp;TN=3241\">Developer</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=3&amp;order_dir=ASC&amp;TN=3241\">#</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=4&amp;order_dir=ASC&amp;TN=3241\">Status</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=5&amp;order_dir=ASC&amp;TN=3241\">Type</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=6&amp;order_dir=ASC&amp;TN=3241\">Pri</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=7&amp;order_dir=ASC&amp;TN=3241\">Created</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=8&amp;order_dir=ASC&amp;TN=3241\">Changed</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=9&amp;order_dir=ASC&amp;TN=3241\">Target</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=10&amp;order_dir=ASC&amp;TN=3241\">Due Date</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=11&amp;order_dir=ASC&amp;TN=3241\">Days left</a></th>\n<th><a href=\"rptview?rn=86&amp;order_by=12&amp;order_dir=ASC&amp;TN=3241\">Title</a></th>\n</tr>\n<tr><td colspan=\"11\">\n<i>No records match the report criteria</i>\n</td></tr>\n</tbody></table></div>\n\n\n<p><span class=\"section\"></span></p><h2>History </h2>\n\n<p>Work to support Paritionable slots in Condor is an ongoing effort.\n\n</p><p><span class=\"subsection\"></span></p><h3>Current support for partitionable slots in Condor:</h3>\n\n<p>A startd can be configured to support zero or more paritionable slots, in addition to the traditional static slots. Static and partitionable slots can be mixed, and we do see demand from user for having machines running with both static and partitionable slots. This can be to have a static slot for administrative purposes, or to support specific kinds of resources like GPUs. Partitionable slots can be given fixed or remaining amounts of disk, cpu and memory resources. Today, the negotiatior knows nothing special about partitionable slots -- they are advertised to the collector, matched in the negotiator, just like a static slot, and assigned to a schedd. Only when the claim is in the schedd does their partitionable nature become noticed. When the schedd claims a partitionable slot, the startd splits the claim into the requested amount (perhaps rounded by itself), creating a new claim we call the dynamic slot, and decrements the existing partitionable slot, so that it represents the remaining claim. The schedd can then repeatedly try to claim the partitionable leftovers until they are exhausted. However, the partitionable slot never itself goes into the claimed state, it stays unclaimed for the whole life cycle. Defragmentation is handled by a defragmentation daemon, which periodically sends draining requests to selected startds, in order to drain the whole machine.\n\n</p><p><span class=\"subsection\"></span></p><h3>Problems with current support for partitionable slots</h3>\n\n<p>There are several operational problems with the current partitionable slot implementation. These stem from a few root causes.\n\n</p><p>The first root cause is that the negotiator doesn't know about partitioning, and hands out the whole resource, or tries to, to the schedd. This means that in cases where there are many resources per machine, and each submitter, for whatever reason, is only allowed to currently use less than a whole machine's worth of resources, the negotiator will fail to match the resource to the job, because it can only allocate the full slot to the submitter. A related problem is that it is impossible to specify a policy where the admin can \"fill up\" one machine with jobs before moving on to the next machine. Again, this is because the negotiator believes it is matching one job to a resource which eventually may split into multiples. Because the negotiator implements concurrency limits, these don't work correctly in the paritionable slot case either. Another result of this is that startd rank doesn't work correctly -- the rank and the match only apply to the partitionable slot, not to the dynamic slot which is created by the start at claim time. A minor consequence is that the partitionable slot stays unclaimed, which is confusing in condor_status output.\n\n</p><p>Another root cause of several problems is that there is no naming or identification of partitionable slots. While static slots aren't explicitly named, many sites use the slotd as a de-facto name. For example, one static slot might be special in some way, and be bound to jobs that need licenses or whole machine slots, or GPUs or other specialness. Because the slot id of dynamic slots is dynamic, there is no fixed binding even of the slot id to a name, and thus there is no way to consistently identify dynamnic or partitionable slots. A related problem is that the CPU affinity knobs are bound to slot ids, which don't really exist as one might expect in the partitionable slot world, so there is no way to express the common idiom of \"use Linux CPU affinity to give each slot one core\". Yet another problem related to this is custom slot attributes. With static slots, there is the ability to set SLOTxx_SomeConfigKnob, to just change the config knob for that slot. This is not possible in the partitionable slot world. Perhaps the most common example of this is the Start expression itself -- this is global per startd, instead of per slot, or per slot type.\n\n</p><p><span class=\"subsection\"></span></p><h3>Proposed fixes</h3>\n\n<p>To improve upon this situation, in this work we will make the partitionable slots named and claimable. Each partitionable slot will have it's own id, and it will be possible to assign configuration values and classad attributes to the partitionable slot, which are copied into that slot's dynamic slot at claim time. Specifically, it should be possible for each slot type to have it's own START expression, independent of the other slot types. The workflow will also be changed to that the negotiator and schedd will collaborate to claim the partitionable slot, and only perform fast leftover claimed from the claimed partitionable slot. This will show up in the condor_status output, so that the partitionable slot will, less confusingly, end up in the Claimed/busy state.\n\n</p><p>There will then be a tree of partitionable slots, with each partitionable slot having one dynamic slot associated with it, and a child partitionable slot, which can be itself claimed and partitioned.  Any of these partitionable slots in the tree can be preempted by the usual RANK conditions, which results in a preemption of all the dynamic slots recursively under that partitionable slot.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Oct-01 14:27:53 by gthain:</em> <br/>\n\nSee <span class=\"wiki\"><a href=\"wiki?p=PartionableSlotsDesignDocument\" title=\"Partionable Slots Design Document\">PartionableSlotsDesignDocument</a></span>\n<hr/>\n<em>2013-Jan-22 10:54:51 by johnkn:</em> <br/>\n\nBulk change of target version from v070903 to v070904 using ./ticket-target-mover.\n<hr/>\n<em>2013-Mar-05 10:58:27 by johnkn:</em> <br/>\n\nBulk change of target version from v070904 to v070905 using ./ticket-target-mover.\n<hr/>\n<em>2013-Apr-22 11:10:10 by johnkn:</em> <br/>\n\nBulk change of target version from v070905 to v070906 using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Apr-22 11:11", "status": "new", "created": "2012-Oct-01 14:25", "fixed_version": "2012-Oct-01 14:25", "broken_version": "v070900", "priority": "3", "subsystem": "", "assigned_to": "gthain", "derived_from": "", "creator": "gthain", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}