{"id": 3325, "title": "Ticket #3325: Shared port service breaks address re-writing", "description": "<blockquote>\nOne of our OSG User School users reports a problem with private networks and the shared port service.  He has one machine which is a central manager and a submit point.  This machine is dual-homed, with one networking going to a physical network of dedicated machines, and a VPN connecting a set of HTCondor startds running inside of virtual machines.  This all works without the shared port service, but when the shared port is enabled, then when jobs start on the VPN hosts, the startd tries to send the keepalives back to the schedd via the wrong interface, the public interface (which is not routed), then the jobs are killed after 20 minutes.</blockquote>", "remarks": "<blockquote>\n<em>2012-Nov-15 12:34:22 by nwp:</em> <br/>\n\nDid he set PRIVATE_NETWORK_NAME and PRIVATE_NETWORK_INTERFACE in his config?\n\n<p></p><hr/>\n<em>2012-Nov-19 14:40:27 by danb:</em> <br/>\n\nI looked into this.  To my surprise, I found that no address rewriting is <em>ever</em> done when the schedd sends its address to the startd in the claim request protocol.  This is because the address is sent as a CEDAR string rather than as a classad attribute, where address rewriting is automatic.  I am preparing a patch for that.  (See <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=3330\" onclick=\"get_ticket_and_populate_wrapper('3330'); return false;\" title=\"ENABLE_ADDRESS_REWRITING not applied to claim request protocol\">#3330</a></span>)\n\n<p>The question remains, why did this user see things working without shared port and not working with shared port?  Somehow, it must have been working without address rewriting, since whether or not shared port is used, the schedd address is not rewritten to match the network interface used to talk to the startd.  It is not obvious to me how enabling/disabling shared port made any difference.  It would be helpful to know what schedd address was printed in the <code>StartLog</code> with D_FULLDEBUG turned on in both cases.  The line with the schedd address contains the string \"Schedd addr =\".\n\n</p><p></p><hr/>\n<em>2012-Nov-19 14:54:32 by tannenba:</em> <br/>\n\nThanks Dan... since you are preparing the patch, I assigned the ticket over to you...\n\n<p></p><hr/>\n<em>2012-Nov-19 16:06:06 by danb:</em> <br/>\n\nUntil we get more information specifically related to shared port causing problems on multi-homed submit nodes, I'll just leave this ticket as is.  The problem that I found with address rewriting has nothing to do with shared port, and is thus now in its own separate ticket (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=3330\" onclick=\"get_ticket_and_populate_wrapper('3330'); return false;\" title=\"ENABLE_ADDRESS_REWRITING not applied to claim request protocol\">#3330</a></span>).\n\n<p></p><hr/>\n<em>2012-Nov-21 11:13:44 by danb:</em> <br/>\n\nHermann reports that when shared port was removed from the configuration, private network settings were added at the same time.  Therefore, in hindsight, it seems plausible that shared port was not the cause of trouble.  I'm closing this ticket until new evidence suggests otherwise.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2012-Nov-21 11:13", "status": "abandoned", "created": "2012-Nov-15 12:32", "fixed_version": "2012-Nov-15 12:32", "broken_version": "v070800", "priority": "3", "subsystem": "Daemons", "assigned_to": "danb", "derived_from": "", "creator": "gthain", "rust": "", "customer_group": "other", "visibility": "public", "notify": "hermann.fuchs@meduniwien.ac.at,dan@hep.wisc.edu", "due_date": ""}