{"id": 4236, "title": "Ticket #4236: CCB listener should disconnect", "description": "<blockquote>\nThe CCB protocol has no explicit disconnect RPC - the CCB listener simply hangs up on the server and the daemon exits.\n\n<p>This is very problematic for the glideinWMS use case; it's not possible to distinguish between \"daemon shut down\" and \"transient network issue\".  We observe the following sequence of events:\n</p><ul>\n<li>Negotiator queries collector for list of startds, which includes worker node foo.\n</li><li>Negotiator matches foo to schedd bar.\n</li><li>Foo shuts down and disconnects from the CCB.\n</li><li>Schedd bar launches shadow, which attempts to activate claim for foo.\n</li><li>Shadow blocks for several minutes trying to connect to startd which is already shut down.\n</li></ul>\n\n<p>If the CCB was aware that the connection was hopeless, we could save a significant amount of time in the last step.  More importantly, we could distinguish between a network issue with a glidein and a clean shutdown.  Right now, if we see shadows failing to connect to a glidein-based startd, it's a long process to correlate logs across several machines (usually to discover it was a clean shutdown).</p></blockquote>", "remarks": "<blockquote>\n<em>2014-Apr-01 08:38:28 by bbockelm:</em> <br/>\n\nI did some investigation here -\n\n<p></p><ul>\n<li>Adding an explicit \"disconnect\" message appears to be feasible in a backward-compatible manner.\n</li><li>The disconnect won't really buy us much efficiency in activating claims.  Right now, it will try only one connection per CCB server (so, on the CMS CCB setup, it currently tries twice).  So, the impact outside CMS will probably be fairly limited.\n</li><li>Seems like the bigger impact is that we can log communication attempts after explicit disconnects (for example, trying to claim a dead startd) and the frequency of unexpected disconnects.\n</li></ul>\n\n<p></p><hr/>\n<em>2015-Apr-29 15:12:27 by bbockelm:</em> <br/>\n\nWe agreed 2 weeks ago that we will put this off until 8.5 (and make it high priority then).\n\n<p>Decreasing the priority for now.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2016-Nov-09 13:42", "status": "new", "created": "2014-Mar-02 14:19", "fixed_version": "2014-Mar-02 14:19", "broken_version": "", "priority": "2", "subsystem": "DaemonsCM", "assigned_to": "", "derived_from": "#4490", "creator": "bbockelm", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "bbockelm@cse.unl.edu, isfiligoi@ucsd.edu", "due_date": ""}