{"id": 4570, "title": "Ticket #4570: Allow override of hostname", "description": "<blockquote>\nThere is no way to control the hostname HTCondor uses.  In the HTCondor-CE code, we use $(FULL_HOSTNAME) extensively (especially in security settings, where we want to make sure FULL_HOSTNAME matches the DN of the host certificate); however, at some sites, FULL_HOSTNAME resolves to the private hostname and IP address (set as the host's default name due to restrictions on the other batch system).\n\n<p>So, we need a way to override the hostname detection (currently centralized in condor_gethostname).  It seems this is already possible in NO_DNS mode.  I'd propose that we add an environment variable, CONDOR_HOSTNAME, which does the override.\n\n</p><p>Why an environment variable and not a config variable?  Unfortunately, the config variable route can easily result in a non-convergent configuration - the final configuration is often a function of the value of FULL_HOSTNAME.  We also expect this to be used seldom enough that the pain of editing /etc/sysconfig/condor should be justified.\n\n</p><p>Per ToddT (and based on the OSG need), we can backport this to the 8.2 stable series.</p></blockquote>", "remarks": "<blockquote>\n<em>2014-Sep-08 14:49:57 by jfrey:</em> <br/>\n\nI will add a new configuration parameter, NETWORK_HOSTNAME, which will parallel the existing NETWORK_INTERFACE. If NETWORK_HOSTNAME is set, then that value is used for the hostname, instead of calling condor_gethostname().\n\n<p></p><hr/>\n<em>2014-Sep-08 15:31:43 by tannenba:</em> <br/>\n\nNote that <code>NETWORK_HOSTNAME</code>, just like <code>NETWORK_INTERFACE</code>, will need to be set either in the top-level config file or via an environment variable.  Setting it anywhere else (i.e. some condor_config.local) will not work, same as <code>NETWORK_INTERFACE</code>.  Docs should be sure to state this restriction for both of these config knobs....\n\n<p></p><hr/>\n<em>2014-Sep-08 20:27:53 by bbockelm:</em> <br/>\n\nI'm worried a bit about this - I've seen many people mess up \"config file specific parameters\".  It's really inconsistent with how the rest of the config system works.  I'd much rather have less of these than more.  Any changes in condor_config have serious implications to our ability to cleanly upgrade between versions when using RPMs.\n\n<p>Can we ASSERT if NETWORK_HOSTNAME is set in the wrong config file?\n\n</p><p>Why not an environment variable?\n\n</p><p></p><hr/>\n<em>2014-Sep-10 11:12:17 by tannenba:</em> <br/>\n\nIt can be an environment variable.  setenv _condor_NETWORK_HOSTNAME = foo.\n\n<p>Also, Jaime says I am wrong above.  <code>NETWORK_HOSTNAME</code> can appear in any config file.  It is just if it appears in condor_config.local, then you could have troubles if your use $(HOSTNAME) in the LOCAL_CONFIG_FILE knob.\n\n</p><p></p><hr/>\n<em>2014-Sep-10 11:13:02 by tannenba:</em> <br/>\n\nJaime will investigate if we can apply this patch into v8.0.\n\n<p></p><hr/>\n<em>2014-Sep-15 10:18:29 by bbockelm:</em> <br/>\n\nHi @tannenba -\n\n<p>I think you're wrong about this being set-able from other config files due to init_local_hostname.  This gets called before any other config files are read.  Things that could go wrong include:\n</p><ul>\n<li>Anything that references $(HOSTNAME) in the configuration file - as this is expanded after the global config and before others.\n<ul>\n<li>That is, $(HOSTNAME) and $(NETWORK_HOSTNAME) will agree or disagree depending on which file this placed in.\n</li><li>This can include security settings if the admin wants to limit to localhost.\n</li></ul>\n</li><li>As this affects the IP address selection, you'll get the wrong IP address in the advertised <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span> (and possibly HTCondor will bind to the wrong interface).\n</li></ul>\n\n<p>So, important things will or will not work depending on which configuration file this is set in - even if it does not change which configuration files are parsed!  In fact, the pre.  This is the same confusing mistake as was made with ENABLE_IPV6 and I consider it somewhat handing a user a loaded gun.\n\n</p><p>Brian\n\n</p><p></p><hr/>\n<em>2014-Sep-15 15:25:54 by jfrey:</em> <br/>\n\nHave you tried this, Brian? I get the same behavior no matter which config file I set NETWORK_HOSTNAME in.\n\n<p>init_local_hostname() is called a second time after all of the config files are read, and parameters HOSTNAME and FULL_HOSTNAME are reset after that call. So the only difference in whether you place NETWORK_HOSTNAME in the root config file or another config file, is when you use HOSTNAME or FULL_HOSTNAME to define where to find the secondary config files.\n\n</p><p>All macro substitutions in config param values are done lazily, at the time the parameter's value is consulted. Any value that references HOSTNAME or FULL_HOSTNAME will get the final value of those parameters, after all config files have been read and processed. All references to HOSTNAME and FULL_HOSTNAME will agree (except when defining the locations of config files). This is the same as with the existing param NETWORK_INTERFACE.\n\n</p><p>The hostname does not affect the selection of the IP address. There's code in init_local_hostname() that looks like it should, but it never takes effect. The IP address is always determined from NETWORK_INTERFACE, where the default value of * triggers a search of all of the network interfaces and the last most-public address is chosen.\n\n</p><p>Selection of hostname and IP address are completely unrelated. I've made a new ticket about that (<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=4581\" onclick=\"get_ticket_and_populate_wrapper('4581'); return false;\" title=\"Local hostname and IP address unrelated\">#4581</a></span>).\n\n</p><p></p><hr/>\n<em>2014-Sep-17 14:55:14 by bbockelm:</em> <br/>\n\nHi Jaime,\n\n<p>No, this is just based on my previous readings of the code.  If you're sure of it, I'll defer these things to you and we can move forward.\n\n</p><p>Thanks for looking at this!\n\n</p><p>Brian\n\n</p><p></p><hr/>\n<em>2014-Sep-22 13:28:19 by zmiller:</em> <br/>\n\n<strong>CODE REVIEW</strong>: Looks good!</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2014-Sep-11 12:28</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/ddfc9d9329736172dae643daddae6474466b87e3\">[41148]</a></span>: edit doc for new knob NETWORK_HOSTNAME, as well as fix some unrelated spelling mistakes that will appear in the 8.3.1 release. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4570\" onclick=\"get_ticket_and_populate_wrapper('4570'); return false;\" title=\"Allow override of hostname\">#4570</a></span>  (By Karen Miller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2014-Sep-08 15:32</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/1e810693c8a6fc217f79d22b6d9534c56952dd56\">[41121]</a></span>: Docs for new config param NETWORK_HOSTNAME. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4570\" onclick=\"get_ticket_and_populate_wrapper('4570'); return false;\" title=\"Allow override of hostname\">#4570</a></span>  (By Jaime Frey )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2014-Sep-08 15:32</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/f961917d4fd9fdac2763b7b99a7fcd1300d97216\">[41120]</a></span>: New param NETWORK_HOSTNAME can override hostname of local machine. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4570\" onclick=\"get_ticket_and_populate_wrapper('4570'); return false;\" title=\"Allow override of hostname\">#4570</a></span> If NETWORK_HOSTNAME is set in the config file, then we use that value as the hostname of the local machine, rather than calling gethostname().  (By Jaime Frey )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2014-Sep-22 13:28", "status": "resolved", "created": "2014-Sep-04 08:34", "fixed_version": "2014-Sep-04 08:34", "broken_version": "", "priority": "2", "subsystem": "Daemons", "assigned_to": "jfrey", "derived_from": "#4555", "creator": "bbockelm", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "bbockelm@cse.unl.edu tannenba@cs.wisc.edu blin@cs.wisc.edu", "due_date": ""}