{"id": 5696, "title": "Ticket #5696: add knob to allow CCB reconnections from any ip address", "description": "<blockquote>\nWhen a daemon contacts a CCB server and requests a listen port, the CCB server returns a CCB ID and a cookie (capability string) to the daemon.  In the event that TCP socket to the CCB server is closed, the daemon can send a reconnect request to the CCB server in order to keep the same CCB ID.  The reconnect request must contain a copy of the cookie that was generated by the server during the original request, and also originate from the same IP address.\n\n<p>To help facilitate the placement of HTCondor daemons inside of virtual machines that hibernate and subsequently restart with a different public IP address (think CMS@Home type volunteer computing, where the execute node may be a laptop that moves from a work network to a home network), we want a patch to relax the CCB server requirement that the reconnect request must come from the same public IP.\n\n</p><p>Propose a patch to introduce CCB server knob <code>CCB_RECONNECT_ALLOWED_FROM_ANY_IP</code>, which defaults to false.  If true, then the reconnect request can come from any IP address that can still produce the cookie.\n\n</p><p>At this point, we do not want to document this knob, because it may go away; at this point we want it just for testing purposes.  Ideally, eventually each individual CCB connection will be able to state if a reconnect is allowed from a different address instead of a single knob that impacts them all.</p></blockquote>", "remarks": "<blockquote>\n<em>2016-May-26 16:22:38 by jfrey:</em> <br/>\n\n<strong>Code Review</strong>\n\n<p>This change looks good.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2016-May-26 16:19</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/844757eb4c932789f0287c1e14c7ed4db96432e7\">[48424]</a></span>: Implement knob CCB_RECONNECT_ALLOWED_FROM_ANY_IP. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=5696\" onclick=\"get_ticket_and_populate_wrapper('5696'); return false;\" title=\"add knob to allow CCB reconnections from any ip address\">#5696</a></span> Defaults to false. If true, tells the CCB server to allow CCB reconnects to happen from any IP address that has a valid cookie for the desired CCB id.  (By Todd Tannenbaum )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2016-May-26 16:23", "status": "resolved", "created": "2016-May-26 16:16", "fixed_version": "2016-May-26 16:16", "broken_version": "", "priority": "3", "subsystem": "CCB", "assigned_to": "tannenba", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "", "due_date": ""}