{"id": 6847, "title": "Ticket #6847: Design a load-balanced HTTP file service for CHTC", "description": "<blockquote>\nWe want to design and implement a load-balanced HTTP file server which we'll deploy somewhere in the CHTC cluster. This will help solve several problems:\n\n<p></p><ul>\n<li>Jobs with large file transfers can place a heavy load on the submit servers. We want to shift this burden onto dedicated infrastructure whose only job is to serve files.\n</li><li>Some CHTC users are using offsite file services which are very slow to download/upload data from.\n</li><li>Some external users have been asking for something similar, we want to gain experience in this area so we can better advise them.\n</li></ul>\n\n<p>This ticket is largely a placeholder for a design document that will explain the architectural details for such a system. We'll look at many questions including the following:\n\n</p><p></p><ul>\n<li>What does the hardware architecture look like? How many physical machines do we need to host the various components? What hardware will we need to purchase?\n</li><li>What does the software architecture look like? Will the load-balanced HTTP nodes be hosted in VMs or containers?\n</li><li>What does the file system look like? Assuming we use a shared file system, is it better to go with HDFS, CEPH or something different?\n</li><li>Where on the UW campus network is the best place for this to live?\n</li><li>How much file system redundancy do we want?\n</li><li>How many load balanced nodes do we want?\n</li></ul>\n\n<p>Design document and ticket updates to follow.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2019-Jan-03 13:18", "status": "new", "created": "2019-Jan-03 13:18", "fixed_version": "2019-Jan-03 13:18", "broken_version": "", "priority": "3", "subsystem": "FileTransfer", "assigned_to": "coatsworth", "derived_from": "", "creator": "coatsworth", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "coatsworth@cs.wisc.edu, tannenba@cs.wisc.edu, wiscmoate@gmail.com", "due_date": ""}