{"id": 7280, "title": "Ticket #7280: 8.7 to 8.9 upgrade caused VM universe jobs to stop matching", "description": "<blockquote>\nWhen the SWAMP upgraded from 8.7 to 8.9, VM universe jobs stopped matching.  Those jobs' submit files included lines much like the following:\n\n<p></p><div class=\"file\">\n<pre class=\"filelabel\">swamp.submit</pre>\n<pre class=\"file\">+JobVMNetworking = true\n+JobVMNetworkingType = swampinabox\n</pre></div>\n\n\n<p>Because of the leading <code>+</code>, the right-hand side is interpreted as a <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span>, which makes the value of the attribute <code>JobVMNetworkingType</code> a reference to the attribute <code>swampinabox</code>.  This attribute does not exist, so the value of <code>JobVMNetworkingType</code> is undefined.\n\n</p><p>In 8.7, this didn't matter because the job's <code>Requirements</code> expression did not include <code>JobVMNetworkingType</code> for this job; in 8.9 it does.  Since all startds in a SWAMP-in-a-Box actually had the 'swampinabox' network, this did not cause problems.  I assume that either (a) the default network worked or (b) the awk script used to generate the libvirt XML files just assumed that all of the job-ad attributes that were supposed to be strings were strings, and used the value of <code>JobVMNetworkingType</code> without checking (maybe after stripping some non-existing double quotes).\n\n</p><p>The intent in 8.7 was clearly to include a networking-type requirement if the user specified a networking type.  I don't know if using the issue is that 8.7 and 8.9 are treating absent attributes and undefined attribute references differently, or if that in 8.9, the VM universe requirements-writing is done against the job ad (as modified by the <code>+</code>) instead of the submit file.\n\n</p><p>The immediate fix for SWAMP was to\n\n</p><p>(a) add \"swampinabox\" to the list of vm networking types in the startd config\n\n</p><p></p><div class=\"file\">\n<pre class=\"filelabel\">swamp-modified.config</pre>\n<pre class=\"file\">VM_Networking_Types = \"nat,swampinabox\"\n</pre></div>\n\n\n<p>and (b) quote \"swampinabox\" in their submit file template(s).\n\n</p><p></p><div class=\"file\">\n<pre class=\"filelabel\">swamp-modified1.submit</pre>\n<pre class=\"file\">+JobVMNetworking = true\n+JobVMNetworkingType = \"swampinabox\"\n</pre></div>\n\n\n<p>The work for us is to determine if (a) 8.8 and 8.9 are consistent in this behavior and (b) if we thinkg the 8.7 or 8.9 behavior is correct.\n\n</p><p>SWAMP may also benefit from switching from the syntax above to using the equivalent submit language commands, although I haven't verified that the second one actually works.\n\n</p><p></p><div class=\"file\">\n<pre class=\"filelabel\">swamp-modified2.submit</pre>\n<pre class=\"file\">vm_networking = true\nvm_networking_type = swampinabox\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n<em>2019-Sep-24 14:33:45 by johnkn:</em> <br/>\n\nTodd's analysis is correct here. In 8.8 requirements generation is done by looking at submit commands, which are not being set.\n\n<p>In 8.9 requirements generation is done using job attributes, which <strong>are</strong> being set here, but set incorrectly, so that the generated requirements will only work if <code>swampinabox</code> is a string-valued job or machine attribute that is one of the advertised VM networking types.\n\n</p><p>Essentially, the switch to 8.9 exposed a bug in the submit files.\n\n</p><p>Also, it is bad form to bypass the submit keywords in 8.8 because that also bypasses requirements generation.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2019-Sep-24 14:33", "status": "new", "created": "2019-Sep-23 17:33", "fixed_version": "2019-Sep-23 17:33", "broken_version": "", "priority": "3", "subsystem": "Libs", "assigned_to": "johnkn", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edy, rgardner@continuousassurance.org, TBricker@continuousassurance.org", "due_date": ""}