{"id": 7446, "title": "Ticket #7446: Enable condor_fetchlog with fine-grained auth", "description": "<blockquote>\nCurrently, <code>condor_fetchlog</code> contacts a remote daemon and performs a command to fetch the contents of a logfile.\n\n<p>With the introduction of fine-grained authentication, we do not envision startds acting as servers and establishing a new security session as the startd host has only a fine-grained token and not the password file.\n\n</p><p>We should take the lead from how the schedd / negotiator relationship currently works - the <code>condor_master</code> could advertise a capability to the collector and pre-register it as a security session.  Then, any connection coming from that specific security session will be pre-authorized to fetch the log.</p></blockquote>", "remarks": "<blockquote>\n<em>2020-Jan-10 16:08:52 by tlmiller:</em> <br/>\n\nResults of our Thursday (2020-01-10) meeting (as I recall them):\n\n<p></p><ul>\n<li>Code to advertise a fine-grained capability should move into daemon core.  (Off by default.)\n</li><li>We should take this opportunity to improve our forward-compatibility with respect to private attributes; some new attribute prefix should always be private.\n</li><li>We should think about startd flocking while implementing and this reviewing this; the first consequence is that we need a way to determine which collectors are trusted.\n</li><li>We should merge the patch which makes checking a socket for authorization a single function call.\n</li><li>We still want to explain this to Zach and have him review the idea (and, probably, some of the code).</li></ul>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Jan-10 16:08", "status": "new", "created": "2019-Dec-26 20:28", "fixed_version": "2019-Dec-26 20:28", "broken_version": "", "priority": "4", "subsystem": "DaemonMaster", "assigned_to": "bbockelm", "derived_from": "#7445", "creator": "bbockelm", "rust": "", "customer_group": "other", "visibility": "public", "notify": "bbockelman@morgridge.org", "due_date": ""}