{"id": 882, "title": "Ticket #882: DAGMan should use flex/yacc and have a real AST", "description": "<blockquote>\nCurrently, dagman does a one pass adhoc compilation of dagfiles into an in memory dag. This makes maintaining and extending the dagman language harder than it needs to be. What we should do is use standard tools like flex/bison and rewrite the front end to parse the dagfiles into an in memory AST, run various type checking and splice coalescing passes over it, then convert the AST into the in memory dag.\n\n<p>Regularizing the tokenization of the dag language would allow us to use C style string literals in many places we don't now like <span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=725\" onclick=\"get_ticket_and_populate_wrapper('725'); return false;\" title=\"VARS values cannot contain spaces\">#725</a></span>. The current lexer doesn't allow spaces in file names, job names,or in arguments to SCRIPTs. The current design of the lexer means each place where we handle those lines we must code an independent solution.\n\n</p><p>Also, having an AST which could act as an intermediate language for the dag allows us to plug in different front end lexer/parsers, such as for the Pegasus dax language.\n\n</p><p>As a proof of concept, I wrote a new lexer in 4 hours which not only tokenizes a reasonable interpretation of the current tokens in the dag language, but accepts string literals in all locations where we'd like. I'd predict maybe 40 more hours of work to write the bison file and get a complete AST in memory with the same multi-dag parsing functionality that dagman currently has.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/120/dag.lex\">dag.lex</a>\n6709 bytes added by psilord on 2009-Oct-22 21:45:35 UTC.\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "enhance", "last_change": "2010-Jan-31 13:22", "status": "new", "created": "2009-Oct-22 16:41", "fixed_version": "2009-Oct-22 16:41", "broken_version": "", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "", "creator": "psilord", "rust": "", "customer_group": "other", "visibility": "public", "notify": "psilord@cs.wisc.edu, wenger@cs.wisc.edu", "due_date": ""}