{"id": 96, "title": "Ticket #96: NFS check in schedd done as wrong user", "description": "<blockquote>\nWhen a job completes, the schedd checks whether its IWD is on NFS. If it is, then the schedd creates and unlinks a file in the directory. This forces the NFS client to sync with the server, ensuring any files created or modified on the execute machine appear when the schedd scans the directory.\n\n<p>The schedd does its check of the directory being on NFS as user condor. Thus, if any parent directory doesn’t have any global permissions enabled, the check will fail, even if the directory is on NFS.\n\n</p><p>The schedd does switch uids to the job owner to do the file create/unlink. This patch moves the uid switch to before the NFS check.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jan-23 16:53:48 by jfrey:</em> <br/>\n\nFrom matt (originally in Drupal):\n\n<p>Why even try to detect NFS? What does it hurt to always create and unlink a file in the IWD? It would possibly be unnecessary in many situations, but we could avoid using the NFS detection code, which has been painful to port in the past.\n\n</p><p></p><hr/>\n<em>2009-Jan-24 21:55:38 by matt:</em> <br/>\n\nI might add that part of the pain in porting this code is finding the header with the proper magic number to identify NFS, without bringing in symbols that muck with condor_common.h, among other things. At one point GregT pointed out that the magic number is not likely to change...</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/4/schedd-nfs.patch\">schedd-nfs.patch</a>\n1954 bytes added by jfrey on 2009-Jan-23 22:54:41 UTC.\n<br/>\nProposed patch.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "defect", "last_change": "2010-Jan-31 13:20", "status": "new", "created": "2009-Jan-23 16:53", "fixed_version": "2009-Jan-23 16:53", "broken_version": "", "priority": "4", "subsystem": "Daemons", "assigned_to": "jfrey", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}