{"id": 3643, "title": "Ticket #3643: automate cgroups configuration in the condor rpm", "description": "<blockquote>\nSupport for cgroups requires some basic configuration after installing HTCondor.  In the RPM, see if this configuration can be done so cgroups can be ready to use out-of-box.</blockquote>", "remarks": "<blockquote>\n<em>2013-May-21 12:41:49 by bbockelm:</em> <br/>\n\nFWIW - this would be a good one to leave for the end / later.  This would require mucking around with libcgroups config files - and they aren't very flexible.\n\n<p>We could probably provide a few sample configs, but we can't really take over libcgroup's bits.\n\n</p><p></p><hr/>\n<em>2013-Jun-13 18:03:43 by edquist:</em> <br/>\n\nI see; it's too bad there isn't an /etc/cgconfig.d/ or something for this...\n\n<p>It does look like libcgroup's default cgconfig.conf has all the right mount definitions, so just the group htcondor section would need to be added...  Would it be bad-form to have a cgroup (or cgroup-config) sub-package that added/removed a well-defined section?  Something like:\n\n</p><p></p><pre>  ### BEGIN HTCONDOR CONFIG ###\n  group htcondor {\n        cpu {}\n        cpuacct {}\n        memory {}\n        freezer {}\n        blkio {}\n  }\n  ### END HTCONDOR CONFIG ###\n</pre>\n\n<p>Since that's hopefully exactly what they want if they're installing that sub-package...  Otherwise, providing an example config is better than nothing, but it's an extra setup step and may mean digging around in the manual...\n\n</p><p></p><hr/>\n<em>2013-Jun-14 07:18:00 by bbockelm:</em> <br/>\n\nYes, that would be bad form.  Packages shouldn't be editing other package's files.\n\n<p>Even if you decided to do that, it's near impossible to get right (as you need to use trigger scripts) and difficult to detect admin changes.\n\n</p><p>If we want to automate cgroup configuration, we should do this in HTCondor.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Jul-16 11:02", "status": "defer", "created": "2013-May-21 10:46", "fixed_version": "2013-May-21 10:46", "broken_version": "", "priority": "4", "subsystem": "Packaging", "assigned_to": "edquist", "derived_from": "#3638", "creator": "edquist", "rust": "", "customer_group": "other", "visibility": "public", "notify": "edquist@cs.wisc.edu", "due_date": ""}