{"id": 5177, "title": "Ticket #5177: test job_test_urlfetch", "description": "<blockquote>\nTest condor_url fetch. No condor is needed to be run. We have a number of steps we want to take.\n\n<p></p><ol>\n<li>Establich the simple python based simple webserver which routinely\nlistens at port 8000. See about a test specific port and take down the web\nserver when the test is done with it. an optional arg can be used to\nlisten on a different port.\n</li><li>be in a test specific directory when the server is started and remove this\ndirectory when the test is done with it.\n</li><li>Create a new perl module <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ConfigTools\" title=\"Config Tools\">ConfigTools</a></span> to gather config tools scattered amongst other tests and then adapt those tests to use same perl module.\n</li><li>take the results from the generate config function to drop a file into the simple web server top folder, create the associated config based on running condor_urlfetch within an initial config file for the test.\n</li></ol>\n\n<p><strong class=\"two\">things to test</strong>\n\n</p><p></p><ol>\n<li>The results for dumping unique* should be what we wrote to the web server location.\n</li><li>local config file should be set to the entire urlfetch line from the config file processed.\n</li><li>There should be no leaking of temp files\n</li><li>if it is not -master, but say -schedd, the specified file cache should not be changed.\n</li><li>If the web server is down, the config cache file should be used.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<em>2015-Jul-27 14:50:21 by bt:</em> <br/>\n\nWe have the simple python webserver going up and down upon exits.\n\n<p>We are working on the first function within Config Tools.pm\nwith a single function to build in a refference to an array\nthe createed configuratioon.\n\n</p><p>Now I am working to use the results from the config function to set up\nto call condor_urlfetch.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Aug-28 16:04", "status": "abandoned", "created": "2015-Jul-27 14:47", "fixed_version": "2015-Jul-27 14:47", "broken_version": "", "priority": "4", "subsystem": "Tests", "assigned_to": "bt", "derived_from": "#4520", "creator": "bt", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "johnkn@cs.wisc.edu", "due_date": ""}