{"id": 1018, "title": "Ticket #1018: queue super user cannot drop privs", "description": "<blockquote>\nAs of 7.2.0, the queue super user has the power to change the value of Owner to any owner who has a job in the queue or who has ever had a job in the queue during the life of the current running schedd.  This was added for <code>JobRouter</code>.\n\n<p>The problem with this is that condor_shadow authenticates to the schedd as the condor user (always a super user) when performing set_job_attr operations on behalf of chirp calls made by the job.  Therefore, the job can change its own Owner attribute, requeue itself, and gain access to somebody else's account.  It can only gain access to accounts that have submitted a job to condor or to the \"condor\" user, and it can not gain access to root, because condor will not run jobs as root.\n\n</p><p>A pithy example of how to reproduce the problem appears in a remark from tannenba below.\n\n</p><p>The solution we decided to pursue in 7.2.5 and 7.4.1 is to add a qmgmt command that allows the queue super user to reduce privileges to that of an ordinary user so that all subsequent operations in the qmgmt session are done as though by the other user (like seteuid() in unix).  The job queue updater used by the shadow (and local starter) does this in all cases immediately after establishing a qmgmt session.  This addresses the problem of chirp but also reduces risk of other operations being allowed that should not be.\n\n</p><p>Changing the shadow to authenticate as the user instead of condor is another possible solution.  This is problematic, because not all authentication methods support authenticating as the user from within a condor daemon.  For those methods that do support authentication based on priv state (such as FS), the security session cache does not keep track of what priv state was used to create the session, so we would either need to fix that, or change all shadow --&gt; schedd communication to be done as the user (including the daemon keepalive and possibly other things I am forgetting).\n\n</p><p>Removing the power of the super user to directly change Owner is another option.  In fact, with the \"seteuid()\" qmgmt operation, the <code>JobRouter</code> should no longer need the queue super user to have the power to directly set Owner.  However, changing the <code>JobRouter</code> seems like a larger than necessary change in the stable series, so this should probably be done in the current development series, leaving the extra super user power as is in the stable series if not beyond.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Dec-02 18:41:01 by danb:</em> <br/>\n\nTodd had an idea: just make Owner immutable.  <code>JobRouter</code> does not need to change the owner.  It just needs to be able to set it.\n\n<p>I'm planning to make a patch that does that in 7.2 and forward.  I already have a patch that implements qmgmt seteuid, and it's not very complex, but given the immutable Owner, I think the seteuid patch can be safely put in 7.5 instead of the stable series.\n\n</p><p></p><hr/>\n<em>2009-Dec-03 10:18:58 by danb:</em> <br/>\n\nThe problem is slightly worse than we previously thought.  Even before 7.2.0 chirp can set the owner to the condor user.  This is possible because in all existing versions of condor, any user is allowed to set Owner to the authenticated name of the qmgmt connection, and the shadow authenticates as the condor user.\n\n<p>So in all versions of condor that support chirp's set attribute operation (appears to be 6.5.4+), it is possible to become the condor user.  In 7.2.0+, it is also possible to become other users who have previously submitted jobs.  Since the condor user is always the queue super user (regardless of configuration), becoming the condor user gives one power to modify all other jobs in the queue, effectively allowing one to become those users as well.  Therefore, the only additional exposure added in 7.2.0+ is the ability to become users who no longer have jobs in the queue but who submitted jobs to this schedd in the past (since the schedd was last started).\n\n</p><p></p><hr/>\n<em>2009-Dec-03 15:18:11 by danb:</em> <br/>\n\nI have attached two patches, one proposed for stable series 7.2 and 7.4 and the other for the development series 7.5.  The stable series patch makes Owner immutable.  The development series patch makes the job queue updater (used by shadow and local starter) set its effective qmgmt owner name to the user.\n\n<p></p><hr/>\n<em>2009-Dec-04 13:16:03 by tannenba:</em> <br/>\n\nPithy example of how to reproduce this issue.\n\n<p>When you first submit the below job, the Owner attribute will be that of the submitting user.  However, after the job runs, the Owner attribute will change.\n\n</p><p>Assuming that your are running bash and Condor is in your path.\n\n</p><p>1. First create file <code>test.sub</code> :\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">universe = vanilla\n+WantIOProxy = True\nexecutable = $ENV(CONDOR_CHIRP)\narguments = set_job_attr Owner \\\"$ENV(CONDOR_USER)\\\"\nwhen_to_transfer_output = ON_EXIT\nleave_in_queue = JobStatus==4\nqueue\n</pre></div>\n\n\n<p>2. Then enter the following commands:\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">bash\nexport CONDOR_USER=`condor_config_val schedd_log | xargs ls -l  | awk '{print $3}'`\nexport CONDOR_CHIRP=`condor_config_val libexec`/condor_chirp\ncondor_submit test.sub\n</pre></div>\n\n\n<p></p><hr/>\n<em>2009-Dec-04 14:56:35 by tannenba:</em> <br/>\n\nFinished code review of stable series fix, and pushed it to V7_2-branch, then merged this into V7_4_1-branch, V7_4-branch, and master.\n\n<p></p><hr/>\n<em>2009-Dec-07 13:25:59 by danb:</em> <br/>\n\nThe devel-series fix has been committed for 7.5.0 and both <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=JobRouter\" title=\"Job Router\">JobRouter</a></span> and Gridmanager have been updated to use the new \"set effective owner\" qmgmt mode.  I am closing this ticket.\n\n<p></p><hr/>\n<em>2010-Feb-01 13:23:15 by tannenba:</em> <br/>\n\nSecurity embargo period is over, making this information public.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/127/0001-Devel-series-fix-for-issue-described-in-1018.patch\">0001-Devel-series-fix-for-issue-described-in-1018.patch</a>\n10971 bytes added by danb on 2009-Dec-03 21:09:35 UTC.\n<br/>\n(This proposed devel series patch was actually made against 7.2-branch, so it may need slight modification to apply against master branch.)<br/>\n</li><li><a href=\"../files/128/0001-Stable-series-fix-for-issue-described-in-1018.patch\">0001-Stable-series-fix-for-issue-described-in-1018.patch</a>\n1972 bytes added by danb on 2009-Dec-03 21:10:00 UTC.\n</li></ul>\n</blockquote></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Dec-04 17:23</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/68ad3710f3a44f5138d75bdae1eb198ea9b8f633\">[16505]</a></span>: Devel series fix for issue described in <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1018\" onclick=\"get_ticket_and_populate_wrapper('1018'); return false;\" title=\"queue super user cannot drop privs\">#1018</a></span>  (By Dan Bradley )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Dec-04 14:04</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/227e27dd7ad908ec59baf7ad5b50e5537e26544d\">[16495]</a></span>: See issue <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1018\" onclick=\"get_ticket_and_populate_wrapper('1018'); return false;\" title=\"queue super user cannot drop privs\">#1018</a></span>.  (By Todd Tannenbaum )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2010-Feb-01 13:23", "status": "resolved", "created": "2009-Dec-02 13:34", "fixed_version": "2009-Dec-02 13:34", "broken_version": "v060504", "priority": "2", "subsystem": "Daemons", "assigned_to": "tannenba", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tannenba@cs.wisc.edu,zmiller@cs.wisc.edu matt@cs.wisc.edu", "due_date": "20091204"}