{"id": 115, "title": "Ticket #115: Scrub download data", "description": "<blockquote>\nIn the download logs, from roughly April to May 2008, if the user used reload, bookmarks, or back/forward, they could be listed as downloading the same file repeatedly. This has since been corrected. (It&amp;#8217;s still possible, but much, much more unlikely.) However, the old downloads are still in the logs. This data should be expunged.\n\n<p>The logs are in /p/condor/public/license/sendfile-*\n\n</p><p>A tool to copy the file from stdin to stdout, expunging the duplicates can be found in /p/condor/workspaces/adesmet/graphs/downloads/scrub-sendfile. I&amp;#8217;ll attach a copy as well. If the version in /p/condor/workspaces is still around, it&amp;#8217;s probably newer and should be preferred.\n\n</p><p>The tool just looks for multiple downloads of the same file by the same email address inside of $WINDOW, which is a number of seconds. We might use a value of somewhere between 60*60*1 and 60*60*24 inclusive depending on how aggresive we want to be. To purge any duplicate downloads, you could use 60*60*24*365.\n\n</p><p>The tool relies on a quirk of the new system to identify potentially wrong records. (The old system provided an ID number that was the pid. The new system uses a pid and an additional number, seperated by an underscore.) Old records should be passed through unmodified. As a result, no matter how aggressively you set the tool, it won&amp;#8217;t purge duplicate downloads from the old system.\n\n</p><p>Be wary when making this adjustment; the condor-admin mail filter is appending to these files frequently; done wrong you could lose some data.\n\n</p><p>(Imported from <span class=\"drupalnode\"><a href=\"http://drupal-old.batlab.cs.wisc.edu/node/1627\">1627 (backup)</a> <a href=\"http://nmi.cs.wisc.edu/node/1627\">1627 (public)</a></span>)</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/8/scrub-sendfile\">scrub-sendfile</a>\n2364 bytes added by adesmet on 2009-Jan-26 17:26:16 UTC.\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "todo", "last_change": "2010-Jan-21 11:02", "status": "new", "created": "2009-Jan-26 11:25", "fixed_version": "2009-Jan-26 11:25", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "PitS", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}