{"id": 1199, "title": "Ticket #1199: Make a nightly script to build non-official platforms in NMI", "description": "<blockquote>\nThe nightly.pl script should be amended to allow a command line option to name set of platforms that condor_nmi_submit should use when building with respect to the tags file. Then a new instance of the script should be run from cron on nmi-s006 about 15 minutes after the official nightly builds have been initiated.\n\n<p>This is to allow us to build Condor on the platforms NMI specifically cares about but for which we don't have an official port. These ports are usually very bare bones, often just enough to run vanilla jobs and hawkeye. NMI needs them because sometimes there are no binary compatible options from our official ports.</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Feb-10 16:22:34 by psilord:</em> <br/>\n\nOk, I've made the changes to nightly.pl, updated the nmi-s006 copy of it, and added it to the crontab.\n\n<p>I talked to bt, and he said that likely the nmi builds and the official nightlies will intersect in the history pages for a branch/tag in our stuff. But the platforms themselves and the tests that ran won't, which is good. The history of an individual test will collide, by having a larger matrix of platforms, but fw can figure that out because we know what is supposed to be official and what isn't.\n\n</p><p>I'll check on it tomorrow and see what happened.\n\n</p><p></p><hr/>\n<em>2010-Feb-11 09:55:12 by psilord:</em> <br/>\n\nAfter a night's building, it looks like --desc doesn't play well with --nightly.\n\n<p>In looking, --desc trumps the description set by --nightly. What I will do in this case is change the semantics of those two option in relation together such\nthat if --nightly and --desc are used at the same time, the --desc is appended to whatever --nightly wanted to use as the desc.\n\n</p><p>This will allow us to mark a set of builds (denoted by the nightly tags file) with a description, but not have them all collapse together.\n\n</p><p>I do not believe there are any other situations where --nightly and --desc are used together, so changing this semantic in this context seems like a good idea to me.\n\n</p><p></p><hr/>\n<em>2010-Feb-11 10:51:49 by psilord:</em> <br/>\n\nI added functionality to support --desc and --nightly together. Let's see what happens tonight....\n\n<p></p><hr/>\n<em>2010-Feb-15 15:16:38 by psilord:</em> <br/>\n\nThis script appears to be working, resolving.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Feb-12 09:34</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/649bc786e567c90a1cffacbccc53a34f741a11b8\">[17214]</a></span>: Did another change in the hopes I can get the nightly build and test pages to separate the nmi ports builds from the official builds. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1199\" onclick=\"get_ticket_and_populate_wrapper('1199'); return false;\" title=\"Make a nightly script to build non-official platforms in NMI\">#1199</a></span>.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Feb-11 10:43</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/d00cb56649b2659352399cd7f0ccf78cac7edd3a\">[17197]</a></span>: Added functionality so that when --desc and --nightly are used together, the command line specified description gets appended to the autogenerated description from the nightly tags file (which is a build tag). This allows us to denote a set of branches with a particular description in a nightly build [...]\n (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Feb-10 16:08</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/ef8f629bf42a7c07f53cb2e26ebcfeef873848f9\">[17188]</a></span>: Added the ability to specify a communal description and platform list to condor_nmi_submit when it submits the various nightly tags. This is so we can submit a different set of nightly builds than our one for the official ports. [...]\n (By Peter Keller )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2010-Nov-19 11:14", "status": "resolved", "created": "2010-Feb-10 10:49", "fixed_version": "2010-Feb-10 10:49", "broken_version": "", "priority": "3", "subsystem": "Packaging", "assigned_to": "psilord", "derived_from": "#715", "creator": "psilord", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "psilord@cs.wisc.edu, bgietzel@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": "20100216"}