{"id": 1264, "title": "Ticket #1264: Windows Daemons Refuse to Shutdown", "description": "<blockquote>\nNumerous attempts to shutdown the condor service fail on XP SP3 under a user with full admin privs:\n\n<p>net stop condor &amp;&amp;\ncondor_off -master -fast\n\n</p><p>03/08 08:12:29 PERMISSION DENIED to unauthenticated user from host 127.0.0.1 for\n command 60008 (DC_CHILDALIVE), access level DAEMON: reason: DAEMON authorizatio\nn policy contains no matching ALLOW entry for this request; identifiers used for\n this host: 127.0.0.1,localhost\n\n</p><p>When trying to modify the ALLOW expression and reconfig you will recv the same error.\n\n</p><p>What is even more odd, is that this does not always happen.\n\n</p><p>To remove, I usually have to restart my machine then it comes off cleanly.</p></blockquote>", "remarks": "<blockquote>\nYou also see numerous:\n\n<p>03/08 08:51:29 PERMISSION DENIED to unauthenticated user from host 127.0.0.1 for command 60008 (DC_CHILDALIVE), access level DAEMON: reason: cached result for DAEMON; see first case for the full reason\n\n</p><p></p><hr/>\n<em>2010-Mar-08 10:30:10 by danb:</em> <br/>\n\nOdd that the behavior is not always the same.  I recommend checking why it says it is allowing this operation in the case where things work.  Then perhaps we can understand the difference between the two cases.\n\n<p>With the D_SECURITY and D_COMMAND debug options enabled, you should see log messages for every command that is received and it should tell you not only why it denies requests but also why it accepts requests.\n\n</p><p></p><hr/>\n<em>2010-Mar-10 13:32:48 by tannenba:</em> <br/>\n\nConfused why you are mixing apples and oranges by doing both a net stop condor and a condor_off.\n\n<p>Does the problem happen when you do just \"net stop condor\" alone?\n\n</p><p>In attempting to reproduce, the only issue I encountered was sometimes net stop condor fails because Condor does not get off the machine fast enough.  Currently \"net stop condor\" does a shutdown graceful; I will commit a patch to change net stop condor to result in a condor_shutdown -fast, which is what I think most users would want/expect.\n\n</p><p></p><hr/>\n<em>2010-Mar-16 17:07:54 by pmackinn:</em> <br/>\n\nTodd, do we really want that? Perhaps its OK for the DC daemons but we also have a non-DC Python daemon under master handling remote configuration, that would have its interpreter killed immediately with no chance for clean up. We can't trap SIGKILL in the Python code on Windows.\n\n<p></p><hr/>\n<em>2010-Mar-16 17:14:11 by pmackinn:</em> <br/>\n\nNor SIGQUIT :-)\n\n<p></p><hr/>\n<em>2010-Mar-16 17:26:39 by pmackinn:</em> <br/>\n\nActually, it appears that the change has no effect in our Python/Windows use case. We won't get those signals on Windows and still need to trap a WM_CLOSE message.\n\n<p></p><hr/>\n<em>2010-Mar-16 22:04:10 by tstclair:</em> <br/>\n\nI've come across this scenario by chance on windows prior to adding 127.0.0.1 explicitly to the ALLOW_WRITE param.  FULL_HOST was there, but for whatever reason (not always) net stop condor would fail.\n\n<p>Then after waiting a long period of time, I tried condor_off -master -fast and you would see the afore mentioned line, and no shutdown.\n</p><hr/>\n<em>2010-Aug-23 17:42:37 by adesmet:</em> <br/>\n\nBulk change of target version from v070403 to v070404 using ./ticket_target_mover.\n\n<p></p><hr/>\n<em>2010-Sep-28 08:44:38 by tstclair:</em> <br/>\n\nI had forgotten to mention that I have a multiple networks cards in *this machine.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Mar-16 16:52</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/8ea4d49cbbeeb360a9fb2aae00fe5251c1f15a7b\">[17643]</a></span>: On Win32, \"net stop condor\" will now perform a fast shutdown instead of a graceful Condor shutdown. (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1264\" onclick=\"get_ticket_and_populate_wrapper('1264'); return false;\" title=\"Windows Daemons Refuse to Shutdown\">#1264</a></span>)  (By Todd Tannenbaum )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2010-Sep-28 08:44", "status": "resolved", "created": "2010-Mar-08 08:53", "fixed_version": "2010-Mar-08 08:53", "broken_version": "v070400", "priority": "2", "subsystem": "Win32", "assigned_to": "tannenba", "derived_from": "", "creator": "tstclair", "rust": "", "customer_group": "users", "visibility": "public", "notify": "matt@cs.wisc.edu, pmackinn@redhat.com, dan@hep.wisc.edu, tstclair@redhat.com", "due_date": ""}