{"id": 1280, "title": "Ticket #1280: Gram jobmanager version command doesn't work in most cases", "description": "<blockquote>\nGram's jobmanager version command doesn't work in most cases. The gram client library explicitly disables proxy delegation for this command. This causes the jobmanager to fail on start-up when it attempts to acquire a proxy (as it wants the delegated one). This causes the jobmanager to close the connection to the client without sending a reply. This results in a gram error 10 being returned to the caller. All versions of the jobmanager do this, so the client can't even determine if the jobmanager is GRAM2 or GRAM5.\n\n<p>If the server has a proxy for the mapped user in the default location in /tmp, the jobmanager is able to start up properly and either send back a valid reply (GRAM5) or an error 91 (GRAM2). This will normally not happen.\n\n</p><p>A simple fix would be to allow delegation of the proxy for the version command. The change would have to be made inside the gram client library. If a fix isn't available from Globus in time for 7.5.2, we should patch the version of Globus we build for Condor to include this change.\n\n</p><p>More information is available here: <a class=\"external\" href=\"http://jira.globus.org/browse/GRAM-141\">http://jira.globus.org/browse/GRAM-141</a></p></blockquote>", "remarks": "<blockquote>\n<em>2010-Apr-12 11:04:43 by jfrey:</em> <br/>\n\nIf the version command returns gram error 10, the gridmanager assumes the server is GRAM5, which will often be a wrong assumption.\n\n<p></p><hr/>\n<em>2010-Apr-13 09:43:15 by jfrey:</em> <br/>\n\nUpdate Globus external to 5.0.1, which fixes this problem. Change committed to V7_5_2-branch.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Apr-13 09:36</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/37887ce3e3fa42a89a3443c421930603d293eae6\">[17850]</a></span>: Change Globus external to 5.0.1. The changes in Globus don't affect the voms or cream externals, so we dont' need to bump their patch-level.  (By Jaime Frey )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2010-Apr-13 09:43", "status": "resolved", "created": "2010-Mar-16 17:25", "fixed_version": "2010-Mar-16 17:25", "broken_version": "v070501", "priority": "2", "subsystem": "Grid", "assigned_to": "jfrey", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}