{"id": 1354, "title": "Ticket #1354: Report network traffic for daemons", "description": "<blockquote>\nKen Hahn notes that he would occasionally find it useful to know how much bandwidth Condor is using.  After a brief discussion, some ideas:\n\n<p></p><ul>\n<li>Track total bytes read and written over the network, dividing them into data to and from localhost and remote hosts.  (As local traffic is \"cheap\".)  So we'll end up with four totals: localhost_bytes_written, localhost_bytes_read, remote_bytes_written, remote_bytes_read.\n</li><li>Make this available conveniently available to the sysadmin:\n<ul>\n<li>Report this in the daemon's <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span>.  Handy for polling via condor_status and feeding to tools like rrdtool.  This one seems like a solid win.\n</li><li>Report in logs at regular intervals.  More questionable value, but shouldn't be too hard.  Perhaps at D_DAEMONCORE or D_FULLDEBUG level?\n</li><li>Feed to a hook or plugin.  Specialized, but allows for instantaneously updates.  Of course, we probably don't want to be calling this for ever read and write.\n</li></ul>\n</li></ul>\n\n<p>The ability to ask questions like, \"What is the bandwidth over the last X seconds\" would be nice, but turns four simple bigints into a queue of values, chewing up memory and adding lots of complexity.  Many routers have similar limitations, so this isn't particularly mean. You can get 99% of the benefit by simply feeding the current cumulative total to a system like rrdtool which is prepared to figure out values over time automatically and at whatever interval the admin likes.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Oct-20 16:03:30 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:46:04 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 16:08:44 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 16:08", "status": "new", "created": "2010-Apr-15 15:07", "fixed_version": "2010-Apr-15 15:07", "broken_version": "v070000", "priority": "4", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "khahn@cs.wisc.edu", "due_date": ""}