{"id": 1364, "title": "Ticket #1364: job queue hooks", "description": "<blockquote>\nIgor wants to try using Condor-C as an alternative to Globus for glidein submission.  The sites need to be able to modify jobs as they are submitted.  Currently, this sort of thing is done in the globus jobmanager (condor.pm).\nFor example, OSG environment variables are inserted and the VO of the user may be looked up and inserted into the ad.\n\n<p>The proposal is to add job queue hooks to the schedd.  At the very least, a job submission hook would be needed.  However, Igor proposes going a step further and having a hook that is called on every event that is logged to the user log.\n\n</p><p>One way of doing things would be to make the guarantees for calling of the hooks the same as for logging of events to the user log.  So if a particular event is \"at least once\" then the hook would also be \"at least once\", and if the event is best effort then the hook would also be best effort.  For \"at least once\" we should be able to wrap together the logging of the event and the calling of the hook into a single logical transaction so that no additional syncs to the job queue are required.\n\n</p><p>If there is just a single hook that is called an all types of user log events, for efficiency, we might want to provide a way to whitelist/blacklist which events result in a call to the hook.\n\n</p><p>The writing of the submit event is currently being moved from condor_submit to the schedd.  This is convenient for our purposes here, because we would not want hooks to be called from the user tool.  They should only be called from the schedd and shadows.\n\n</p><p>Question: are there places where we would want a job queue hook but where no user log event happens?\n\n</p><p>Question: if the hooks are used to force the value of some job attributes, what should be done about condor_qedit?  One idea would be to have a configurable whitelist/blacklist of attributes that condor_qedit can/cannot touch.</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Apr-18 12:57:25 by gthain:</em> <br/>\n\nThe performance implications of running a script on every log update would require a bit of analysis.\n\n<p>Is it possible to implement the kind of job modifications he needs in a more declarative manner?  e.g. we've talked about having an XSLT like thing for classads.  Perhaps the schedd could be modified to allow this kind of modification to all incoming condor-c jobs?\n\n</p><p></p><hr/>\n<em>2010-Oct-01 11:39:05 by bbockelm:</em> <br/>\n\nCan I bump this ticket?  This is relevant to the sort of things we want to do at HCC also.\n\n<p>We are very interested in investigating replacing our Globus-based gatekeepers with a Condor-based one where plausible.\n\n</p><p></p><hr/>\n<em>2011-Mar-21 14:42:13 by bbockelm:</em> <br/>\n\nHi,\n\n<p>After a discussion with danb, I think there's (almost) a way to implement this today: the job_router.\n\n</p><p></p><ol>\n<li>Using SUBMIT_EXPRS and APPEND_REQUIREMENTS (assuming we move them to the condor_schedd), have all submitted jobs automatically \"blacklisted\" so they cannot match.  Inserting an attribute or two would be very \"cheap\".  See <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=1989\" onclick=\"get_ticket_and_populate_wrapper('1989'); return false;\" title=\"APPEND_REQUIREMENTS should be done by condor_schedd, not submitter\">#1989</a></span>\n</li><li>Use condor_job_router to perform the site contextualization / job transformation.  Maybe you just want to add the OSG environment variables to the job.  Maybe you want to do something drastic like move them into PBS.  Because the transformation is done by a separate daemon, it is naturally rate-limiting and doesn't block the schedd.  This is doable in 7.5.6.\n</li><li>Prevent the user from coming back and doing a condor_qedit and overriding your settings.  I think it's somewhat questionable this item is compatible with the \"Condor philosophy\" though.\n</li></ol>\n\n<p>Brian\n\n</p><p></p><hr/>\n<em>2015-Aug-01 20:43:54 by bbockelm:</em> <br/>\n\nMarking as abandoned.\n<ul>\n<li>OSG eventually went the jobrouter-based route with the HTCondor-CE.\n</li><li>For arbitrary submit transforms, the current approach is <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=4804\" onclick=\"get_ticket_and_populate_wrapper('4804'); return false;\" title=\"Managed condor_submit transforms\">#4804</a></span> (which doesn't involve arbitrary scripts...).</li></ul>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Aug-01 20:44", "status": "abandoned", "created": "2010-Apr-17 07:35", "fixed_version": "2010-Apr-17 07:35", "broken_version": "v070503", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "dan@hep.wisc.edu,sfiligoi@fnal.gov,jfrey@cs.wisc.edu,tannenba@cs.wisc.edu,gthain@cs.wisc.edu", "due_date": ""}