{"id": 1486, "title": "Ticket #1486: Condor account are not granted correct privileges on local machines", "description": "<blockquote>\nThe problem may be due to Condor or the slot users not having sufficient privileges to allow Condor to login the condor slot accounts as an interactive users (thus the error <code>ERROR_LOGON_TYPE_NOT_GRANTED</code>).\n\n<p>To enable access we need to grant the Condor accounts the <code>SE_INTERACTIVE_LOGON_NAME</code> (i.e. \"<code>SeInteractiveLogonRight</code>\") privilege.  This should fix the problem.\n\n</p><p>So of the point in here may help:\n<a class=\"external\" href=\"http://support.microsoft.com/kb/257346\">http://support.microsoft.com/kb/257346</a>\n\n</p><p>I believe this problem cropped up when we first moved away from using batch login account, in favour of interactive ones.  We did this for several reasons, but primarily it was because the batch login accounts three major limitations: batch users had trouble running certain types of applications that were becoming popular at the time, also because newer versions of Windows did not allow batch users to run batch files (via the cmd.exe tool), and finally, because batch accounts were found not to work when using Samba as a Primary Domain Controller.  Batch accounts were initially used because it was thought they would allow Condor to process a login faster.  It was found, however, that in practice the latency incurred from using interactive accounts was far outweigh by its benefits. The only reason I could think of that Condor should optionally be using batch accounts, is when it is running a (very) large number of short lived jobs.  Even then, the overhead of spawning a starter process will dwarf the login time an interactive login would invite.</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Jul-12 21:54:19 by burnett:</em> <br/>\n\nI don't really know what the correct priority for this should be, but it is a huge pain for people with stricter network policies that limit the privileges of regular users (which we restrict our accounts to be).</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/200/dynuser.diff\">dynuser.diff</a>\n2878 bytes added by burnett on 2010-Jul-13 02:50:05 UTC.\n<br/>\nGive the local Windows \"nobody\" accounts the correct privileges.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "defect", "last_change": "2012-Feb-28 17:36", "status": "defer", "created": "2010-Jul-05 00:10", "fixed_version": "2010-Jul-05 00:10", "broken_version": "v070503", "priority": "2", "subsystem": "Win32", "assigned_to": "johnkn", "derived_from": "", "creator": "burnett", "rust": "", "customer_group": "users", "visibility": "public", "notify": "ben.burnett@uleth.ca", "due_date": ""}