{"id": 1499, "title": "Ticket #1499: increase throughput during upgrade", "description": "<blockquote>\nCurrently, an upgrade of condor requires either draining or killing all jobs running on a machine.  On a multi-slot machine, either choice results in reduced throughput.  It would be nice if the old version of condor could drain while the new version of condor takes over running jobs on slots which have finished draining.\n\n<p>One potential problem with this idea is what to do about slots with policies that interact with each other.  For example, there might be a whole-machine slot that, when busy, disables the other slots.  If the whole-machine slot is busy in the old condor, one would not want the new condor to start running jobs.  Some possible approaches:\n\n</p><p></p><ol>\n<li>Have the new condor use the draining slot <code>ClassAds</code> verbatim from the old condor.\n\n<p></p></li><li>Have the new condor read state from the old Condor (e.g. job <code>ClassAds</code>) and go through all the motions of running the jobs.  It might launch a dummy starter process or it might stop short of that.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<em>2010-Jul-12 11:15:15 by gthain:</em> <br/>\n\nThere is some support for startds sharing ads with the VM code that implements condor-within-a-VM cooperating with condor-outside-the-vm.  Perhaps we could leverage that code?  Also, it would be nice if whatever we did was recursive, so if there are very long running jobs, an arbitrary number of upgrades could be in flight at once.\n<hr/>\n<em>2010-Oct-20 16:03:30 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:46:04 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 16:08:44 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Oct-17 12:24", "status": "new", "created": "2010-Jul-12 11:07", "fixed_version": "2010-Jul-12 11:07", "broken_version": "v070503", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "danb", "rust": "a20761", "customer_group": "fermi", "visibility": "public", "notify": "dan@hep.wisc.edu timm@fnal.gov gthain@cs.wisc.edu tstclair@redhat.com", "due_date": ""}