{"id": 1559, "title": "Ticket #1559: QUILL -> add on, and no longer distro'd", "description": "<blockquote>\nIn FW 8/3/10 the ok has been given to move QUILL to add-on's and remove from mainline distribution.\n\n<p>It is debatable if we should remove the code entirely from the tools condor_q, etc.</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Aug-04 09:21:07 by matt:</em> <br/>\n\nThe decision was to remove the code from q and history producing a quill_q and quill_history.\n\n<p></p><hr/>\n<em>2010-Aug-12 14:48:28 by epaulson:</em> <br/>\n\nA quill_q and quill_history is about the worst possible way to make things better. 90% of the code in a quill_q or quill_history will be identical and any bug fixes or feature enhancements would have to be done twice. It basically ensures that quill will quickly become broken and useless.\n\n<p>A far better way is to rip all of the quill code out of condor_q and condor_history, and instead fix the biggest mistake we made in quill -&gt; quill++: restore the ability of the quilld to speak the schedd protocol.\n\n</p><p>What you really want is an unmodified condor_q being able to talk to a schedd or a quill daemon and not care what it is. In the schedd ad, you take all of the quill crap out, and just advertise something like MX records - \"if you want to do read-only queries, here is who you talk to\".\n\n</p><p>This has the happy bonus of isolating condor_q/history from having to have any knowledge of the schema or RDBMS involved, and isolates what needs to link with the Postgres libraries (and Oracle/MySQL/MSSQL/etc libraries) to just the quill daemon. It also means you can better control access to your RDBMS instead of having your firewall wide-open, and we can add caching of materialized classads or aggregate stats without having to pound the database.\n\n</p><p>The downside is now you're stuck with Condor concurrency, ie the quilld is still single-threaded, so if you have a ton of clients querying the quilld it may be slower than talking straight to the database. However, from a software maintenance standpoint, it's probably worth it, and it's certainly better than a quill_q\n</p><hr/>\n<em>2010-Oct-20 16:03:30 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n\n<p></p><hr/>\n<em>2010-Dec-07 14:54:09 by tstclair:</em> <br/>\n\nmodifications have been made to master to remove, but there is still a non-trival amount of work needed in order to complete.  namely tool cleaning.\n<hr/>\n<em>2011-Jan-27 14:46:04 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 16:19:13 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2011-Oct-19 08:32", "status": "resolved", "created": "2010-Aug-04 09:08", "fixed_version": "2010-Aug-04 09:08", "broken_version": "v070500", "priority": "2", "subsystem": "Quill", "assigned_to": "tstclair", "derived_from": "", "creator": "tstclair", "rust": "", "customer_group": "users", "visibility": "public", "notify": "matt@cs.wisc.edu, tstclair@redhat.com", "due_date": ""}