{"id": 1562, "title": "Ticket #1562: startd slotad policy evaluation is out of synch with reality", "description": "<blockquote>\nWhen the startd starts up and has some hawkeye scripts, the hawkeye attributes show up in the collector's view of the slotad in the first published ad to the collector, but <strong>NOT</strong> in the emitted slotad in the <code>StartLog</code> when using D_MACHINE. So, the job matches the slot from the negotiator's point of view the startd rejects it if the job's requirements use any attributes from the hawkeye scripts since the policy matcher uses the slotad which D_MACHINE prints out.\n\n<p>After UPDATE_INTERVAL amount of time passes and a new ad is sent to the collector, the internal ad is reconciled and now contains the attributes.\n\n</p><p>This is insidious, because both the collector <strong>AND</strong> condor_status -direct -startd both return the merged ad--which is not the ad used when matching against the job! There is obviously multiple copies or views of the ad and\nthere hsould only be one. In DanB's words, \"How could the collector have a more\ncorrect view of the slotad than the startd itself?\"\n\n</p><p>Due to this sync'ing problem of reality and the collector vs internal policy slotad description, one could construct a scenario where a job will NEVER match to a slotad if it depends upon hawkeye attributes which are updated faster than the slotad is published. Synchrony will never be achieved and the job will match from the negotiator's point of view, but always be rejected directly by the startd.\n\n</p><p>This also may explain certain scenarios where even with a Start = True job policy, a job will be refused to run for UPDATE_INTERVAL seconds because the State of the internal machine ad used by the policy matcher is \"Matched\".</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Oct-27 16:39:01 by adesmet:</em> <br/>\n\nBulk change of target version from v070404 to v070405 using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2012-Oct-17 12:36", "status": "new", "created": "2010-Aug-05 16:26", "fixed_version": "2010-Aug-05 16:26", "broken_version": "v070400", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "psilord", "rust": "", "customer_group": "other", "visibility": "public", "notify": "psilord@cs.wisc.edu tlmiller@cs.wisc.edu", "due_date": ""}