{"id": 1673, "title": "Ticket #1673: request for coordinated exit among glideins", "description": "<blockquote>\nDear Condor team.\n\n<p>We want to submit a set of multiple-slot glideins that each starts X startds (on multiple nodes).  The problem is how to shut them down.\n\n</p><p>The current mechanism is to shut down individual glideins if not used for N minutes.  This can mean that a fraction of the startds of a multi-slot request dies, but not all of them; but the Grid batch system still charges us for all X slots (MPI model).\n\n</p><p>We need a better way to do this.  An obvious solution would seem to be for the startds in the multi-slot request to know about each other,\nand only die if ALL of them are idle for more then N minutes.\n\n</p><p>I don't think there is a way in Condor today to do this.  Do you think this is something you could add?\n\n</p><p>Thanks,<br/>\n\n   Igor<br/>\n\n   for the glidein/corral team<br/>\n</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Sep-24 11:34:58 by psilord:</em> <br/>\n\nDo we have any kind of a hook that when a startd decides to die it can fire off a script to condor_off -constraint the rest of them?\n\n<p></p><hr/>\n<em>2010-Sep-24 11:38:04 by psilord:</em> <br/>\n\nThe responsibility of this is interesting. If it is the glidin factory's responsibility, then it can do a condor_status -const on a set of glidins and compute whether or not all of them should die. If so, in one fell swoop it could\nkill them.\n\n<p>On the other hand, if the slots all had to communicate with each other, that smacks of distributed communication protocols, which will likely be more complex\nto get right and be harder to debug.\n</p><hr/>\n<em>2011-Jan-27 14:50:47 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 16:20:02 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 16:20", "status": "new", "created": "2010-Sep-24 10:33", "fixed_version": "2010-Sep-24 10:33", "broken_version": "v070505", "priority": "4", "subsystem": "", "assigned_to": "PitS", "derived_from": "", "creator": "danb", "rust": "s7955", "customer_group": "other", "visibility": "public", "notify": "dan@hep.wisc.edu", "due_date": ""}