{"id": 1763, "title": "Ticket #1763: disk usage not correctly monitored in privsep mode", "description": "<blockquote>\nIf a job creates a directory that is not accessible to the condor user, then disk usage is not correctly monitored in privsep (or glexec) mode.  The following type of error appears in the starter logs:\n\n<p></p><div class=\"verbatim\">\n<pre>11/04 13:51:57 (pid:31610) Can't open directory \"/scratch/condor/var/lib/condor/execute/dir_17225/glide_c17435/execute/dir_31610/cms_XEaGVGH32545\" as PRIV_CONDOR, errno: 13 (Permission denied)\n</pre></div>\n\n\n<p>The error could be avoided by monitoring disk usage by launching a separate process that runs under the same account as the job.  However, it is unfortunate that in this case the job could mess with the monitoring process.  To avoid that, one would need to run the monitoring process with real user id root and effective user id of the job.  I'm not aware of any existing feature of glexec that would support this.\n\n</p><p>Note that this problem can also happen in the non-privsep case if the job creates a directory that the job user itself does not have permission to access and condor is not running as root (or the filesystem does root squashing).  Solving that would require changing permissions on the directory, which is not ideal.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2011-Jan-27 14:50:47 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 16:20:02 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2012-Nov-12 14:25", "status": "new", "created": "2010-Nov-09 11:53", "fixed_version": "2010-Nov-09 11:53", "broken_version": "v070400", "priority": "4", "subsystem": "", "assigned_to": "zmiller", "derived_from": "", "creator": "danb", "rust": "s7985", "customer_group": "cms", "visibility": "public", "notify": "dan@hep.wisc.edu", "due_date": ""}