{"id": 181, "title": "Ticket #181: strerror()-like function for Win32 error codes", "description": "<blockquote>\nIn some Win32-specific areas of the code, we respond to a Windows API call failing by printing out the numeric value of GetLastError(). This is mainly because FormatMessage() needs to be used to get a human-readable error message and it's interface is a bit clumsy. We should implement a wrapper for FormatMessage() that just takes the error code and converts it into a string, and use it from places in the code that currently print numeric error codes.</blockquote>", "remarks": "<blockquote>\n<em>2009-Mar-30 13:07:36 by mccardel:</em> <br/>\n\nCurrently I have a small function written (but not tested). Trying to figure out what exactly needs to be done for making a function in Condor.\n\n<p>Also am trying to think of how to replace 288-some instances of the old method of outputting errors. I don't see a common thread between the way they are handled, so I can't easily use regexes.\n\n</p><p></p><hr/>\n<em>2009-Apr-15 16:26:53 by mccardel:</em> <br/>\n\nAlright, here's the patch. Hopefully it's correct :)\n\n<p>Some notes: when you call the formatted message functions, you have to assign it to a string. After your use of it, you have to free it using LocalFree(), since the string is allocated using LocalAlloc() in a windows function that is called by getFormattedErrorMsg. This is done so it can be combined with dprintf().\n\n</p><p>A future project could be to make it so that the function accepts a va_list, and all the stuff that entails, so then the function would be fully self-contained. Right now I don't feel comfortable enough with that sort of thing though, and would probably have a few bugs.\n\n</p><p></p><hr/>\n<em>2009-Jun-18 13:40:33 by mccardel:</em> <br/>\n\nRedid this because the way I did it before was, quite frankly, embarrassing and stupid. The new way is much better, and closely mimics dprintf in usage.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/47/formatedMessage.patch\">formatedMessage.patch</a>\n284071 bytes added by mccardel on 2009-Apr-15 21:27:27 UTC.\n<br/>\nThis is the patch I got. Hope it works.<br/>\n</li><li><a href=\"../files/58/deprintf.patch\">deprintf.patch</a>\n274363 bytes added by mccardel on 2009-Jun-18 21:24:45 UTC.\n<br/>\nUpdated version. Renamed to deprintf (debug error printf) and some more error handling.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "enhance", "last_change": "2010-Jan-31 13:16", "status": "resolved", "created": "2009-Feb-03 13:26", "fixed_version": "2009-Feb-03 13:26", "broken_version": "", "priority": "4", "subsystem": "Win32", "assigned_to": "mccardel", "derived_from": "", "creator": "gquinn", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}