{"id": 1810, "title": "Ticket #1810: Port option for condor_power doesn't work", "description": "<blockquote>\nIn Condor-Admin RUST ticket #21438, Klaus Sander from Embrarer reported that he used the -p option from condor_power to use a different port, and it didn't work. It only works with the default port (9).\n\n<p>I looked at the code briefly and I suspect he's right. I don't know how to test condor_power, so I haven't replicated the problem. I understand that Nick is the right person to tackle the problem, so I've assigned it to him.\n\n</p><p>Just looking at the code, I suspect the problem is in condor_c++_util/udp_waker.cpp. I have a candidate patch that I'll attach to this ticket shortly. I haven't built or tested it, so take it as precise guidance on where to first look, not as a proper fix. I'm not the expert in this code, so my ten minute examination doesn't qualify me for much.  If I'm lucky and I happen to be right, it will be an easy bug fix and should go into a release soon.\n\n</p><p>(By the way, the code struck me as a bit odd. You set the port number, then call initialize() which sets the port number. Why not do it all in one spot?)\n\n</p><p>By the way, if we support the -p option, it should also be documented in the condor_power man page. Right now it's only in the usage statement.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2011-Feb-01 16:20:02 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.\n\n<p></p><hr/>\n<em>2012-Aug-22 11:22:53 by smoler:</em> <br/>\n\nAnd, in this never-responded-to-rust, a21414, Klaus potentially points out an implementation error:\n\n<p>I want to report and error in the condor_config.power example file that\ncomes with Condor 7.4.4 (Windows installation package .msi and .zip) andis located into <code>c:\\condor\\etc</code> directory.\n\n</p><p>HIBERNATE expression must be evaluated to a string.\n<span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=HibernateState\" title=\"Hibernate State\">HibernateState</a></span> is set to a numeric (3 in the file) and is used to\nevaluate HIBERNATE.\nThe result is that it will not evaluate to a string value.\nWhen I fixed <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=HibernateState\" title=\"Hibernate State\">HibernateState</a></span> to \"SHUTDOWN\" (as an example that I have\ntried) it started hibernating my pool machines.\n\n</p><p>Could you fix this for the new versions?</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/252/udp_waker.cpp.patch\">udp_waker.cpp.patch</a>\n560 bytes added by roy on 2010-Dec-15 19:25:03 UTC.\n<br/>\nCandidate patch for condor_c++_util/udp_waker.cpp<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "todo", "last_change": "2012-Aug-22 11:23", "status": "new", "created": "2010-Dec-15 13:24", "fixed_version": "2010-Dec-15 13:24", "broken_version": "v070400", "priority": "2", "subsystem": "Tools", "assigned_to": "adesmet", "derived_from": "", "creator": "roy", "rust": "a21438,a21414", "customer_group": "other", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}