{"id": 1831, "title": "Ticket #1831: Take advantage of cgroups-based capabilities on new Linux platforms", "description": "<blockquote>\nTo finish the integration of this work, these milestone need to happen:\n<ul>\n<li>Read up and understand CGroups.\n</li><li>Add the libcgroup external.\n</li><li>Successfully apply and test the patch.\n</li><li>Ensure the discovery of the cgroup feature works on all of our platforms.\n</li></ul>\n\n<p>This work had been done and is committed.\n\n</p><p></p><hr/>\nI would like to explore the integration of cgroups and Condor.  For those unfamiliar with cgroups, I think some of the best comprehensive background documentation is provided by Redhat:\n<a class=\"external\" href=\"http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Linux/6/html/Resource_Management_Guide/index.html\">http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Linux/6/html/Resource_Management_Guide/index.html</a>\n\n<p>In short, cgroups are a kernel-level construct which provides the functionality of the condor_procd.  I have two short-term goals:\n</p><ol>\n<li>Improved accuracy for process accounting for memory and CPU usage.\n</li><li>Improved accuracy for job killing.\nBoth can be done to be basically 100% accurate - the current procd methodology is heuristic-based, and can be error prone.  Current best-practice is dedicated accounts or GID tracking, but neither are as transparent as cgroups.\n</li></ol>\n\n<p>After examining the procd and starter code, I think these are also doable, short-term goals.  I'd like to do this without replacing the procd or even disabling the current functionality (ideally, should be kept as a fallback if cgroups fail).  My current thinking is to use  libcgroups to assist in the cgroup creation and manipulation (adding a new dependency for cmake).  The starter (some combination of VanillaProc::StartJob and OsProc::StartJob) would be responsible for creating the cgroup and launching the parent process.  The procd would register the new process family as before, but get a new command for enabling tracking based upon a cgroup's name.  The process family will become associated with the most-specific cgroup of the root PID.  There will be a CGroupTracker somewhat equivalent to the current <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=GroupTracker\" title=\"Group Tracker\">GroupTracker</a></span>\n\n</p><p>When the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ProcFamily\" title=\"Proc Family\">ProcFamily</a></span> is associated with a cgroup, the aggregate_usage functions and spree functions will be replaced by their cgroups equivalent (falling back to the current implementations if the cgroups-enabled one failed).  So, most of the control flow for process startup, monitoring, and shutdown will remain the same; this seems especially important as there's quite a bit of functionality in the procd.\n\n</p><p>On the outset, the most daunting part of the implementation is a new external for libcgroups.  I think the procd and starter code changes are otherwise relatively benign.\n\n</p><p>If we can start with these changes, there are some more imaginative cgroup-related goals:\n</p><ol>\n<li>cpuset'ing.  Limit the group of processes to a specific CPU.\n</li><li>Managing I/O bandwidth for the condor execute directory device.  Prevents a process from affecting others by hitting the disk hard.\n</li><li>Private namespaces.  Provide a private PID and/or filesystem namespace.  Jobs running under the same unix account wouldn't be able to kill each other's processes or write into each other's execute directory.  Would also allow a per-job /tmp.  Somewhat deep voodoo, but would allow sites like Purdue to run all jobs as unix user nobody without worrying about the security implications.\n</li></ol>\n\n<p>Thoughts?  I'd characterize the approach as:\n</p><ol>\n<li>Use libcgroups instead of manipulating the filesystem.\n</li><li>Start with a small modification to the procd.\n</li><li>Contain the worst-case scenario if the cgroup-based methods fail.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<em>2011-Jan-07 13:05:49 by tannenba:</em> <br/>\n\nThanks Brain, this will be great!\n\n<p>Added Pete (psilord) to the list of folks getting email re changes to this ticket. Pete is the resident procd expert, I want him to chime in on the proposed approach.\n\n</p><p>Upon reading the above, one concern I had is part mentioning changes to the starter VanillaProc::StartJob and OsProc::StartJob methods.  In theory, the <em>only</em> changes should be to classes procapi, maybe also the procd, maybe also killfamily. The starter should not care about the mechanism by which a tree of process is being tracked (be it via group ids, cookie strings in the environment, cgroups, process table snapshots, windows jobobjects, whoatever). Also note that Condor relies on tracking groups of processes in many places, not just the starter - for example the master tracks all processes beneath it, the schedd tracks trees representing scheduler/local universe jobs.\n\n</p><p></p><hr/>\n<em>2011-Jan-07 13:58:28 by bbockelm:</em> <br/>\n\nSo, I am to the point where I have enough of a patch put together that Pete can see my approach.  Currently, I'm only exposing this through the condor_procd/procd_ctl interface.  Basically, the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ProcFamilyMonitor\" title=\"Proc Family Monitor\">ProcFamilyMonitor</a></span> has been taught how to associate a given <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ProcFamily\" title=\"Proc Family\">ProcFamily</a></span> with a cgroup, and I extended this new command to proc_family_io.cpp.\n\n<p>Todd: I would prefer to keep the starter somewhat involved - it at least must explicitly asked for cgroups (mimics how tracking groups are done currently).  However, we can put the cgroup creation logic into the procd.  I don't think it alters the architecture too much.\n\n</p><p>Hopefully I can code drop the first cgroup-based <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ProcFamily\" title=\"Proc Family\">ProcFamily</a></span> tracking patch later today... I want to get at least a few of the statistics working first.\n\n</p><p></p><hr/>\n<em>2011-Jan-09 23:19:57 by bbockelm:</em> <br/>\n\nOk, see the attached cgroups_procd2.patch.  It should be ready for others to look at it.  It is integrated into both the condor_starter and the procd_ctl.\n\n<p></p><hr/>\n<em>2011-Jan-25 13:32:03 by psilord:</em> <br/>\n\nOk, I've had a small chance to look at the work in this ticket. The approach seems reasonable.\n\n<p></p><hr/>\n<em>2011-Feb-03 11:48:57 by bbockelm:</em> <br/>\n\nHi Pete,\n\n<p>Anything I can do to help this ticket along?\n\n</p><p>Brian\n\n</p><p></p><hr/>\n<em>2011-Mar-28 11:42:32 by tannenba:</em> <br/>\n\n<strong>Initial Code Review Feedback</strong>\n\n<p></p><ol>\n<li>The algorithm \"freezes\" all the pids in the family before sending a signal, apparently in order to send the signal atomically to the group.  This is good. However, the question is what to do if the cgroup call to freeze all the pids fails (which can happen if the process is in certain specific states).  One solution would be when the procd to send the SIGCONT or SIGKILL signal to the family, it then checks again to be certain all processes are stopped or killed. If not, then repeat. After repeating more than X times, propagate failure to the caller (which would then likely email the admin, etc). Note this issue is not specific to cgroups, but if the procd behaved this way, then we'd have an answer re what to do if cgroups fails to freeze all pids.\n\n<p></p></li><li>Code style issue - use curly braces around conditional clauses, even if they are only one line. We do this to help ensure merges don't have unexpected side effects.\n</li></ol>\n\n<p></p><hr/>\n<em>2011-Apr-05 16:16:58 by psilord:</em> <br/>\n\nI got preempted by the compressed ckpt in stduniv problem. So this got moved on week into the future.\n\n<p></p><hr/>\n<em>2011-Apr-15 14:08:11 by psilord:</em> <br/>\n\nI was looking at this ticket, but then a zombie bug happened for another ticket, so pushing this a few more days into the future.\n\n<p></p><hr/>\n<em>2011-Apr-19 12:08:34 by tannenba:</em> <br/>\n\nGoal is for Pete to review latest/final patch and merge codebase for v7.7.0 by 4/29/11. Pete, we'll need a child ticket for documentation and regression tests.\n\n<p></p><hr/>\n<em>2011-May-02 10:54:35 by psilord:</em> <br/>\n\nOk, today I'm going to review version 5 of the patch for this feature. I believe it'll pass review without comments and then I'll commit it into the master ASAP.\n\n<p></p><hr/>\n<em>2011-May-05 11:47:17 by psilord:</em> <br/>\n\nI applied the patch to the master in my local workspace, and it cleanly applied. While building it, I found some problems in the cmake goo with the cgroup external. So, I checked in what Brian did strictly as attributed to him, and am doing additional patches which fix the rest of the problems.\n\n<p></p><hr/>\n<em>2011-May-05 16:37:08 by psilord:</em> <br/>\n\nI have completed the work for this ticket. I committed version 5 of the patch\nas it existed and attributed it to Brian to the commit.\n\n<p>I found that the libcgroup external cmake code needed a bit of work for this to compile in a non-proper fashion. I made the fixes which also included making the libcgroup build produce a static library for linking.\n\n</p><p>It built on my machine, so good enough to check it into master. :)</p></blockquote>", "derived_tickets": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=19\" onclick=\"get_ticket_and_populate_wrapper('19'); return false;\" title=\"Loop when killing process families\">#19</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nLoop when killing process families</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=2014\" onclick=\"get_ticket_and_populate_wrapper('2014'); return false;\" title=\"Allow PrivSep to work with PID namespaces\">#2014</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nAllow <span class=\"wiki\"><a href=\"wiki?p=PrivSep\" title=\"Priv Sep\">PrivSep</a></span> to work with PID namespaces</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2120\" onclick=\"get_ticket_and_populate_wrapper('2120'); return false;\" title=\"Cgroup feature should be documented in manual for 7.7.x series.\">#2120</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nCgroup feature should be documented in manual for 7.7.x series.</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=2121\" onclick=\"get_ticket_and_populate_wrapper('2121'); return false;\" title=\"CGroup pid tracking must have regression tests\">#2121</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nCGroup pid tracking must have regression tests</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2652\" onclick=\"get_ticket_and_populate_wrapper('2652'); return false;\" title=\"procd pegging cpu when running a lot of short lived jobs.\">#2652</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nprocd pegging cpu when running a lot of short lived jobs.</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"review\" href=\"/wiki-archive/tickets/?ticket=4259\" onclick=\"get_ticket_and_populate_wrapper('4259'); return false;\" title='examine \".throttle.io_service_bytes\" instead of \".io_service_bytes\"'>#4259</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nexamine \".throttle.io_service_bytes\" instead of \".io_service_bytes\"</td></tr>\n</tbody></table>", "attachments": "<blockquote>\n<ul>\n<li><a href=\"attach_get/263/cgroups_procd.patch\">cgroups_procd.patch</a>\n38324 bytes added by bbockelm on 2011-Jan-08 04:33:56 UTC.\n<br/>\nHere's the first set of code.  This adds the external (although I've only tested with PROPER + libcgroup 0.37 RPM).\n\n<p>NOTE NOTE NOTE: libcgroup has a glibc error in versions prior to 0.37.  You will likely need to download the Fedora 15 RPM or install it yourself.  I used this build: <a class=\"external\" href=\"http://koji.fedoraproject.org/koji/buildinfo?buildID=209020\">http://koji.fedoraproject.org/koji/buildinfo?buildID=209020</a> .  Obviously, you also need to be on a recent kernel (meaning Fedora 12 or higher)\n\n</p><p>This code can attach a cgroup to a process family, track its processes via cgroup, track its resource usage, and reliably kill things.  If you want to see something impressive, try using condor_procd to track a \"make -j4\" on the condor source directory.  Where the original procd only thinks there was 1s of user CPU (due to the number of lots of short lived processes), this successfully was able to calculate the true user+system CPU, about 300s combined for my desktop.\n\n</p><p>This code does <strong>not</strong> do the creation or the population of the cgroups themselves (although I've now poked inside libcgroup enough it should be easy work... save something for tomorrow!).  You have to do this by hand.\n\n</p><p>For a demo, create a cgroup named \"/condor\" for the memory, cpuacct, and freezer subsystem.  Add the a user's shell to it:\n</p><div class=\"verbatim\">\n<pre>mkdir -p /cgroups/{memory,cpuacct,freezer}\nmount -t cgroup -ocpuacct cpuacct /cgroups/cpuacct\nmount -t cgroup -omemory memory /cgroups/memory\nmount -t cgroup -ofreezer freezer /cgroups/freezer\nmkdir -p /cgroups/{memory,cpuacct,freezer}/condor\necho \"&lt;user shell pid&gt;\" &gt; /cgroups/memory/condor/tasks\necho \"&lt;user shell pid&gt;\" &gt; /cgroups/cpuacct/condor/tasks\necho \"&lt;user shell pid&gt;\" &gt; /cgroups/freezer/condor/tasks\n</pre></div>\n\nIn the user's shell, do a \"make -j4\".  Then, switch back to the root shell with the upgraded condor_procd and procd_ctl:\n<div class=\"verbatim\">\n<pre>condor_procd -A /tmp/procd_pipe -L /dev/stderr -P &lt;user shell pid&gt; &amp;\nprocd_ctl -A /tmp/procd_pipe TRACK_BY_ASSOCIATED_CGROUP /condor\nprocd_ctl -A /tmp/procd_pipe GET_USAGE\nprocd_ctl -A /tmp/procd_pipe SUSPEND_FAMILY\n</pre></div>\n\n\n<p>Viola!  Assuming you haven't just uncovered a new bug, this should perfectly track memory and CPU usage, as well as prove to be more adept at sending signals to processes (no race conditions when giving a process tree a signal!).<br/>\n</p></li><li><a href=\"attach_get/264/cgroups_procd2.patch\">cgroups_procd2.patch</a>\n54774 bytes added by bbockelm on 2011-Jan-10 05:16:25 UTC.\n<br/>\nHere's a more complete patch.  Major additions in functionality are:\n\n<p></p><ol>\n<li>Integration into the condor_starter.  Added a parameter named BASE_CGROUP, and the procd will create the new process inside $BASE_CGROUP/job_$CLUSTER_$PROC.\n</li><li>Added intelligence to the memory statistics (make sure memory migrates when adding a new cgroup).\n</li><li>Cleanup of cgroups after the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ProcFamily\" title=\"Proc Family\">ProcFamily</a></span> is done with them if the procd was the one to create the cgroup originally.\n</li></ol>\n\n<p>As before, feel free to take it out for a spin.  No known issues, no remaining TODOs.<br/>\n</p></li><li><a href=\"attach_get/308/cgroups_procd_v3.patch\">cgroups_procd_v3.patch</a>\n57039 bytes added by bbockelm on 2011-Mar-30 17:53:13 UTC.\n<br/>\n<ul>\n<li>Explicitly detect the case where the kernel cannot guarantee atomic signal delivery.  This is logged, but we currently don't do anything with this information.  However, when <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=19\" onclick=\"get_ticket_and_populate_wrapper('19'); return false;\" title=\"Loop when killing process families\">#19</a></span> lands, this will be easy to integrate.\n</li><li>Fixed the comment about curly brackets.  I think I fixed up all the relevant cases.\n</li><li>(IMPORTANT) Explicitly null-terminate the cgroup name sent over pipe.  Previously, it was possible to get trash at the end of the string.\n</li></ul>\n\n<p>REMINDER: due to an upstream bug, you don't want to run this for libcgroup &lt; 0.37.  That version used sprintf incorrectly and could cause statistics collection to not function.  The procd fell back correctly, dropped an error message... but what's the point if you don't have statistics?  AFAICT, the older version isn't dangerous: just not as useful.<br/>\n</p></li><li><a href=\"attach_get/322/cgroups_procd_v4.patch\">cgroups_procd_v4.patch</a>\n64296 bytes added by bbockelm on 2011-Apr-13 13:38:05 UTC.\n<br/>\nLatest version of the patch attached.  Only change is that block I/O statistics will be read if they are available.<br/>\n</li><li><a href=\"attach_get/340/cgroups_procd_v5.patch\">cgroups_procd_v5.patch</a>\n64510 bytes added by bbockelm on 2011-Apr-30 19:16:15 UTC.\n<br/>\nThis version of the patch fixes an issue in building without libcgroup (one of the functions wasn't properly ifdef'd out in procd_ctl).<br/>\n</li></ul>\n</blockquote>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2012-Jan-31 12:58</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/4d2002f2173357adf21aa0501689cdcfbb797a7c\">[30036]</a></span>: Edit of new documentation on cgroups; addition of defn of config knob BASE_CGROUP; correction of defn of config knob PROCD_LOG; version history item to point to the new documentation. ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2120\" onclick=\"get_ticket_and_populate_wrapper('2120'); return false;\" title=\"Cgroup feature should be documented in manual for 7.7.x series.\">#2120</a></span> ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span>  (By Karen Miller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-20 21:31</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/4dde473956916f1ef6545af5483a719a710dd1d8\">[21951]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> This patch fixes an issue where cgroups isn't enabled in the kernel but the procd thought it was just unmounted.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-06 10:05</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/48d116de1ef53a78d74364885d8770f8c7f28c0e\">[21800]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> Turned off libcgroup building on RHEL3 since that feature will definitely not work there.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-05 16:27</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/cf8969a06d51193c5ef1ca61380daf234d85b805\">[21797]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> Altered the build of the libcgroup external to: Build only on Linux Produce a statially linked library.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-05 16:26</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/07a4a5efc4f418586b18858a334f380924300de1\">[21796]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> libcgroup should only be attempted upon not windows machines.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-05 10:52</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/528a4a73530c1f96f5fc9e42ffe18de21bb96937\">[21795]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> Fixed a bug where a libcgroup.a dependency was not properly rendered for the condor_procapi build.  (By Peter Keller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-05 10:13</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/321489d95346fbaa3c0a2c9daf15df74aac9664c\">[21793]</a></span>: ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span> This is the final patch from Brian Bockelman which implements cgroups on linux for the condor_procd. In building the patch, I've found some build errors which I'll fix in subsequent patches. ===VersionHistory=== When Condor can utilize the CGroup functionality in Linux, the accuracy of [...]\n (By Brian Bockelman )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2011-Jan-25 14:11</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/a2c2d7e6bb91f8117d0acfd561c4cd36c3a226b3\">[25828]</a></span>: Added man pages for condor_procd, procd_ctl, and gidd_alloc. ===GT=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1831\" onclick=\"get_ticket_and_populate_wrapper('1831'); return false;\" title=\"Take advantage of cgroups-based capabilities on new Linux platforms\">#1831</a></span>  (By Peter Keller )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2011-May-05 16:38", "status": "resolved", "created": "2011-Jan-04 08:18", "fixed_version": "2011-Jan-04 08:18", "broken_version": "", "priority": "2", "subsystem": "", "assigned_to": "psilord", "derived_from": "", "creator": "bbockelm", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu, tstclair@redhat.com, psilord@cs.wisc.edu, tannenba@cs.wisc.edu, dan@hep.wisc.edu", "due_date": "20110505"}