{"id": 1884, "title": "Ticket #1884: support changing ownership of claims in the schedd", "description": "<blockquote>\nMiron wants the schedd to reallocate claims between users.  Initially, the following features are desired:\n\n<p></p><ol>\n<li>when a job finishes, support reassignment of the claim to a different user.  Initially, do this by consulting a static configuration that specifies the desired share for each user.  Give the claim to the user who has the greatest deficit.  Keep track of current usage, but do not save to disk (yet).  (Should accounting groups be supported here?  Not for the first version.)\n\n<p></p><ul>\n<li>status of this: patch is attached to this ticket but not included in a released version\n</li></ul>\n\n<p></p></li><li>add usage records for the users of the schedd.  Does it make sense to synchronize these records with the pool accountant?  If there are multiple pools, that does not seem easy to do.\n\n<p></p></li><li>add support for preemptive reassignment of a claim to a different user.  How will we know when preemption should be used?  Perhaps use a policy expression similar to PREEMPTION_REQUIREMENTS.  (Should we support preemption of jobs belonging to the same user?)\n</li></ol>\n\n<p>All of the steps after the first one are somewhat speculative still.  Focus on just getting the first step done.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Jan-28 18:25:40 by bbockelm:</em> <br/>\n\nI don't follow the logic here - to me, a claim is a contract/lease between a user and a resource, not between the scheduler and a resource.\n\n<p>What's the usage case here?\n\n</p><p></p><hr/>\n<em>2011-Jan-28 19:34:10 by matt:</em> <br/>\n\nFrom an accounting perspective it certainly is. Every negotiation cycle that the Schedd holds onto a claim is a little longer that the claim's owner (user) is charged for the resource. Would the claim be scoped within accounting groups, or the ability to re-claim a resource for accounting purposes be added?\n\n<p></p><hr/>\n<em>2011-Jan-31 10:07:01 by danb:</em> <br/>\n\nAs I understand it, the goal is to keep the negotiator relatively simple and to start making more scheduling decisions in the schedd, which has access to the full job queue.  There was no discussion of restricting the change of claim ownership to members of the same accounting group, but that is an interesting idea.\n\n<p>The new user should be charged for using the claim, not the original user.\n\n</p><p>One can imagine scenarios in which the allocation policy of the schedd and the policy of the negotiator tend to want to reverse each other's decisions.  This may not be desirable.  Understanding the net effect of combined schedd and negotiator allocation policies could be complicated and confusing to users.\n\n</p><p></p><hr/>\n<em>2011-Mar-24 14:57:36 by danb:</em> <br/>\n\nOne use-case for this feature is a schedd that lies to the matchmaker about the identity of its users.  For example, the schedd might tell the matchmaker that all jobs belong to <code>GroupPhysics</code> when they actually belong to <code>PhysicistA</code>, <code>PhysicistB</code>, and so on.  Alternatively, the matchmaker might ignore the schedd's user identities and substitute something else, such as a group name assigned by the matchmaker administrator for all jobs coming from that schedd (e.g. GLOW_VO).\n\n<p>The main benefit of this is that the administrator of the schedd could control individual user priorities without administrative access to the matchmaker.  This would be advantageous in situations where the schedd and matchmaker are administered separately, such as when a schedd flocks from one campus or department to another.\n\n</p><p>The ability to substitute different identities for matchmaking purposes is not implemented or even proposed thus far.  This is just something I can imagine that could make use of the schedd doing resource allocation.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/298/0001-Allow-schedd-to-change-ownership-of-claims.-1884.patch\">0001-Allow-schedd-to-change-ownership-of-claims.-1884.patch</a>\n18392 bytes added by danb on 2011-Mar-24 19:26:30 UTC.\n<br/>\nThis patch implements changing ownership of claims on job boundaries when recycling claims within the schedd.  The decision of who should get the claim is made by consulting a configurable list of user shares.  The user using the least fraction of their share relative to the other listed users is given first priority.  If that user does not have a suitable job, the schedd continues down the ordered list of most deserving users until it finds one.  Claims belonging to users who are not listed in SCHEDD_USER_SHARES are not eligible for change of ownership.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Nov-01 16:48", "status": "stalled", "created": "2011-Jan-28 16:16", "fixed_version": "2011-Jan-28 16:16", "broken_version": "v070700", "priority": "2", "subsystem": "", "assigned_to": "danb", "derived_from": "", "creator": "danb", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tannenba@cs.wisc.edu,gthain@cs.wisc.edu,dan@hep.wisc.edu,matt@cs.wisc.edu", "due_date": ""}