{"id": 1946, "title": "Ticket #1946: Allow wildcards in node names for VARS values", "description": "<blockquote>\nThis is actually something Pete and I talked about a long time ago, at least when we were first implementing splices; but it doesn't seem to be recorded anywhere.\n\n<p>Anyhow, the idea is to allow something like this:\n\n</p><p></p><pre>  VARS NodeA.*.3 foo=\"bar\"</pre>\n</blockquote>", "remarks": "<blockquote>\n<em>2014-Sep-18 14:47:41 by wenger:</em> <br/>\n\nIt seems to me that there are basically two questions:\n\n<p></p><ol>\n<li>Does the \"global variable definition\" apply to all nodes, or only to\nalready-created nodes?\n\n<p></p></li><li>Do we have a full regex, or just some fixed string like \"*\" that applies\nto all nodes?\n</li></ol>\n\n<p>As far as # 2 goes, we could always start out by implementing a fixed string\nthat applies to all nodes, and then add the regex later.  I guess the main\nquestion then is whether the \"all nodes\" version is generally useful.  You\ncould have some \"granularity\" within the DAG by using some different submit\nfiles with differently-named variables, so maybe the \"all nodes\" version\nwould be fairly useful.\n\n</p><p>For # 1, having the vars definition apply only to already-created nodes would\nbe way simpler to implement (and in line with how VARS currently work); my\nmain concern would be whether it might cause confusion.\n\n</p><p></p><hr/>\n<em>2016-Jun-02 09:53:17 by wenger:</em> <br/>\n\nIf we do this, it should also be implemented in a bunch of things besides VARS -- right now we have a CHTC user who really wants this for ABORT-DAG-ON.\n\n<p></p><hr/>\n<em>2017-May-16 11:30:11 by wenger:</em> <br/>\n\nI'm reducing the priority of this and unassigning it because the ALL_NODES option may take care of things for now.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2017-May-16 11:30", "status": "new", "created": "2011-Mar-03 13:26", "fixed_version": "2011-Mar-03 13:26", "broken_version": "v070506", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "", "creator": "wenger", "rust": "a27333", "customer_group": "other", "visibility": "public", "notify": "coatsworth@cs.wisc.edu", "due_date": ""}