{"id": 195, "title": "Ticket #195: Glideins for data staging", "description": "<blockquote>\nAn idea someone suggested at the team meeting that I think is really good and deserves deeper consideration:\n\n<p>Using glideins to manage data staging.\n\n</p><p>Specifically, if you have lots of data, and lots of relatively short jobs that all use the same data, staging your data in and out can chew up most of your run time.  So create a custom glidein that pulls the data with it, then runs only your jobs against the guaranteed present data.\n\n</p><p>Features to consider:\n\n</p><p></p><ul>\n<li>Easy to set up and run (whatever that means)\n</li><li>Possibly reuse the existing Condor binaries; just ship along a script that will write a new condor_config and mooch the existing binaries.\n</li><li>Should automatically add some attribute to the Machine ads noting the presence of the data so you can do clever things like preferring machines you glided in, but being willing to use others.\n</li><li>Auto shutdown unused glideins (existing code, just remember to turn on)\n</li><li>If the number of idle glideins falls below X (2?), and there are idle real work jobs, automatically submit some more glideins.  Ideally You should be able to run this all the time, with it firing off glideins when you submit real work, and as the work peters out essentially pausing itself.\n</li></ul>\n\n<p>A user can do all of this himself today.  The question is: should make it easier?  Option one is: write up clear documentation on how to do it yourself.  Option two is: automate it.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2009-Dec-17 15:33", "status": "new", "created": "2009-Feb-06 17:34", "fixed_version": "2009-Feb-06 17:34", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}