{"id": 1990, "title": "Ticket #1990: Performing a condor_qedit should use a separate authorization", "description": "<blockquote>\nA sysadmin should be able to block a user from editing his or her job: this can be done if there's a separate EDIT authorization level for the schedd.\n\n<p>While this may not make sense for an interactive submit node, this would be useful for Condor-C or SOAP.  It may be that the admins wants to enforce a policy on remote users via the job_router.  Hence, the user would be able to submit jobs, but only the router would have edit permissions for their jobs.\n\n</p><p>I believe doing this at the \"authorization level\" (as opposed to the individual attribute level) would provide sufficient granularity for the described use case.  I wouldn't be surprised if the more flexible, finer-grained has a use case; just can't think of one for now.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Mar-21 14:20:53 by matt:</em> <br/>\n\nDon't forget about chirp. It may be problematic in the case of a Condor integrated application.\n\n<p></p><hr/>\n<em>2011-Mar-21 14:48:38 by bbockelm:</em> <br/>\n\nYeah, there's a bit of a philosophical question here: is the case where the \"admin knows best\" valid?\n\n<p>In the case of the condor_job_router, the admin changes the job around so hopefully it has a better chance of running.  However, the user can always change this back.\n\n</p><p>With this ticket will strengthen the situation such that the user cannot override the admin.  Is this something Condor wants to do?\n\n</p><p>Is there anything inherently dangerous in the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span>?</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Oct-17 12:41", "status": "new", "created": "2011-Mar-21 14:08", "fixed_version": "2011-Mar-21 14:08", "broken_version": "", "priority": "4", "subsystem": "Daemons", "assigned_to": "danb", "derived_from": "", "creator": "bbockelm", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}