{"id": 200, "title": "Ticket #200: standard universe is not compatible with spooling", "description": "<blockquote>\nif you submit a standard universe job with 'condor_submit -spool' or a remote submit (for example, via condor-c) the job will never run successfully.\n\n<p>in particular, the old shadow does not know where to find the spooled executable to send to the starter, and tries to read a directory as if it were the executable.\n\n</p><p>it probably doesn't make sense to use remote-submitted standard universe jobs for the purpose of remote I/O, since the shadow will be running under the remote schedd and that is probably not what users expect.\n\n</p><p>however, the remote-submitted standard universe concept is still useful for checkpointing, which is why they want this to work.</p></blockquote>", "remarks": "<blockquote>\n<em>2010-Oct-27 12:11:24 by danb:</em> <br/>\n\nI stumbled into this problem when testing my changes to the spool directory layout for <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1706\" onclick=\"get_ticket_and_populate_wrapper('1706'); return false;\" title=\"too many links in spool directory\">#1706</a></span>.  My changes do not alter the fact that standard universe and spooling are incompatible, but my changes do alter the way it fails.  Rather than failing late in the game and getting stuck in an infinite retry loop in the standard universe shadow, condor_submit fails to spool the files.  This happens because the schedd is now smart enough to know not to create a per-job directory for standard universe jobs.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2015-Sep-21 11:27", "status": "defer", "created": "2009-Feb-09 15:44", "fixed_version": "2009-Feb-09 15:44", "broken_version": "v070200", "priority": "5", "subsystem": "Std", "assigned_to": "", "derived_from": "", "creator": "zmiller", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "zmiller@cs.wisc.edu,dan@hep.wisc.edu,pcouvare@caltech.edu", "due_date": ""}