{"id": 2085, "title": "Ticket #2085: Write shim script for blahp-over-ssh", "description": "<blockquote>\nFor blahp-over-ssh, we need a simple script that the gridmanager will invoke as a gahp server. The script needs to ssh to the appropriate remote system, dealing with authentication in the process, invoke the blahp on the remote side, and forward all data on stdio between the gridmanager and blahp.\n\n<p>Ssh will handle the forwarding of stdio for us. The script needs to invoke it in the correct way. We can't assume ssh-agent is already running to allow password-less login. We'll need to store the passphrase protecting the ssh credentials in a safe manner and provide it to ssh on demand.\n\n</p><p>Here is a list of required features:\n\n</p><p></p><ul>\n<li>Select one of multiple servers, as indicated by the gridmanager. The gridmanager will pass the name of the desired server as the first command-line argument.\n</li><li>Read the passphrase to decrypt the ssh credentials from a file and supply it to ssh when required.\n</li><li>Store the passphrase to decrypt the ssh credentials in an encrypted form.\n</li><li>Forward all stdin, stdout, and stderr between gridmanager and blahp. Extra text written by ssh to stdout should not be forwarded to the gridmanager.\n</li></ul>\n\n<p>These are optional features we may want to add at a later date:\n</p><ul>\n<li>Allow blahp path and ssh credentials to be different for different remote servers.\n</li><li>Allow name from gridmanager to be a label, with script translating to real hostname.</li></ul>\n</blockquote>", "remarks": "<blockquote>\n<em>2011-Apr-27 13:43:19 by jfrey:</em> <br/>\n\nWe have a test system setup on tonic and glow-c004. I have a Condor installation built from V7_7-blahp_over_ssh-branch on tonic under <code>/scratch.1/jfrey/condor-blahp_over_ssh</code>. Included are a bare-bones ssh shim script and sample submit file. Josh can copy this installation, modify the shim script, and submit test jobs.\n\n<p>glow-c004 is our one-machine pbs cluster. On it, I have a Condor installation, including the blahp, under <code>/home/jfrey/condor-7.7.0</code>. I also have a wrapper script for invoking the blahp remotely under <code>/home/jfrey/remote-test/batch_gahp.wrapper</code>. The wrapper is necessary because the blahp requires an environment variable to be set telling it where to find the rest of its files.\n\n</p><p></p><hr/>\n<em>2011-May-05 12:13:02 by jfrey:</em> <br/>\n\nThe shim script looks good. Here are a couple changes I'd like to see:\n\n<p></p><ul>\n<li>The scripts needs to be able to connect to one of several remote systems. The first command-line argument to the script should name the system to use. You can ignore the rest of the command line arguments.\n<ul>\n<li>Ideally, the script would have a switch statement that can set the variables differently for different servers.\n</li></ul>\n</li><li>The passphrase for the ssh key file should be read from a file, not stored directly in the script.\n</li><li>The passphrase shouldn't be passed as a command-line argument to the expect script. Command-line arguments are visible to all processes on the system.\n</li><li>Eliminate the need to hard-code the path to the expect_script. One option is to write the expect_script to a temporary file, call it, then remove it. Then, you only have one file that needs to be installed.\n</li></ul>\n\n<p></p><hr/>\n<em>2011-May-09 11:00:20 by tannenba:</em> <br/>\n\nChanges addressed from review above, new patch attached below. Assigning to Jaime for final review/merge.\n\n<p></p><hr/>\n<em>2011-May-17 12:09:21 by jfrey:</em> <br/>\n\nThe new script looks good.</blockquote>", "derived_tickets": "", "attachments": "<blockquote>\n<ul>\n<li><a href=\"attach_get/338/remote_gahp\">remote_gahp</a>\n362 bytes added by slauson on 2011-Apr-29 21:30:11 UTC.\n</li><li><a href=\"attach_get/339/expect_script\">expect_script</a>\n343 bytes added by slauson on 2011-Apr-29 21:30:31 UTC.\n</li><li><a href=\"attach_get/342/remote_gahp_v2\">remote_gahp_v2</a>\n3124 bytes added by slauson on 2011-May-06 20:40:07 UTC.\n<br/>\nHere's a more complete script. The major changes are:\n<ul>\n<li>Allows multiple remote hosts to be configured\n</li><li>Passphrase is read from file\n</li><li>Expect script is created, removed inside this script\n</li><li>Handles all failure cases I could think of</li></ul>\n<br/>\n</li><li><a href=\"attach_get/374/README.remote_gahp\">README.remote_gahp</a>\n1420 bytes added by jfrey on 2011-Jun-13 21:26:13 UTC.\n<br/>\nREADME for using remote_gahp.<br/>\n</li></ul>\n</blockquote>", "check_ins": "", "type": "todo", "last_change": "2011-Oct-19 11:47", "status": "resolved", "created": "2011-Apr-22 10:59", "fixed_version": "2011-Apr-22 10:59", "broken_version": "", "priority": "2", "subsystem": "Grid", "assigned_to": "jfrey", "derived_from": "#1938", "creator": "jfrey", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "tannenba@cs.wisc.edu, slauson@cs.wisc.edu, jfrey@cs.wisc.edu", "due_date": ""}