{"id": 2102, "title": "Ticket #2102: The condor_kbdd loses communication with the startd on Windows", "description": "<blockquote>\nUnder Windows the condor_kbdd daemon must be started as a standalone daemon, once for every logged in user. This causes some issues with using condor_kbdd on Windows that can result in keyboard idle times not being reset and START/SUSPEND/RESUME/PREEMPT policies that rely on keyboard idle time numbers to fail (or at least think that there's always no keyboard activity on the machine).\n\n<p>There are two situations where I have found this problem to occur:\n\n</p><p></p><ol>\n<li>If a machine is suspend, when resuming, the condor_startd will almost always end up listening on a different port than what it used pre-suspension. In this case the condor_kbdd instances on the machine will continue to attempt communication with the startd on the <strong>old</strong> port and all keyboard activity will fail to be reported from this point on.\n\n<p></p></li><li>If the condor daemons controlled by the condor_master on the machine are restarted a similar situation with the condor_startd listening on a new port will occur.\n</li></ol>\n\n<p>In both cases the problem seems be caused by the fact that the condor_kbdd instances on the machine are not DAEMON_LIST daemons and therefore aren't notified that they should re-config (or restart) themselves in concert with the other Condor daemons who <strong>are</strong> on DAEMON_LIST and controlled by condor_master on the machine.\n\n</p><p>The condor_kbdd daemon doesn't seem to be smart enough to recognize that, if it can't talk to a condor_startd repeatedly, it should perhaps try re-reading its configuration because maybe the condor_startd listen port has changed on the machine.\n\n</p><p>You have to go through some pains to kick the condor_kbdd instances when this happens. A normal \"condor_status -reconfig -full\" is insufficient because the condor_master won't send the reconfig signal to the user-run condor_kbdd daemons. You have to figure out their listen ports and IP addresses by parsing the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=KbdLog\" title=\"Kbd Log\">KbdLog</a></span> file and send explicit reconfig commands using the \"-addr &lt;ip:port&gt;\" approach. That's less than ideal and also difficult to do in any way that keeps the condor_kbdd instances in good lockstep with the condor_startd on any machine.\n\n</p><p>I've encountered this problem using Condor 7.4.4 and 7.6.0 on Windows XP and Windows 7.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-May-01 16:03:32 by ichesal:</em> <br/>\n\nI was playing around with a fix to this a bit today and it turns out sending an explicit reconfig to the condor_kbdd daemon using the sinful string <strong>doesn't</strong> get it to recognize that the startd's listen port has changed.\n\n<p>And trying to condor_restart it using the sinful string gets you:\n\n</p><p>05/01 17:01:19 Received TCP command 453 (UNREGISTERED COMMAND!) from  &lt;172.16.114.128:4494&gt;\n\n</p><p>So it looks like the only solution is to kill, and then restart all condor_kbdd instances running on a machine.\n\n</p><p>Urg.\n\n</p><p>Not fun.\n\n</p><p></p><hr/>\n<em>2011-May-02 16:33:06 by ziliang:</em> <br/>\n\nIs this also happening when KBDD is part of DAEMON_LIST?\n\n<p></p><hr/>\n<em>2011-May-03 09:43:03 by ichesal:</em> <br/>\n\nLets meet and talk about this while I'm in WI this week for Condor Week. Running with KBDD in the daemon list means condor_kbdd doesn't see keyboard activity in Windows, which is why it's started as a non-Condor daemon in this case.\n\n<p></p><hr/>\n<em>2011-May-04 15:43:21 by ichesal:</em> <br/>\n\nJust an update with the stuff I just showed you.\n\n<p>I added KBDD to the DAEMON_LIST and started Condor. Then I started condor_kbdd as me (Administrator) so it was all running as requested. The startd was listening on &lt;172.16.114.128:4902&gt;. And the kbdd daemon log showed the kbdd reporting in to the startd on the correct port.\n\n</p><p>I did a condor_restart against the startd and it switched to port &lt;172.16.114.128:4983&gt;.\n\n</p><p>Unfortunately the kbdd daemons didn't see this change and continued to try to report in to the old port.\n\n</p><p>I tried both a condor_reconfig -subsys KBDD and a condor_restart -subsys KBDD and there was no change in the port the kbdd was reporting to -- it was still using the old, wrong startd port.\n\n</p><p>Logging off, logging back in to the machine fixes the problem and everything lines up again.\n\n</p><p></p><hr/>\n<em>2011-May-11 14:26:09 by ziliang:</em> <br/>\n\nI believe this is fixed.  I started up Condor, suspended, resumed, and saw that the KBDD was using the new address.\n\n<p></p><hr/>\n<em>2011-May-11 14:39:23 by johnkn:</em> <br/>\n\nfixing bugs by removing code.  I like it.\n\n<p></p><hr/>\n<em>2011-May-11 19:06:05 by ziliang:</em> <br/>\n\nIan reports success.  Good enough for me.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-11 14:23</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/a117b91ea7ea839089d677197d66f3c2e71106b6\">[21838]</a></span>: Attempt to find STARTD address every time KBDD has an update to send. Ticket <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2102\" onclick=\"get_ticket_and_populate_wrapper('2102'); return false;\" title=\"The condor_kbdd loses communication with the startd on Windows\">#2102</a></span>.  (By Ziliang Guo )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2011-May-11 19:06", "status": "resolved", "created": "2011-Apr-27 12:19", "fixed_version": "2011-Apr-27 12:19", "broken_version": "v070404", "priority": "2", "subsystem": "Win32", "assigned_to": "ziliang", "derived_from": "", "creator": "ichesal", "rust": "", "customer_group": "other", "visibility": "public", "notify": "ichesal@cyclecomputing.com, tstclair@redhat.com, johnkn@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}