{"id": 2149, "title": "Ticket #2149: Making the DMTCP shim script work with new version of DMTCP.", "description": "<blockquote>\nAfter talking with Gene Cooperman et al at Condor Week about the failures bt is seeing with DMTCP. I got a new tarball from Gene which fixes the issues. I'm currently testing it with the shim script to see how stable it is.</blockquote>", "remarks": "<blockquote>\n<em>2011-May-10 16:35:45 by psilord:</em> <br/>\n\nThis is what I sent to Gene:\n\n<p></p><div class=\"verbatim\">\n<pre>Ok, I finished my testing. This is what I found.\n\n1. The tools need to use the LONG_ID mixed with the PREFIX_ID in their\n        jassert files.\n\n2. Each jassert file should emit the ARGV after the little header at the\n        start of the file so I can disambiguate what wrote what file\n        and what it was doing since the corefiles are written by pid and the pid\n        is embedded into the jassert file name.\n\n3. I'm getting core files from DMTCP--but I can't tell who made them or\n        why. Having an answer to 2 would solve this for me.\n\n        Concerning this: I get:\n\nLinux merlin &gt; less shim.89.0.err\n\ngzip: stdout: Broken pipe\n/var/home/condor/execute/dir_5963/condor_exec.exe: line 252:  6024 Illegal\ninstruction     (core dumped) ./dmtcp_restart_script.sh\n\n        I'm not sure how to read that quite yet, but do know that I am not\n        trying to checkpoint bash at all. It does look like, however, the actual\n        restarting program produced an illegal instruction error.\n\n</pre></div>\n\n\n<p></p><hr/>\n<em>2011-May-24 15:50:47 by psilord:</em> <br/>\n\nI need to add a chunk of code which ensures to kill the dmctp_coordinator at the appropriate times to help out scheduling systems that don't track job pids at job boundaries.\n\n<p></p><hr/>\n<em>2011-May-25 16:25:27 by psilord:</em> <br/>\n\nI added a version string into the shim script, so I know what is what when people ask me about it.\n\n<p>I also made a real release of it and put up a contrib page over the source code.\nThis will help track what is going on and give means to know a new copy exists.\n\n</p><p></p><hr/>\n<em>2011-May-31 14:51:36 by psilord:</em> <br/>\n\nI'm stalling this since Bill and Gene are working a few things out and it doesn't seem that I'm needed to hack on stuff at the moment.\n\n<p></p><hr/>\n<em>2011-Oct-28 10:45:47 by psilord:</em> <br/>\n\nI went to a LIGO conference with a user that used these scripts. I need to fix these bugs:\n\n<p></p><div class=\"verbatim\">\n<pre>1. add --with-dmtcp to shim_dmtcp to specify an arbitrary root dir for dmtcp.\n\n2. add --with-condor to shim_dmtcp cause it needs condor_status tool\n\n3. Fix the location of mtcp_restart, it is BIN, not LIB.\n\n4. Fix foo.py to get rid of trailing newline on stdout when it reads the file.\n   Fix foo.py to emit the identical output in stdout and output_file.\n</pre></div>\n\n\n<p></p><hr/>\n<em>2011-Nov-01 15:46:33 by psilord:</em> <br/>\n\nI added all of the changes in the previous remark into version 0.4 and made it publically available.\n\n<p></p><hr/>\n<em>2011-Nov-01 15:47:17 by psilord:</em> <br/>\n\nI'm calling this ticket done since as of right now, the shim script works with the latest dmtcp.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2011-Nov-01 15:47", "status": "defer", "created": "2011-May-10 14:08", "fixed_version": "2011-May-10 14:08", "broken_version": "", "priority": "5", "subsystem": "", "assigned_to": "psilord", "derived_from": "", "creator": "psilord", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "psilord@cs.wisc.edu, tstclair@redhat.com,pcouvare@caltech.edu", "due_date": ""}