{"id": 2178, "title": "Ticket #2178: Condor-C GAHP Worker Thread using the wrong credentials", "description": "<blockquote>\nI found the following error message in the CondorC GAHP Worker Thread:\n\n<p></p><div class=\"blockquote\">\n<table width=\"95%\"><tbody><tr><td> </td><td>\n  \n05/20/11 08:42:03 [30007] ChildAliveMsg: failed to send DC_CHILDALIVE to parent daemon at &lt;129.93.239.174:32804&gt; (try 1 of 3): CEDAR:6002:failed to send EOM|GSI:5004:Failed to gss_assist_gridmap /DC=org/DC=doegrids/OU=People/CN=Brian Bockelman 504307 to a local user.  Check the grid-mapfile.\n</td></tr></tbody></table></div>\n\n\n<p>It is using the credential of the user to talk to the parent daemon and failing because, on purpose, random users don't have DAEMON-level authorization on the submit node.  The parent should have created an authz session for the worker thread, right?  Not sure when this broke.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-May-23 10:03:52 by danb:</em> <br/>\n\nI think there are two issues here:\n\n<p></p><ol>\n<li>DC_CHILDALIVE requires DAEMON level access, which is more broad than one would like---especially when the child process is running as some user other than condor.  Do we really want the condor-c-gahp to be able to send arbitrary DC signals to other Condor daemons?  That is one thing that DAEMON level access allows.\n\n<p></p></li><li>DC_CHILDALIVE must create a security session to the parent.  In the 7.5 series, children are born with a security session for the parent to signal the child.  The same thing should be done (but has not been) for the child to send DC_CHILDALIVE to the parent.\n</li></ol>\n\n<p>If parents always use a specific security session for signalling children, and children always use a specific security session for sending heartbeats to the parent, perhaps we can stop allowing DAEMON-level access to these commands and restrict them to these specific security sessions.  The one thing I'm not sure about is whether there are any cases where DC signals are sent from processes that are not direct parents, or whether we would want to keep this option open.\n\n</p><p></p><hr/>\n<em>2011-May-23 17:43:16 by bbockelm:</em> <br/>\n\nOuch - so, in order for Condor-C to work, anyone must be able to signal a Condor process?\n\n<p>FWIW, I can temporarily give this permission only to the C_GAHP, an unsatisfactory but functioning workaround:\n\n</p><p>C_GAHP.ALLOW_DAEMON = $(ALLOW_DAEMON) bbockelm@unl.edu\n\n</p><p></p><hr/>\n<em>2011-May-24 08:18:05 by tannenba:</em> <br/>\n\nI am 99% certain signals are only passed from parents to direct/immediate children, and vice-versa, so binding to a specific security session is an idea.\n\n<p>As I don't like the idea of a process running as the user having permission to send signals to the gridmanager any more than Brian, here is another idea: don't have the C-Gahp even attempt to send alives to its parent. The gridmanager has other means of knowing if the gahp is non-responsive. Maybe the below attached patch?\n\n</p><p></p><hr/>\n<em>2011-May-24 09:58:58 by danb:</em> <br/>\n\nTodd,\n\n<p>The patch looks safe to me.  There is no need to make a special case for dagman, because dagman does not inherit <code>DaemonCore</code> info from its parent.\n\n</p><p></p><hr/>\n<em>2011-May-24 13:17:38 by tannenba:</em> <br/>\n\nPatch pushed to v7.6.1, resolving.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/354/sendalive.patch\">sendalive.patch</a>\n881 bytes added by tannenba on 2011-May-24 13:19:24 UTC.\n<br/>\npatch to tell daemon core to not have dagman or cgahp (which is launched as the user) send alive messages to their parent process (often a condor daemon running as root).<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2011-May-24 12:55</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/91819f0c10a6e5ea3d6f3cfc54dfa1ba6c885eab\">[21962]</a></span>: The cgahp (which is launched as the user) should not send alive messages to its parent process (typically the gridmanager which is running as root). <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2178\" onclick=\"get_ticket_and_populate_wrapper('2178'); return false;\" title=\"Condor-C GAHP Worker Thread using the wrong credentials\">#2178</a></span>. ===VersionHistory=== Removed requirement that C_GAHP needs DAEMON-level authorization access to the gridmanager.  (By Todd Tannenbaum )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2011-May-24 13:17", "status": "resolved", "created": "2011-May-20 08:57", "fixed_version": "2011-May-20 08:57", "broken_version": "v070400", "priority": "3", "subsystem": "", "assigned_to": "tannenba", "derived_from": "", "creator": "bbockelm", "rust": "", "customer_group": "other", "visibility": "public", "notify": "dan@hep.wisc.edu, tannenba@cs.wisc.edu, jfrey@cs.wisc.edu, bbockelm@cse.unl.edu, gthain@cs.wisc.edu", "due_date": ""}