{"id": 2229, "title": "Ticket #2229: Try to recycle shadow as much as possible.", "description": "<blockquote>\nThe goal is to try to recycle the shadow whenever there can still be matches made.  Only shutdown the shadow when no matches are available or some odd error condition occurs.\n\n<p>This should increase utilization and decrease the amount of cycling the schedd does.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Jun-14 16:12:56 by danb:</em> <br/>\n\nThis patch attempts to achieve more recycling of the shadow in the face of exceptional events in the life of the job.  Unless I am misreading, this patch does not achieve recycling of the shadow when it would be necessary to assign a new claim to the shadow (e.g. because of preemption or CLAIM_WORKLIFE).  It always uses the same old claim, even in the case where the claim is not accepting more jobs (JOB_EXITED_AND_CLAIM_CLOSING: 115).  Have you tested what happens when you try to recycle the shadow for a claim that is closing or which failed to start the job?  It seems to me that recycling the shadow in this case is unlikely to be beneficial.\n\n<p></p><hr/>\n<em>2011-Jun-14 16:23:53 by tstclair:</em> <br/>\n\nI've tested for 115, and it appears to behave properly.  I'm not 100% certain that the mrec being used is legit any more if the claim has closed.\n\n<p>But the ideal case would be to try not to shutdown the shadow if it is at all possible for the following exit codes: 108,107,&amp;&amp; 115.\n\n</p><p>I've tried testing other events, and it is far less beneficial, so I've removed.\n\n</p><p></p><hr/>\n<em>2011-Jun-14 16:55:24 by danb:</em> <br/>\n\nIf we recycle the shadow for a claim that is closing, I would expect the next attempt to run a job on that claim to be rejected by the startd.  Then the shadow will either exit or continue to be recycled and fail over and over.  Do you agree?\n\n<p></p><hr/>\n<em>2011-Jun-15 08:42:09 by tstclair:</em> <br/>\n\nI ran another test again and here is what I see.\n\n<p>Attempt to recycle 115, failed contact with startd 108 then exits.\n\n</p><p>So this approach doesn't work.  Is it possible to update the mrec for a shadow, or is the shadow directly tied to the claim once it starts.\n\n</p><p></p><hr/>\n<em>2011-Oct-03 15:41:00 by tstclair:</em> <br/>\n\nAbandon in preference to multiclaim features.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/370/shadow_recycle.patch\">shadow_recycle.patch</a>\n3915 bytes added by tstclair on 2011-Jun-13 16:33:18 UTC.\n<br/>\nUpdate to recycle shadows.. Tested w/115, checks ok.  \nStill requires independent test for 108 (usually overload)\nand 107 (also overload)<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Oct-03 15:41", "status": "abandoned", "created": "2011-Jun-13 11:27", "fixed_version": "2011-Jun-13 11:27", "broken_version": "v070700", "priority": "3", "subsystem": "Daemons", "assigned_to": "tstclair", "derived_from": "", "creator": "tstclair", "rust": "", "customer_group": "users", "visibility": "public", "notify": "matt@cs.wisc.edu, dan@hep.wisc.edu, tstclair@redhat.com", "due_date": ""}