{"id": 2320, "title": "Ticket #2320: Improve security configuration in 7.7.x", "description": "<blockquote>\nPeople, including us, frequently have trouble correctly configuring Condor to use strong authentication. There are many parameters that must be set correctly. Any mistake can result in an insecure pool or a pool where daemons can't talk to each other, and debugging the mistake can be very difficult. See ticket <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=2319\" onclick=\"get_ticket_and_populate_wrapper('2319'); return false;\" title=\"Improve security configuration in 7.6.x\">#2319</a></span> for an example.\n\n<p>We need to make security configuration easier. Ideally, a user would set one parameter to enable the common strong security configurations for their pool (e.g. use a pool password for all daemon-to-daemon communications).</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Jul-19 14:26:41 by bbockelm:</em> <br/>\n\nHi Jaime,\n\n<p>I've actually been thinking about this for awhile.  One idea I had was allow the collector to issue a certificate to any daemon that connects to it the first time it connects.\n\n</p><p>Once all the daemons have connected once, the sysadmin would turn off auto-generate mode and turn on normal SSL instead.\n\n</p><p>This would provide good security (compromise of one node doesn't cause compromise of every node), be simple to deploy, and minimize the window of \"low security\" to the initial cluster setup time.\n\n</p><p>Separately, I think it would be wonderful if Condor could provide an audit tool that queries the daemons in a pool and catches obvious beginner mistakes or checks that certain simple assertions are true (\"no daemon in this pool accepts authentication by IP\").\n\n</p><p>Brian</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Jul-19 14:28", "status": "new", "created": "2011-Jul-19 14:02", "fixed_version": "2011-Jul-19 14:02", "broken_version": "v070500", "priority": "3", "subsystem": "Security", "assigned_to": "zmiller", "derived_from": "#2319", "creator": "jfrey", "rust": "", "customer_group": "other", "visibility": "public", "notify": "bbockelm@cse.unl.edu", "due_date": ""}