{"id": 2629, "title": "Ticket #2629: User-creatable job prerequisites", "description": "<blockquote>\nProblem: My job has a bunch of initial setup that is required.  The common case is that I might need some large software package, like R or the Matlab Compiler Runtime installed.  I can bring it with me, but if I'm running a large number of jobs, you can end up wasting lots of bandwidth and time downloading and installing it.\n\n<p>Current work arounds typically system administrator intervention, and remove Condor's ability to manage the system.\n\n</p><p>Proposal: A job can specify a prerequisite.  Something like \"Matlab-MCR-2011b.\"  It also has a path to another submit file associated with it.  So job might say:\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">PREREQUISITIES=Matlab_MCR_2011b gcc\nMatlab_MCR_2011b=/path/to/Mathlab.submit\ngcc=/different/path/to/gcc.submit\nRANK=PREREQ_adesmet_Matlab_mcr_2011b + PREREQ_adesmet_gcc\n</pre></div>\n\n\n<p>When the startd/starter is about to start a job, the machine checks if the prereqs are satisified.  They default to not.  If they are not, the second submit file is used to immediately run the job that sets up the prereq.  However, instead of being put into EXECUTE in a directory that is wiped out quickly, the job runs in a directory that will persist for \"a while\" and that Condor knows is associated with the prereq.  Maybe $(PREREQ)/$(Owner)/$(prereq_name).  Once all prereq jobs are finished, the real job is allowed to run.\n\n</p><p>Once a prereq is installed, it will be advertised in the form PREREQ_$(Owner)_$(prereq_name), allowing preference by RANK to avoid unnecessary installs.\n\n</p><p>Installed prereqs will be deleted based on space used; aging out probably based on least recently used, but more clever techniques are possible.   However, if a running job requires a given prereq, it will not be removed.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Nov-10 15:06", "status": "new", "created": "2011-Nov-10 15:05", "fixed_version": "2011-Nov-10 15:05", "broken_version": "v000000", "priority": "5", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}