{"id": 2645, "title": "Ticket #2645: Maintain DAGMan state in a better way", "description": "<blockquote>\nTodd T and I just had a discussion about improving the way DAGMan maintains its internal state and re-creates it in recovery mode.  Right now it basically does this by modifying the node job user log files (truncating them and writing POST script terminated events to them).  That really isn't such a great idea, and we still run into problems if jobs from separate DAGs share log files (and this is why you currently can't use macros in log file names for DAG node jobs).\n\n<p>We came up with a couple of different ways of dealing with this:\n</p><ol>\n<li>DAGMan no longer reads the user log files -- instead, it passes a \"node status file\" name to the schedd via condor_submit, and the schedd writes the current job status into that file (in addition to writing to the normal user log, if one is specified).\n</li><li>DAGMan still reads the user log files, but it writes its own file that maps node names to log file names and cluster IDs.  (This would require a two-phase condor_submit, where it writes the log file name and cluster ID to stdout; DAGMan would then write these to its own file, and then tell condor_submit to continue and actually submit the job.)  So in recovery mode, DAGMan would first read this \"side\" file, and then use that information to read the correct events from the correct log files.\n</li></ol>\n\n<p>(Also see <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=445\" onclick=\"get_ticket_and_populate_wrapper('445'); return false;\" title=\"Gracefully handle two DAGs with identical node names sharing user log\">#445</a></span>.)</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Oct-04 14:32:28 by wenger:</em> <br/>\n\nI'm not sure whether this is relevant now that <span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=2807\" onclick=\"get_ticket_and_populate_wrapper('2807'); return false;\" title=\"Have DAGMan use a single node job user log file\">#2807</a></span> has been implemented.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Jan-29 14:07", "status": "resolved", "created": "2011-Nov-17 12:55", "fixed_version": "2011-Nov-17 12:55", "broken_version": "v070702", "priority": "5", "subsystem": "Dag", "assigned_to": "nwp", "derived_from": "#2160", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}