{"id": 2719, "title": "Ticket #2719: condor_ssh_to_job and stuck shadows", "description": "<blockquote>\nStuart reports:\n\n<p>With condor 7.6.4 on SL6 I think have a mostly reproducible way to generate a stuck shadow process and an X-state job in the queue,\n\n</p><p></p><pre>   condor_run /bin/sleep 300\n   condor_ssh_to_job -auto-retry\n   (Start /usr/bin/top in ssh window when available)\n   condor_rm (or ctrl-c against condor_run)\n</pre>\n\n<p>This leaves a hung Shadow process on the submit machine and the job in the X-state 4 out 5 times in my testing. However, this does not appear to happen (in a few trials) if you do <em>not</em> run top in the ssh session, but just leave it at a prompt when attempting to remove the job from the queue.\n\n</p><p>When this test leaves a condor_shadow process behind it does not go away with a simple \"kill pid\", but requires \"kill -9 pid\" (at which point the job does leave the queue as expected).\n\n</p><p>This was observed on the Caltech pool, so it is probably worth someone else testing on another pool.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Dec-20 17:00:48 by danb:</em> <br/>\n\nI was able to reproduce this problem in 7.6.4 and the current release candidate for 7.6.5, and also in 7.7.0.\n\n<p>I was <em>not</em> able to reproduce this problem in 7.7.1 and more recent versions of 7.7, including the current trunk.  This suggests that the problem was fixed in 7.7.1.  The most likely source of the fix appears to be <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2329\" onclick=\"get_ticket_and_populate_wrapper('2329'); return false;\" title='periodic_remove &amp;&amp; \"\"_hold would inadvertantly cause a release_claim'>#2329</a></span>.  This would not be trivial to backport, because it introduced other bugs and therefore needs to pull in some other patches.  Therefore, it would be nice to know the urgency of fixing this problem in 7.6.6 as opposed to waiting for 7.8, which is due (I believe) in a couple months.\n\n</p><p></p><hr/>\n<em>2012-Jan-23 12:26:05 by danb:</em> <br/>\n\nIgor has observed similar behavior in 7.6.5 on a submit node he manages for a UCSD research group.  He indicated the priority of fixing this in 7.6 was not high, given that there is a fix in 7.7.\n\n<p></p><hr/>\n<em>2012-Feb-23 16:40:37 by adesmet:</em> <br/>\n\nIn 7.6.4 (and probably earlier and later) -forcex will remove a job stuck in this state.  I note this in case anyone else is looking at this ticket for the reason I was: they wanted a way to easily reproduce X jobs, but you also want one that -forcex doesn't work on.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2012-Feb-23 16:40", "status": "defer", "created": "2011-Dec-15 15:05", "fixed_version": "2011-Dec-15 15:05", "broken_version": "v070604", "priority": "5", "subsystem": "Daemons", "assigned_to": "danb", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "tannenba@cs.wisc.edu,anderson@ligo.caltech.edu,pfcouvar@syr.edu,dan@hep.wisc.edu,tstclair@redhat.com,pcouvare@caltech.edu", "due_date": ""}