{"id": 2754, "title": "Ticket #2754: File transfer fails for local universe", "description": "<blockquote>\nThe Pegasus people want file transfer for local universe to work just like it does for vanilla universe. The motivation is that, for Pegasus, they want to be able to change between vanilla and local universe, make no other changes in the submit file, and have things including file-transfers work.</blockquote>", "remarks": "<blockquote>\n<em>2012-Apr-05 11:36:14 by tannenba:</em> <br/>\n\n\n<p>Our current plan to have local universe jobs run under a startd running on the same machine as the schedd.\n\n</p><p>In Condor, typically the condor_shadow (shadow) process is responsible for managing a running job. With local universe, there is no shadow process, only a starter that is launched as a child process directly under the schedd - as a result, there are many semantic differences -vs- vanilla universe, including the file transfer issues you are experiencing.\n\n</p><p>So we are thinking of making local universe jobs exactly like vanilla universe jobs, except for the fact that local universe jobs will only be scheduled to run on the same machine where the schedd resides.  To accomplish this, we would have a startd running alongside the schedd on the submit machine that would launch local universe jobs.\n\n</p><p>Of course, you could effectively do this today by simply adding a startd to the DAEMON_LIST on your submit machine, and then submitting your local universe jobs as vanilla universe with\n\n</p><p></p><pre>   requirements = Machine == \"name.of.your.submit.host\"\n</pre>\n\n<p>and in the config file have the following to tell the startd to only run your local universe jobs\n\n</p><p></p><pre>   Start = User == \"vahi@name.of.your.submit.host\"\n</pre>\n\n<p>But ultimately we are thinking of making this startd-that-runs-local-universe jobs a first-class citizen, e.g. perhaps the startd would be launched automatically as needed, it would automatically register itself with the local schedd so that no waiting for a negotiation cycle would be required (just like local universe today), etc.  Besides helping out with this problem of having the same file transfer semantics, there are other advantages to this approach, such as the additional resource management opportunities the startd can bring to local universe jobs.\n\n</p><p></p><hr/>\n<em>2013-May-23 11:23:35 by gthain:</em> <br/>\n\ndup of <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=3019\" onclick=\"get_ticket_and_populate_wrapper('3019'); return false;\" title=\"Local universe jobs should run under a startd\">#3019</a></span></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-May-23 12:24", "status": "abandoned", "created": "2012-Jan-10 16:48", "fixed_version": "2012-Jan-10 16:48", "broken_version": "", "priority": "5", "subsystem": "Daemons", "assigned_to": "gthain", "derived_from": "", "creator": "wenger", "rust": "a21870", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, tannenba@cs.wisc.edu, danb@cs.wisc.edu, zmiller@cs.wisc.edu, vahi@isi.edu", "due_date": ""}