{"id": 2758, "title": "Ticket #2758: Enforce profile loading for Windows machines with dedicated user(s).", "description": "<blockquote>\n[Assigned to ToddT for a priority decision.  I think this could be completed very quickly, easily in time for 7.7.5, which would make us happy.]\n\n<p>Short version: Add a knob, probably named LOAD_PROFILE, that acts exactly like the submit-file attribute <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LoadProfile\" title=\"Load Profile\">LoadProfile</a></span>, but is machine- instead of job- specific.\n\n</p><p>Long version: I just wasted an hour discovering that doing builds in the new Lab rather requires this.  I don't want any of my users having to go through the same trouble; instead, I'd like to be able, as the administrator, to make <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LoadProfile\" title=\"Load Profile\">LoadProfile</a></span> true.  I can do this by changing Metronome or tweaking SUBMIT_EXPRS.\n\n</p><p>The former doesn't help other Condor users and the latter won't work for anyone who permits remote submissions.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Jan-13 12:54:02 by tannenba:</em> <br/>\n\nI am all about making BaTLab happy :)\n\n<p>Thoughts:\n\n</p><p></p><ol>\n<li>TJ, what would be the downside(s) of running w/ Load Profile always on?\n\n<p></p></li><li>If the user actually specifies a load profile preference in the job classad, we want that to have precedent over whatever some machine owner claims, right?\n\n<p></p></li><li>Still not sure I want to special case load profile - essentially this is just an instance of a broader problem where we want to be able to specify default values for job classad attributes for any job that lands in our pool. Moreover, I am not sure I like the idea that this is at the startd level - seems like it should be more at the central manager level. What about the idea of a knob that is like the already existing <code>NEGOTIATOR_MATCH_EXPRS</code> knob, but instead of inserting attrs w/ a prefix, it inserts un-prefixed attrs into the job ads iff those attrs are not already specified?  Maybe named something like <code>NEGOTIATOR_DEFAULT_MATCH_EXPRS</code> ?</li></ol>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Jan-30 15:25", "status": "new", "created": "2012-Jan-12 14:32", "fixed_version": "2012-Jan-12 14:32", "broken_version": "", "priority": "3", "subsystem": "Win32", "assigned_to": "johnkn", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "tannenba@cs.wisc.edu, tlmiller@cs.wisc.edu", "due_date": ""}