{"id": 2828, "title": "Ticket #2828: Persistent security session and collector health cache for tools", "description": "<blockquote>\nNew connections between Condor daemons are optimized by caching of security sessions. When High-Availability is in use, daemons also avoid collectors that have been unreachable in the recent past. The command-line tools don't see any of these benefits, since the information is only stored in memory. Each invocation of a tool needs to establish a new security session with each daemon it talks to and can spend a long time trying to contact a primary collector that's currently unreachable.\n\n<p>We give the command-line tools the same benefits the daemons have by writing out security session and collector health information to a persist cache file on disk. Subsequent invocations of the tools would read in this file and use any relevant information.\n\n</p><p>Argo Graphics has had their primary collector go down for prolonged periods of time, during which each tool invocation will spend a minute trying to talk to the dead machine before querying the secondary collector.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Feb-20 14:27:24 by matt:</em> <br/>\n\nFYI - <a class=\"external\" href=\"https://bugzilla.redhat.com/show_bug.cgi?id=472320\">https://bugzilla.redhat.com/show_bug.cgi?id=472320</a>\n\n<p></p><hr/>\n<em>2012-Feb-20 15:25:14 by bbockelm:</em> <br/>\n\nHow do the tools express context?  Where does the session get persisted?  For example, if I do the following:\n\n<p>X509_USER_PROXY=/tmp/foo condor_status\n\n</p><p>then\n\n</p><p>X509_USER_PROXY=/tmp/bar condor_status\n\n</p><p>how will the tool determine if the persisted security session is still valid?\n\n</p><p>I think this is a lovely idea as an opt-in, especially for folks that invoke Condor programmatically (glideinWMS immediately comes to mind) and \"know what they're doing\".  Having it turned on by default in a both safe and sane manner sounds very difficult.\n\n</p><p></p><hr/>\n<em>2012-Feb-20 15:47:02 by jfrey:</em> <br/>\n\nThe cached session information would have to include information about inputs that affected the establishment of the session, like the X509 credential used, if there was one.\n\n<p>It should certainly start life as opt-in. If we were to eventually enable it by default, that would be after a lot of testing.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Feb-20 15:47", "status": "new", "created": "2012-Feb-15 15:37", "fixed_version": "2012-Feb-15 15:37", "broken_version": "v070700", "priority": "4", "subsystem": "Tools", "assigned_to": "", "derived_from": "", "creator": "jfrey", "rust": "s8127", "customer_group": "other", "visibility": "public", "notify": "zmiller@cs.wisc.edu,jfrey@cs.wisc.edu,tstclair@redhat.com", "due_date": ""}