{"id": 2832, "title": "Ticket #2832: Parallel collector queries", "description": "<blockquote>\nIn a high-availability pool, when the primary collector is down, daemons and tools will attempt to query the unreachable machine for 60 seconds before trying one of the secondary collectors. Daemons will avoid the unreachable machine for an hour, then spend a minute in a blocking connection to the primary collector in case it's back up. Tools will spend a minute trying to connect to the dead machine every time.\n\n<p>One way to minimize these delays is to query the multiple collectors in parallel. To minimize extra load, a single collector is contacted first. If an initial reply isn't received after several seconds, then connections to the other collectors are begun. Once a collector starts replying, connections to the other collectors are closed.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Feb-20 12:30:19 by matt:</em> <br/>\n\nThis could result in expensive query processing that is thrown away. Many TOOL generated collector queries are full dumps of memory. Closing a connection does not preempt the generation of a query response, only the sending of it.\n\n<p>Instead, the timeout could be reduced and tools could be allowed to randomly choose between HA collectors.\n\n</p><p>There may be a conflation of timeout for the connection and timeout for the query result. The suggestion is to have a short connection timeout and long response timeout.\n\n</p><p></p><hr/>\n<em>2012-Feb-20 14:27:46 by matt:</em> <br/>\n\nFYI - <a class=\"external\" href=\"https://bugzilla.redhat.com/show_bug.cgi?id=472320\">https://bugzilla.redhat.com/show_bug.cgi?id=472320</a></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Feb-20 14:27", "status": "new", "created": "2012-Feb-20 11:43", "fixed_version": "2012-Feb-20 11:43", "broken_version": "v070700", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "jfrey", "rust": "s8127", "customer_group": "other", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}