{"id": 2930, "title": "Ticket #2930: Allow \"weak\" parent/child relationships", "description": "<blockquote>\nBrooklin says that a user would like to have the option of specifying \"weak\" parent/child relationships in a DAG -- in other words, not <strong>all</strong> of a job's parents have to finish before it runs.\n\n<p>It seems like the simplest possibility would be to specify that a job runs when a certain percentage of its parent jobs have completed, but we may want other options besides that.  (We need to think about both the user's perspective and the implementation perspective.)\n\n</p><p>Also, we need to think about what happens to \"unneeded\" parent jobs -- do they get removed?\n\n</p><p>We'll really have to be careful when implementing this -- I think there are a lot of ways that the internal logic of DAGMan could get goofed up.  We need to make sure that recovery mode and rescue DAGs work correctly with this feature.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Apr-20 14:45:54 by wenger:</em> <br/>\n\nMiron just mentioned that he is concerned with this introducing a statistical bias into people's results, if jobs don't finish because of some characteristic of the job itself, as opposed to landing on a bad machine or something (e.g., are all of your outliers the ones that take a long time to finish, and therefore if you exclude them you are really biasing your results).\n\n<p></p><hr/>\n<em>2012-May-15 20:59:04 by nwp:</em> <br/>\n\nPerhaps DAGman would be better implemented as a \"schedd on the side\", that is, a schedd with some additional capability to control job submission---a la the dependency graph of DAGman. e.g,. users could then query the \"schedd on the side\" for job status.  Also implement a (classad) library so that users can write their own policies, like \"start jobs in cluster B after 80% of jobs in cluster A have completed\" or \"Do not submit any jobs if more than 50 jobs are idle (or such)\"\n\n<p></p><hr/>\n<em>2012-Jun-18 12:55:53 by nwp:</em> <br/>\n\nIf I remember Brooklin's original email correctly, this would be better implemented as a master-worker program, rather than DAGman.\n\n<p></p><hr/>\n<em>2015-Oct-29 14:05:44 by wenger:</em> <br/>\n\nI think another option for this is something like, \"the child is submitted after the parent has been successfully submitted\" or \"the child is submitted after the parent has submitted and started running\".  Some variations of this would be useful for testing, if nothing else.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Oct-29 14:05", "status": "new", "created": "2012-Apr-09 12:40", "fixed_version": "2012-Apr-09 12:40", "broken_version": "v070706", "priority": "3", "subsystem": "Dag", "assigned_to": "", "derived_from": "", "creator": "wenger", "rust": "a23353", "customer_group": "chtc", "visibility": "public", "notify": "wenger@cs.wisc.edu, tannenba@cs.wisc.edu,bgore@cs.wisc.edu", "due_date": ""}