{"id": 2935, "title": "Ticket #2935: Teach Condor to run as a BOINC-like backfill system", "description": "<blockquote>\n<a class=\"external\" href=\"http://chtc-wiki.cs.wisc.edu/index.cgi/search?s=DOITYOURSELFBOINC&amp;w=1\">A potential UW campus user</a> is interested in using Condor as a BOINC-like system.  Perhaps Condor should have better built in support.  Such a system should\n\n<p></p><ul>\n<li>Be robust in the face of firewalls and NATs.  CCB can help, but tunneling over HTTP(S) would be even better.  We'd need to assume outbound only connections.\n\n<p></p></li><li>Internet access may be spotty, so we'll want to download a lot of work when we do connect.  We'll need to be able to run for long periods with no connection to the internet.  However, we don't want to wait until all of the work is done before sending results, and as some smaller tasks finish we want to top-off our queue of work while we have an internet connection.  Work fetch can do this today, but requires writing custom hooks and generally adding complexity.\n\n<p></p></li><li>Should be very cautious to stop using CPU and minimize RAM usage very quickly when a user tries using the machine.  Doable today with suitable policy.\n\n<p></p></li><li>Should detect, as much as possible, situations in which it shouldn't run: low battery and no wall power, overheating.  Can do this today, but we'd need to add a bunch of currently non-existent startd cron programs.\n\n<p></p></li><li>Highly customizable so a power user can tune the sorts of jobs they accept. Doable today with suitable policy.  However, users might want to configure that policy from a centralized web site, which complicates the matchmaking system.\n\n<p></p></li><li>Needs to be highly portable, at least across Windows computers. Done.\n\n<p></p></li><li>Needs to be extremely simple to set up for common configurations; run a single program and you're done.  Doable, just a matter of packaging.</li></ul>\n</blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Apr-10 15:13", "status": "new", "created": "2012-Apr-10 15:13", "fixed_version": "2012-Apr-10 15:13", "broken_version": "v070000", "priority": "5", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}