{"id": 3105, "title": "Ticket #3105: DAGMan does not survive across upgrades when copied to spool", "description": "<blockquote>\nLIGO reports the following problem:\n<div class=\"code\">\n<pre class=\"code\">We upgraded the Caltech LIGO Condor pool from version 7.8.0 to 7.8.1 today and this has resulted in the following potentially serious\n+problem.\n                                                                                                                                     In particular, it appears that a user's dag was lost without a rescue dag being generated. Of particular interest is the user\n+dag.lib.err file,\n\n[root@ldas-grid condor]# cat\n+/home/dtalukder/Projects/ringdown/S5/finalihoperuns/mo_17_18/857232370-862070770/s5_ring_mo_1-24.dag.lib.err\ncondor_scheduniv_exec.99293315.0: error while loading shared libraries: libcondor_utils_7_8_0.so: cannot open shared object file: No\n+such file or directory\n\nIs there a problem with the condor_dagman binary being unable to survive a Condor upgrade due to its use of shared libraries?\n\nNote, it does appear that condor_dagman depends on this version specific shared object file, and give the use of \"_\" as a version\n+delimiter it is not clear to me how ld.so could start an old copy of condor_dagman in the queue after an upgrade,\n\n[root@ldas-grid condor]# ldd /usr/bin/condor_dagman | grep condor_utils\n        libcondor_utils_7_8_1.so =&gt; /usr/lib64/condor/libcondor_utils_7_8_1.so (0x00007ff4b5dea000)\n</pre></div>\n\n\n<p>I have been recommending that people affected by this problem just do condor_submit &lt;DAG file&gt;.condor.sub, but now I realize this will not work because the condor version will change.  Indeed, I suspect that it will not work across an upgrade anyway unless you use the same version of condor_dagman as the version of condor_submit_dag that submitted the DAG.\n\n</p><p>Flightworthy meeting 2 July 2012 suggests building the condor_dagman statically.  TJ wanted to have a stub script that turns around and runs condor_dagman.  Todd T. thinks that condor_dagman should <strong>never</strong> be submitted with COPY_TO_SPOOL = True.  Condor does not have a solution yet.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Jul-03 08:46:22 by nwp:</em> <br/>\n\nDAGman has a problem starting up when the version changes anyway. Here are the arguments from a typical DAGMan submit file:\n<div class=\"code\">\n<pre class=\"code\">&lt;snipped&gt;\narguments       = \"-f -l . -Lockfile 1281.dag.lock -AutoRescue 1 -DoRescueFrom 0 -Dag 1281.dag -CsdVersion $CondorVersion:' '7.9.1' 'Jun' '29' '2012' 'BuildID:' 'UW_development' 'PRE-RELEASE-UWCS' '$ -Dagman /scratch/nwp/personal-condor/release_dir/bin/condor_dagman\"\n&lt;snipped&gt;\n</pre></div>\n\nNote that the condor_submit_dag version is part of the command line.  condor_dagman will refuse to start if there is version skew between condor_submit_dag and condor_dagman, unless the command line flag -AllowVersionMismatch is added.\n\n<p></p><hr/>\n<em>2012-Jul-10 15:49:12 by gthain:</em> <br/>\n\nSome updates after the LIGO conference call today:\n\n<p>This is delaying the upgrade of several LIGO sites, so they are running with skewed versions across pools, thus this ticket is higher priority than one might otherwise think.\n\n</p><p>The reason LIGO uses COPY_TO_SPOOL is twofold:  One, their binaries used to be on NFS, and upgrading there is troublesome.  Two, the condor version checking code is adamant and loudly warns about the dangers of different versions of DAGman running against the same submit file and dagman input.\n\n</p><p></p><hr/>\n<em>2012-Jul-24 14:00:48 by pfc:</em> <br/>\n\nWe've talked about this internally, and so long as Condor commits to not intentionally breaking backwards compatibility for DAGs (i.e., existing, queued DAGs will not be made to fail after an upgrade), we're willing to take the leap and go back to unspooled DAGMan binaries.\n\n<p></p><hr/>\n<em>2012-Aug-21 14:17:43 by gthain:</em> <br/>\n\nLIGO says that they will set copy_to_spool = false for all their submissions, and live with this.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2012-Aug-21 14:18", "status": "defer", "created": "2012-Jul-02 16:18", "fixed_version": "2012-Jul-02 16:18", "broken_version": "v070800", "priority": "5", "subsystem": "Dag", "assigned_to": "nwp", "derived_from": "", "creator": "nwp", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "anderson@ligo.caltech.edu vahi@isi.edu tannenba@cs.wisc.edu,pcouvare@caltech.edu", "due_date": ""}