{"id": 3117, "title": "Ticket #3117: Why is Condor slow when hostname != FQDN?", "description": "<blockquote>\nIt appears (see parent ticket) that when Condor runs with DNS enabled, but the hostname != FQDN, that it runs very slowly.  Since this is arguably the correct configuration for many execute nodes (e.g., the collector or submit nodes exist in DNS but the execute node does not), this should be investigated and corrected.</blockquote>", "remarks": "<blockquote>\n<em>2012-Jul-11 11:17:36 by kronenfe:</em> <br/>\n\nI don't think there is slowness due to a non-fqdn.  I think that the delays can be attributed to a bug in the test suite.  Here is the high level summary of that bug:\n\n<p>a) The machine was advertising things without an FQDN\nb) The \"start Condor up\" code was expecting the startd to advertise with an FQDN\nc) The \"start Condor up\" code would timeout after roughly 3 minutes and say it hadn't properly started - even though it had.  The bug here is that even though it timed out it would continue on to run the test\nd) Most of the tests would succeed.  Except with an additional 3 minutes tacked on.  These delays would accumulate and eventually trigger the global timeout.\n\n</p><p>Note: the tests that did fail were mostly (all?) because they were looking for an FQDN in some manner.  For example, we would query \"condor_q -sub exec-13.batlab.org\" but that would return false because the schedd had submitted itself with just exec-13 and no domain.  I didn't check every failing test - only about 2 or 3 out of 7 - but since they all started succeeding when we fixed the domain I think this is a reasonable conclusion.\n\n</p><p>TJ thinks there might have been a delay so I will assign this ticket to him in case he can find some further proof.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2012-Jul-11 14:41", "status": "new", "created": "2012-Jul-09 17:32", "fixed_version": "2012-Jul-09 17:32", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "#3115", "creator": "johnkn", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}