{"id": 3409, "title": "Ticket #3409: stdout/stderr names are modified in execute sandbox", "description": "<blockquote>\nIn 7.7.2, a change was made to the naming of stdout/stderr in the execute sandbox.  When using file transfer, these files are now always given the names _condor_stdout and _condor_stderr.  Previously, these special names were only used when the names specified by the user contained path information.  The change in 7.7.2 was made so that the final filename saved on the submit machine would match the name specified by the user, but CMS also expects the name in the execute sandbox to match the name specified by the user (when just a bare basename was specified).\n\n<p>After discussion with Jaime, we concluded that this was a dangerous area to touch in the middle of a stable series, so we were reluctant to restore the old behavior in the 7.8 series, unless the patch turned out to be very simple and easily verified.</p></blockquote>", "remarks": "<blockquote>\n<em>2013-Jan-02 17:38:19 by danb:</em> <br/>\n\nI have attached a patch that provides the old behavior.  It is simpler than I expected.  Jaime, what do you think?\n\n<p></p><hr/>\n<em>2013-Jan-03 10:08:06 by danb:</em> <br/>\n\nI thought of one issue related to this patch.  Suppose a job was evicted and spooled by a version of condor between 7.7.2 and the version containing this patch.  Further suppose that this job was submitted with output and error as basenames, not paths.  When resumed, this job would not append to the existing _condor_stdout and _condor_stderr files spooled by 7.7.2+.  Instead, it would append to files with the names specified by the user.  If instead the job had been spooled by a version prior to 7.7.2, there should be no problem.\n\n<p>The same sort of problem was introduced in 7.7.2.  Jobs with spooled output from prior to 7.7.2 when restarting under 7.7.2 and newer (without the proposed patch) will start appending to _condor_stdout and _condor_stderr rather than the existing output files with the names specified by the user.\n\n</p><p>Bottom line: for people with spooled output who have not upgraded from 7.6 yet, the proposed patch will make life better.  For people with spooled output who have already upgraded to 7.8, the proposed patch could make life worse.  To address this, additional logic would be needed in the starter to check for the existence of _condor_stdout/err and to behave accordingly.\n\n</p><p></p><hr/>\n<em>2013-Jan-03 12:10:55 by danb:</em> <br/>\n\nI have prepared a second patch that resumes using the previously spooled output files.  However, this detail turns out to be inconsequential.  Why?  Because the starter opens the output files with the O_TRUNC flag, so previously spooled stdout/stderr is always lost anyway.  That seems wrong to me, but it does make our job easier in this instance.  There is no need to complicate the patch to deal with previously spooled stdout/stderr files.\n\n<p></p><hr/>\n<em>2013-Jan-03 12:29:03 by sfiligoi:</em> <br/>\n\nJust an update from CMS <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=AnaOps\" title=\"Ana Ops\">AnaOps</a></span>.\n\n<p>We accept that the filename of stdout/err on the worker node is an undocumented feature, and thus cannot be relied upon.\n\n</p><p>So we are making changes in our code to not rely on a specific file name.\n\n</p><p>Bottom line, we are not pushing for this \"bug\" to be fixed in the stable 7.8 series anymore.\n\n</p><p>Said that, we would still like a consistent behavior between Condor versions. Please settle on one naming convention, document it, and stick with it.\n\n</p><p>Thanks,<br/>\n\n  Igor<br/>\n\n  for CMS <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=AnaOps\" title=\"Ana Ops\">AnaOps</a></span></p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/666/stdio_names.patch\">stdio_names.patch</a>\n999 bytes added by danb on 2013-Jan-02 23:39:20 UTC.\n<br/>\nRestore pre-7.7.2 behavior in how stdout/stderr are named in the execute sandbox.<br/>\n</li><li><a href=\"../files/667/stdio_names_resume_fix.patch\">stdio_names_resume_fix.patch</a>\n2963 bytes added by danb on 2013-Jan-03 18:20:11 UTC.\n<br/>\nFor the record, here is the more complicated patch that (needlessly) handles the case of previously spool output files from 7.7.2+.  Since the starter truncates the output files anyway, I don't think the extra complexity of this patch is worth it.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "defect", "last_change": "2013-Sep-10 15:32", "status": "resolved", "created": "2013-Jan-02 17:37", "fixed_version": "2013-Jan-02 17:37", "broken_version": "v070702", "priority": "2", "subsystem": "", "assigned_to": "jfrey", "derived_from": "#1811", "creator": "danb", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "isfiligoi@ucsd.edu,dan@hep.wisc.edu,jfrey@cs.wisc.edu,tannenba@cs.wisc.edu", "due_date": ""}