{"id": 3446, "title": "Ticket #3446: DEFAULT_PRIO_FACTOR should be much higher", "description": "<blockquote>\nI think we shouldn't have the default value of DEFAULT_PRIO_FACTOR the same as the minimum priority factor, because then there's no way you can give a user a better priority than the default.  A support user just ran into a case where they wanted to give a few of their users higher priority -- but instead of decreasing the priority factor for those users, they have to <strong>increase</strong> the priority factor for all their other users, plus set a new, higher values of DEFAULT_PRIO_FACTOR in case any new users come along.\n\n<p>If the default for DEFAULT_PRIO_FACTOR had been, say, 1000, all they would have had to do was set a new priority factor for the few \"special\" users.\n\n</p><p>I guess the main argument I can see against this is that, for people upgrading existing HTCondor installations, things could get mixed up between existing and new users.  I guess one way to deal with that would be to put \"DEFAULT_PRIO_FACTOR = 1000\" into the config files, along with some explanation -- I assume that most people pretty much keep their existing config files when they upgrade.</p></blockquote>", "remarks": "<blockquote>\n<em>2013-Jan-16 17:33:38 by wenger:</em> <br/>\n\nHmm, now that I think about it, a better fix would be to just allow fractional priority factors.  I don't know enough about how things work internally to know if that would be a big problem in terms of implementation.  One possibility would be to just internally multiply the priority factors by 1000, say, and allow 0.001 as the minimum.  (Although it would clearly be less confusing to simply allow fractions, if that isn't too hard to implement.)\n\n<p></p><hr/>\n<em>2018-Sep-21 10:45:19 by jfrey:</em> <br/>\n\nThe default user priority factor was changed to 1000 in <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4282\" onclick=\"get_ticket_and_populate_wrapper('4282'); return false;\" title=\"change default for accountant priority factor to 1000\">#4282</a></span>.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2018-Sep-21 10:45", "status": "abandoned", "created": "2013-Jan-16 12:50", "fixed_version": "2013-Jan-16 12:50", "broken_version": "v070902", "priority": "2", "subsystem": "Daemons", "assigned_to": "", "derived_from": "#3445", "creator": "wenger", "rust": "s8248", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu", "due_date": ""}