{"id": 35, "title": "Ticket #35: condor_schedd: use hardlinks for executables in SPOOL whenever possibl", "description": "<blockquote>\nAn idea for reducing disk space use in the SPOOL: whenever the condor_schedd is about to copy a binary/initial checkpoint/ickpt into SPOOL, it should look for an identical binary owned by the same user. If such a binary exists, simply hardlink the existing one to the new one&amp;#8217;s name.\n\n<p>Advantages: Saves disk space no matter how the jobs arrive, so long as they share a binary. Can save space on jobs submitted via Condor-C.\n\n</p><p>Disadvantages: Starting with 6.9.1, the default for copy_to_spool FALSE, so the local submission benefit is minimal. This is new functionality, and would necessitate someone tracking file identities (probably using a hashing algorithm). Will this tracking information be held by the schedd and lost on restart? That would be safe, but would make it less effective. If it&amp;#8217;s stored on disk, where? Perhaps squeezed into the ickpt&amp;#8217;s filename?\n\n</p><p>A tempting proposal, especially since it will benefit Condor-C users. We have a number of Condor-C users who are basically submitting the same binary or small number of binaries over and over again, so this would help them.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Jan-16 11:16:32 by adesmet:</em> <br/>\n\nDuplicate of <span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=31\" onclick=\"get_ticket_and_populate_wrapper('31'); return false;\" title=\"Avoid thousands of copies of same file in SPOOL\">#31</a></span></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2009-Dec-17 14:18", "status": "abandoned", "created": "2009-Jan-16 11:03", "fixed_version": "2009-Jan-16 11:03", "broken_version": "", "priority": "4", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}