{"id": 3549, "title": "Ticket #3549: Leaked job processes on MacOS in Batlab", "description": "<blockquote>\nSeveral of the MacOS machines in the batlab (exec-21 and exec-22) are experiencing high loads and major sluggishness due to orphaned processes of old jobs.\n\n<p>Several times in the past couple of days, the procd on these machines decided that every process on the machine has exited (including pid 1). This includes the master, so the procd exits. The startd then exits when it can't talk to the procd, and the starters exit. The master attempts to tell the procd to kill the startd's family. This fails, either because it hasn't restarted the procd yet or because the restarted procd doesn't know about the startd's pid. Processes for running jobs are left behind as a result. If the job is the HTCondor test suite, this can be a lot of processes.\n\n</p><p>We should investigate why the procd occasionally decides all of the processes on the system have exited. We should also have the startd kill all processes owned by the slot users on startup, if slot users are configured.</p></blockquote>", "remarks": "<blockquote>\n<em>2013-May-23 11:41:06 by jfrey:</em> <br/>\n\nThe cause of this problem has been diagnosed and fixed (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=3617\" onclick=\"get_ticket_and_populate_wrapper('3617'); return false;\" title=\"Gathering pid list on mac os x and bsd can cause crashes\">#3617</a></span>).</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2013-May-23 12:29", "status": "resolved", "created": "2013-Mar-20 15:41", "fixed_version": "2013-Mar-20 15:41", "broken_version": "v070901", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "jfrey", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "bgietzel@cs.wisc.edu,tannenba@cs.wisc.edu,tlmiller@cs.wisc.edu", "due_date": ""}