{"id": 360, "title": "Ticket #360: Each regression test should link to a wiki page talking about it", "description": "<blockquote>\nThere should be a small additional link next to each test name on the test results page which points to a unique page in the gittrac wiki for that logical test. The page will be free form and in general have within it delineations for different branches, if need be. This feature is to allow us to keep track of test issues across branches, across discoverers, and over time. If a problem arises with a test, then a ticket should be made and referenced on the tests page.\n\n<p>Something to consider is that the page name must be some unique and algorithmically generated camel case name that follows the rules of the wiki. I recommend whatever mapping we choose the prefix <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=RegTest\" title=\"Reg Test\">RegTest</a></span> be placed before it so when we look at all of the nodes on the wiki, it is easily discernable.\n\n</p><p>There are problems with automating wiki word generation from our test names in that gittrac's camel case can't have multiple capitals in a row, or digits in it. The rules we must abide by are <a class=\"external\" href=\"http://www.cvstrac.org/cvstrac/wiki?p=WikiPageNames\">here</a>.\n\n</p><p>So, we may have to be very careful in how we map a test name to a wiki page. Once we figure out a good mapping, we should implement the linkage between the php pages and gittrac.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2010-Jan-31 13:20", "status": "new", "created": "2009-Apr-02 11:49", "fixed_version": "2009-Apr-02 11:49", "broken_version": "", "priority": "4", "subsystem": "Tests", "assigned_to": "", "derived_from": "", "creator": "psilord", "rust": "", "customer_group": "other", "visibility": "public", "notify": "gthain@cs.wisc.edu,psilord@cs.wisc.edu", "due_date": ""}