{"id": 362, "title": "Ticket #362: implement named slots or class of slot types", "description": "<blockquote>\nExample:\n\n<p>I have a large cluster. The nodes have anywhere from 1 to 8 slots available.\n\n</p><p>I'd like to add a slot to every node in the cluster. I'd like this slot to always run under a consistent user/uid, say \"admin\". My main reason for doing this doesn't really matter, but let's say it's so i can do administrative tasks, maybe run sudo processes or some setuid binaries.  I'd like to describe this simple addition in my condor configuration. Maybe i want to make similar additions to my config in the future, as well.\n\n</p><p>What would be the best way to add this slot? If i've done a good job with my configuration, at best i have factored the eight possible slot configurations into eight separate configs. It seems that i would have to tack an extra slot onto each of these configurations (so now i have anywhere from 2 to 9 slots), advertise an extra attribute declaring that this slot is my admin slot, and then just match on this extra attribute when it comes time to run my admin jobs. What if i want to add additional restrictions to this slot, such as only letting certain people in my uid domain run jobs on it? What if i have wildly different slot setups across my cluster (much more than 8)?\n\n</p><p>Do i have to respecify this for each separate slot configuration?\n\n</p><p>If the answer is yes, then maybe named slots would be helpful. I could say \"i'd like a slot called \"admin\" that i can match against on every node, that runs under uid \"admin\" in some toplevel config, and by the way only let uids \"griswold\" and \"bgietzel\" start jobs on it. I could specify this exactly once.\n\n</p><p>If the answer is \"no, condor already provides an easy way to tack on slots like this\", then you should probably not add this feature (and maybe let me know of a good way to specify this).</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2009-Apr-04 21:45:12 by gthain:</em> <br/>\n\nThere's no good way to add an extra slot in Condor that I can think of.\n\n<p>However, do you really want an extra slot, or an extra startd?  The extra startd might give you more isolation from the operational condor, and let you set per-startd settings that you might not want in the real condor.  This admin startd could report to a completely different pool, with different startds, so us lowly users wouldn't ever see it, or accidentally match to it.\n\n</p><p></p><hr/>\n<em>2009-Apr-04 23:29:41 by matt:</em> <br/>\n\nNick's local name configuration work may be useful, see 3.3.1.2.\n\n<p></p><hr/>\n<em>2009-Apr-05 00:23:19 by griswold:</em> <br/>\n\nThis is likely what we will end up doing in NMI for this specific case.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2012-Oct-16 13:23", "status": "new", "created": "2009-Apr-03 17:09", "fixed_version": "2009-Apr-03 17:09", "broken_version": "v070300", "priority": "4", "subsystem": "Daemons", "assigned_to": "griswold", "derived_from": "", "creator": "zmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tannenba@cs.wisc.edu", "due_date": ""}