{"id": 3642, "title": "Ticket #3642: automate parallel universe configuration in the condor rpm", "description": "<blockquote>\nParallel universe requires some basic configuration after installing HTCondor.  In the RPM, if possible, see if this configuration can be done so parallel universe can be ready to use out-of-box.</blockquote>", "remarks": "<blockquote>\n<em>2013-May-22 10:53:13 by tstclair:</em> <br/>\n\nYou could subpackage this with a extra config file which gets dropped in a config.d location.\n\n<p></p><hr/>\n<em>2013-Jun-11 15:51:57 by edquist:</em> <br/>\n\nYeah, that seems pretty reasonable.  I have made a sub-package called \"parallel-setup\" that includes a \"20dedicated_scheduler_condor.config\" under the config.d folder.  (Perhaps there are better names for either the sub-package or the config file, I'm open to suggestions.)\n\n<p>The new config file is taken from the example condor_config.local.dedicated.scheduler, with the dedicated scheduler set to $(FULL_HOSTNAME) and the scheduling policy for \"Always run jobs, but prefer dedicated ones\" uncommented.\n\n</p><p>It seems like setting up the node as a dedicated scheduler is the only real hurdle to running parallel universe jobs after installing... but it would need to be edited as more machines are added to the pool.  I am open to comments if there is a better approach.\n\n</p><p></p><hr/>\n<em>2013-Jun-12 09:59:31 by edquist:</em> <br/>\n\nInitial test case works now to run a parallel universe job for a personal condor installation without additional configuration, which at least covers what was requested for this ticket.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Jun-12 09:59", "status": "review", "created": "2013-May-21 10:44", "fixed_version": "2013-May-21 10:44", "broken_version": "", "priority": "4", "subsystem": "Packaging", "assigned_to": "edquist", "derived_from": "#3638", "creator": "edquist", "rust": "", "customer_group": "other", "visibility": "public", "notify": "edquist@cs.wisc.edu", "due_date": ""}