{"id": 3773, "title": "Ticket #3773: Put path to bin, sbin, libexec, and CONDOR_CONFIG in job's environment", "description": "<blockquote>\nWhen starting a job, we should put the paths to HTCondor's bin, sbin, and libexec directories into the job's environment, perhaps as _HTCONDOR_BIN, _HTCONDOR_SBIN, and _HTCONDOR_LIBEXEC.  These paths would just be to the patching BIN, SBIN, and LIBEXEC paths in the configuration file.   We should also ensure the CONDOR_CONFIG is set as it was set when HTCondor was startedd.\n\n<p>Rationale: There are good reasons for a job to want to use various HTCondor programs.  condor_chirp is the obvious one; it exists for the specific purpose of being called by jobs.  (See <span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=3753\" onclick=\"get_ticket_and_populate_wrapper('3753'); return false;\" title=\"DMTCP checkpoint resumes must require original CheckpointPlatform\">#3753</a></span> for an example.)  A job might also be doing clever things like running on a remote machine and wanting to submit a new job, perhaps a whole DAG.  But it's HTCondor doesn't make this easy.  The tools are not in the PATH, nor is CONDOR_CONFIG set if it's required.  A job needs to experimentally search for the correct configuration, or pools need to be specially configured to make this practical.  If we advertise the paths to the directories and set CONDOR_CONFIG for the job, running other HTCondor programs because much easier.\n\n</p><p>Worth considering: a fair number of users are running HTCondor under HTCondor. (Glide-ins.  The BaTLab for our own tests).  Depending on which things we're setting, it's possible we might confuse a nested HTCondor.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Jul-15 11:02", "status": "new", "created": "2013-Jul-12 12:01", "fixed_version": "2013-Jul-12 12:01", "broken_version": "v000000", "priority": "4", "subsystem": "DaemonsSubmitNode", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tstclair@redhat.com", "due_date": ""}