{"id": 3809, "title": "Ticket #3809: condor_status should sort SlotId right", "description": "<blockquote>\nThe current default sort is <strong>intending</strong> do this, but it's failing to do it correctly because it's doing an alphanumeric sort on the slotid@machine string.  This hasn't worked since there have existed &gt;9 cores on a box (i.e., a loooooong time).\n\n<p>The sort should be on the Machine attr first and the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=SlotId\" title=\"Slot Id\">SlotId</a></span> second.\n\n</p><p>See also <span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=3810\" onclick=\"get_ticket_and_populate_wrapper('3810'); return false;\" title=\"condor_status -sort sorts differently with -format vs without\">#3810</a></span>.</p></blockquote>", "remarks": "<blockquote>\n<em>2013-Jul-24 14:34:58 by johnkn:</em> <br/>\n\nThe slot id is a name, that happens to contain a number when the default name is used. it's being sorted correctly.\n\n<p></p><hr/>\n<em>2013-Jul-24 14:55:43 by pfc:</em> <br/>\n\nNot according to <a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/manual/v8.0/12_Appendix_A.html#89315\">the manual</a>:\n\n<p>SlotID: For SMP machines, the <strong>integer</strong> that identifies the slot.\n\n</p><p>(Emphasis mine.)\n\n</p><p></p><hr/>\n<em>2013-Jul-24 15:55:14 by pfc:</em> <br/>\n\nYou may be confusing this with the fact that the name \"slot\" can be redefined (which dates back to the change from vmN to slotN) but that's orthogonal to this issue.  No one in the world wants Condor to sort their <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=SlotIds\" title=\"Slot Ids\">SlotIds</a></span> (which are always integers) non-numerically so that 11 comes before 2.\n\n<p></p><hr/>\n<em>2013-Jul-24 17:55:45 by johnkn:</em> <br/>\n\nYes the <code>SlotID</code> attribute is an integer, but condor_status never looks at that.  the default sort is based on 4 keys:  <code>OPSYS / ARCH / MACHINE / NAME</code>\n\n<p>Since <code>NAME</code> is what is displayed in the first column, it makes sense to sort by that.  I don't think sorting first by OPSYS and ARCH is a good idea, but in most pools, this does no harm.  <code>Name</code> usually contains <code>MACHINE</code> so the sort by machine first is just redundant.\n\n</p><p>if the sort were <code>OPSYS / ARCH / MACHINE / SLOTID</code>,  then for machines that have non-default slot names, the result would appear random. Even worse, all dynamic slots have the same <code>SLOTID</code> as their partitionable slot.  only the slot name can be used to distinguish them.\n\n</p><p>I think a lot of other things would have to change about the condor_status display in order for it to make sense to have <code>SlotID</code> be a sort key.\n\n</p><p></p><hr/>\n<em>2013-Jul-25 09:51:25 by pfc:</em> <br/>\n\nWe might be talking past each other: all I'm suggesting is that Name, by virtue of being a composite value of two other attributes (of differing types), is a nonsensical sort key, and that sorting by its two constituent attributes makes more sense.  This means sorting by the exact same data in the exact same order, ultimately -- the question is whether you type-convert and smash them together first and then sort by a single type, or sort them independently by their native types before smashing them together into Name.  To deal with dynamic slots you just sort by Name <strong>after</strong> <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=SlotId\" title=\"Slot Id\">SlotId</a></span> and there's no issue.\n\n<p>Anyway, I'll make you a deal... ;)  We'll poll the crowd next Condor Week and if over 90% of those voting think sorting by Arch, Opsys, Machine, Slotid, Name makes more sense than sorting by Arch, Opsys, Machine, Name (where name is by default the numeric slotid jammed together with the alphanumeric machine), then you agree to implement the fix right after Condor Week.  If &lt;=90% agree, I'll buy you a case of beer.\n\n</p><p>I'll sweeten the deal -- we'll also poll the crowd to see how many people have their pool configured with  non-default slot names such that it would affect the sort order above, and if more than one person raises their hand I lose, regardless of the results of other poll. :)\n\n</p><p>Deal?</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2015-Sep-21 11:53", "status": "defer", "created": "2013-Jul-24 14:11", "fixed_version": "2013-Jul-24 14:11", "broken_version": "v080001", "priority": "5", "subsystem": "Tools", "assigned_to": "johnkn", "derived_from": "", "creator": "pfc", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "pfcouvar@syr.edu,pcouvare@caltech.edu", "due_date": ""}