{"id": 383, "title": "Ticket #383: Green Computing", "description": "<blockquote>\nThe Green Computing enhance activity involves adding smarts into Condor regarding power management features provided by modern operating systems.\n\n<p>Development time on Green Computing will occur each week all day Wednesday and Thursday. Developers will meet briefly at the beginning of each of these days for any needed synchronization. Developers on Green Computing include:\n\n</p><p></p><ul>\n<li>Ben Burnett\n</li><li>Nick <span class=\"quote\">LeRoy</span>\n</li></ul>\n\n<p>Some initial Green Computing work has been pushed to the master branch of the central Condor git repository. Further work will occur on the branch V7_3-green-branch before being merged for Condor 7.3.\n\n</p><p>We are limiting our implementation efforts (at least for now) to Linux and Windows.\n\n</p><p><span class=\"subsection\"></span></p><h3>Milestones </h3>\n\n<p>The following list gives a description of each milestone for Green Computing, including where progress toward the milestone currently stands (if there's been any progress).\n\n</p><p>Milestones 1 - 4 are essential for the most basic functionality. Further milestones will be worked on as time allows.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>1. SLEEP Expression [done]</h4>\n\n<p>The StartD will be given a new policy expression that, when evaluated to TRUE, will result in the machine hosting the StartD being put into a low-power state. The machine will stay this way until woken up via some external mechanism.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>2. Wake-Up Requirements [done]</h4>\n\n<p>The StartD will add to its slot <span class=\"quote\">ClassAds</span> whatever information is necessary to wake up its host machine once it has been put into a low-power state.\n\n</p><p>For Windows, only the MAC address appears to be needed, and thus the StartD has been modified to advertise it. It is likely that only the MAC will be needed on Linux as well, but this needs to be verified.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>3. Wake-Up Tool [done]</h4>\n\n<p>A tool and/or library will be developed that, given a slot <span class=\"quote\">ClassAds</span> and assuming that its host machine is in a low-power state, will do whatever is necessary to bring the machine back up.\n\n</p><p>Such a tool is complete. The tool is likely going to work on both Windows and Linux.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>4. Collector Support [done]</h4>\n\n<p>The Collector will be modified to allow for <span class=\"quote\">ClassAds</span> it contains to enter an \"off-line\" state. An off-line <span class=\"quote\">ClassAds</span> is one that logically exists, but whatever entity is responsible for updating the ad is not available to do so. This obviously applies easily to Green Computing, but could also be used for virtual machines or as a simple way of maintaining a roster of machines that should be in a pool.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>5. User Defined Tools Support</h4>\n\n<p>The user should be able to supply tools to change power states, in addition, users should also be allowed to set which power states are supported on a machine.  This is especially important in cases where the methods Condor incorrectly detects the supported power states and/or the tools.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>6. Negotiator Support</h4>\n\n<p>Building on Milestone 4, the Negotiator will be modified to support waking up off-line machines. This ability can, for example, take into account demand for specific types of machines.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>7. Negotiator Support - Continued</h4>\n\n<p>Building on the existing Negotiator Support, this phase will add a number of Class Ad function to help in determining (or ranking) which machines should be woken.  This way, for instance, machines that have recently been hibernated, will not imediatly be turned back on until some other machies that have been hibernating for longer have been worken.  These functions could further help by waking machines that better match the queued jobs, rather than blindly waking enough machines to satisfy the request for slots.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>8. Enhanced SLEEP Expression</h4>\n\n<p>The StartD will be given a new per-slot policy expressions that, when evaluated to TRUE, will execute user defined tools to modify the slot's status. For instance, on a multi-processor machine, if the processors support a speed-step like mechanism, idle slots could be put in a low power state, or individually turned off, if supported.  This would supplement the previous sleep expression, which puts the entire machine to sleep.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Apr-15 10:24:00 by burnett:</em> <br/>\n\nIn order to completely support Green Computing under Condor we need to make some changes to the Collector. At the moment there is only one change we need to concentrate on: a method for updating class-ads with an acknowledgment of the update. This is required so that when a machine's HIBERNATE expression has evaluated to an integer in the range [1..5] (i.e. entering a sleep state), the machine will still be accounted for (via the GC Collector Plug-in). Thus, for now, this method will only apply to StartD ads, but may be used in other areas in the future. <strong>[done]</strong>\n\n<p></p><hr/>\n<em>2009-Apr-15 10:24:28 by burnett:</em> <br/>\n\nAs we saw with the Collector, to completely support Green Computing under Condor we need to make some minor changes to the StartD. For one, we will add a new StartD command, which will make it resume accepting jobs.\n\n<p>Due, in part, to the nature of the hibernation commands on the Windows platform, there is a possibility that a machine entering a state of hibernation may be matched and accept a job in the time window between issuing the hibernation command on the machine and the the machine actually changing states. As such, there is the need to have an additional StartD command that will re-enable job matching, when the machine emerges from its den.\n\n</p><p>Another minor change involves advertising all the attributes required to wake a machine remotely. This includes the machine's network adapter's hardware address (currently this is only advertised for the public IP, even if the machine is listening on all adapters); we also export the subnet mask for the aforementioned IP address; and, finally, the machine's hibernation state: the hibernation state will always be zero while the machine is running, but will be set to the proper level just before the machine enters hibernation. <strong>[done]</strong>\n\n</p><p></p><hr/>\n<em>2009-Jul-14 13:54:11 by adesmet:</em> <br/>\n\nNote from Flightworthy discussion: condor_q's -analyze and -better-analyze options need to learn at least a little about green computing.  Probably a first step is to not include offline machines in the calculations (either filtering in the query to the collector with a constraint, or after the fact.).  A possible second step would be to count the machines excluded and give a generic \"23 machines are offline and were not considered.\"\n\n<p></p><hr/>\n<em>2009-Aug-12 22:15:00 by nleroy:</em> <br/>\n\nThe interface between the startd and the new power program (tentatively named \"power_state\") is simple...  The startd looks for it at \"$(HIBERNATION_PLUG)\", and falls back to \"$(LIBEXEC)/power_state\".\n\n<p>At startup / reconfig, the startd invokes \"power_state ad\"; this program then spits out a <span class=\"quote\">ClassAd</span> to standard out.  The recognized attributes of this ad are:\n</p><ol>\n<li><span class=\"quote\">HibernationMethod</span> <em>optional</em>\n</li><li><span class=\"quote\">HibernationSupportedStates</span> <em>required</em>\n</li><li><span class=\"quote\">HibernationRawMask</span> <em>optional</em>\n</li></ol>\n\n<p>When attempting to put the machine to sleep, the startd invokes the same program, but this time as \"power_state set &lt;state name&gt;\".  This program is responsible for putting the machine into the desired state.\n\n</p><p>New configuration parameters:\n</p><ol>\n<li><span class=\"quote\">HIBERNATION_PLUGIN</span>\n</li><li><span class=\"quote\">HIBERNATION_OVERRIDE_WOL</span></li></ol>\n</blockquote>", "derived_tickets": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=231\" onclick=\"get_ticket_and_populate_wrapper('231'); return false;\" title=\"ioctl(SIOCETHTOOL/GWOL) failed: Operation not permitted in pers condor\">#231</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nioctl(SIOCETHTOOL/GWOL) failed: Operation not permitted in pers condor</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=368\" onclick=\"get_ticket_and_populate_wrapper('368'); return false;\" title=\"Add functionality to the GC code to optionally use a tool to hibernate\">#368</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nAdd functionality to the GC code to optionally use a tool to hibernate</td></tr>\n</tbody></table>", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Aug-14 10:19</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/642d4bd81024077bea7f13e2c0ef08ecf09a21b5\">[24933]</a></span>: Documented <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=383\" onclick=\"get_ticket_and_populate_wrapper('383'); return false;\" title=\"Green Computing\">#383</a></span> in the version history (still working on the rest of the documentation for it)  (By Nick <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LeRoy\" title=\"Le Roy\">LeRoy</a></span> )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Aug-13 15:03</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/7757de06cf3993291026955c1a4b9d56804ab269\">[15317]</a></span>: Removed some unneeded items (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=383\" onclick=\"get_ticket_and_populate_wrapper('383'); return false;\" title=\"Green Computing\">#383</a></span>)  (By Nick <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LeRoy\" title=\"Le Roy\">LeRoy</a></span> )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2009-Aug-13 14:36</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/87de0c140d86d462ef4c1beb4de77aed2ebc3c38\">[15315]</a></span>: (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=383\" onclick=\"get_ticket_and_populate_wrapper('383'); return false;\" title=\"Green Computing\">#383</a></span>) Moved physical hibernation logic from the startd to a self contained program (power_state) in libexec  (By Nick <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=LeRoy\" title=\"Le Roy\">LeRoy</a></span> )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2010-Jan-31 13:40", "status": "resolved", "created": "2009-Apr-15 10:22", "fixed_version": "2009-Apr-15 10:22", "broken_version": "v070300", "priority": "2", "subsystem": "Unknown", "assigned_to": "nleroy", "derived_from": "", "creator": "burnett", "rust": "", "customer_group": "other", "visibility": "public", "notify": "willb@redhat.com,danb@cs.wisc.edu", "due_date": ""}