{"id": 3860, "title": "Ticket #3860: PRIVATE_NETWORK_INTERFACE ignored by stduniv starter", "description": "<blockquote>\nThis prevents dual-homed submit machines that need to talk to both private-network clusters and public-network clients from working correctly.  (Details in the linked rust-admin ticket.)\n\n<p>There is a hacky workaround (also outlined in the RUST ticket) for our current, very specific use-case but I'm not convinced it's going to work for all the cases we will need to support soon, so I think this either needs to be addressed in the old starter before v8.2, we need a better hack, or else DMTCP needs to save the day (<span class=\"ticket\"><a class=\"defer\" href=\"/wiki-archive/tickets/?ticket=3321\" onclick=\"get_ticket_and_populate_wrapper('3321'); return false;\" title=\"make KVM checkpointing user experience like universe=standard\">#3321</a></span>).\n\n</p><p>Since we have a workaround at the moment I'm leaving this as a priority==4 ticket, but it will become priority==2 if/when the current hack doesn't work any more.</p></blockquote>", "remarks": "<blockquote>\n<em>2013-Aug-20 15:11:04 by wenger:</em> <br/>\n\nFixed RUST ticket number...\n\n<p></p><hr/>\n<em>2013-Aug-20 15:43:31 by pfc:</em> <br/>\n\nBackground from the ticket:\n\n<p>We need to configure a schedd on a dual-homed machine such that it can manage standard-universe jobs running on a private network, and yet respond to queries over the public network.  Our desired configuration is as follows:\n\n</p><p>spice001: Private Network Cluster Node\n</p><div class=\"code\">\n<pre class=\"code\">eth0 10.20.3.1\nNETWORK_INTERFACE=eth0\nPRIVATE_NETWORK_INTERFACE=eth0\nPRIVATE_NETWORK_NAME=sugar\n</pre></div>\n\nsugar-dev2: Dual-Homed Submit Machine\n<div class=\"code\">\n<pre class=\"code\">eth0 10.20.5.33\neth1 128.230.146.15\nNETWORK_INTERFACE=eth1\nPRIVATE_NETWORK_INTERFACE=eth0\nPRIVATE_NETWORK_NAME=sugar\n</pre></div>\n\nits-condor-submit: External Querier\n<div class=\"code\">\n<pre class=\"code\">eth0: 128.230.171.183\nNETWORK_INTERFACE=eth0\n</pre></div>\n\n\n<p>With this configuration, the external querier (its-condor-submit) can successfully query the schedd (sugar-dev2) via \"condor_q -name\", however standard-universe jobs submitted from the schedd (sugar-dev2) fail to successfully run on our cluster nodes (e.g, spice001) because the stduniv starter doesn't observe PRIVATE_NETWORK_INTERFACE and tries to contact sugar-dev2 over its NETWORK_INTERFACE, which isn't valid.\n\n</p><p>The only configuration which allows stduniv jobs submitted from sugar-dev2 to successfully run on spice001 is where sugar-dev2's NETWORK_INTERFACE is eth0 (the private network) -- which prevents its-condor-submit from being able to contact it.\n\n</p><p>However, after thinking this through, and much destructive experimentation (oh, the users I've hosed tonight), I discovered an ungodly hack that allows this to work.\n\n</p><p>Instead of this desired configuration on our dual-homed schedds, which doesn't work:\n</p><div class=\"code\">\n<pre class=\"code\">NETWORK_INTERFACE = 128.230.146.15\nPRIVATE_NETWORK_INTERFACE = 10.20.5.33\nPRIVATE_NETWORK_NAME = sugar\n</pre></div>\n\n…we can use this bizarro-configuration, which does work:\n<div class=\"code\">\n<pre class=\"code\">NETWORK_INTERFACE = 10.20.5.33\nPRIVATE_NETWORK_INTERFACE = 128.230.146.15\nPRIVATE_NETWORK_NAME = public\n</pre></div>\n\n\n<p>Caveat: this work ONLY if the external public network clients which wish to query our schedd set their PRIVATE_NETWORK_NAME=public, like so:\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">% _CONDOR_PRIVATE_NETWORK_NAME=public condor_q -pool condor.phy.syr.edu -name sugar-dev3.phy.syr.edu\n</pre></div>\n\n\n<p>The reason this works is that a matching PRIVATE_NETWORK_NAME tells the external public network clients to route over the public IP, while the private-network NETWORK_INTERFACE allows the brain-dead standard-universe starter to do the right thing and try to contact the schedd over the private network.\n\n</p><p>NOTE: This also ONLY works if our dual-homed central manager is changed to have \"NETWORK_INTERFACE = *\".  For reasons I don't understand, if the central manager has the same bizarro configuration as the schedds, no one can talk to it.  Why?\n\n</p><p></p><hr/>\n<em>2013-Sep-03 15:22:38 by tlmiller:</em> <br/>\n\nIf by \"central manager\" you meant \"collector\", remember that HTCondor must use the resolved DNS name or IP literal from the configuration file to contact the collector -- the private network information isn't available.\n\n<p>If you meant the negotiator, I don't know, but I'd check BIND_ALL_INTERFACES.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2013-Sep-03 15:22", "status": "defer", "created": "2013-Aug-19 16:27", "fixed_version": "2013-Aug-19 16:27", "broken_version": "v080001", "priority": "5", "subsystem": "DaemonsExecNode", "assigned_to": "", "derived_from": "", "creator": "pfc", "rust": "a25917", "customer_group": "ligo", "visibility": "public", "notify": "pfcouvar@syr.edu,pcouvare@caltech.edu", "due_date": ""}