{"id": 3905, "title": "Ticket #3905: stduniv jobs with want_remote_io=false still do remote i/o sometimes", "description": "<blockquote>\nShort story: even if WantRemoteIO=false, Condor falls back to remote i/o when a local-to-the-job file operation fails, instead of propagating the failure.\n\n<p>Long story:\n\n</p><p>We have condor configured correctly to inhibit remote i/o for standard-universe jobs (including matching UID_DOMAIN and FILESYSTEM_DOMAIN on the submit and execute side, USE_NFS=true, want_remote_io=false in the submit file, etc.).\n\n</p><p>The precipitating external-to-Condor problem was that on a large subset of our pool a certain NFS server was denying mount permission to a directory needed by the jobs.  So on most of our nodes, the jobs successfully opened the files it needed locally.\n\n</p><p>However, on the bad subset of nodes, the open()s failed -- and apparently in that case, Condor helpfully (?) tries remote i/o as a fallback instead of failing.\n\n</p><p>At least in our case, this was unexpected and undesired given our want_remote_io=false directive, and led to thousands of jobs /appearing/ to run, but indefinitely consuming zero CPU while simultaneously blocked on i/o through the submit machine.\n\n</p><p>I suspect this will understandably get chalked up as \"won't fix because DMTCP is coming to save the day\", but I'm becoming more and more worried that the DMTCP hero has not yet arrived...</p></blockquote>", "remarks": "<blockquote>\n<em>2018-Mar-01 14:32:09 by tlmiller:</em> <br/>\n\nStandard universe has been in maintenance-only mode for some time, abandoning.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2018-Mar-01 14:37", "status": "abandoned", "created": "2013-Sep-10 15:58", "fixed_version": "2013-Sep-10 15:58", "broken_version": "v080002", "priority": "4", "subsystem": "Std", "assigned_to": "tlmiller", "derived_from": "", "creator": "pfc", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": ",pcouvare@caltech.edu", "due_date": ""}