{"id": 3961, "title": "Ticket #3961: VM universe should support an exit status code", "description": "<blockquote>\nConstruct some well-known mechanism which would allow a VM universe job to provide an exit status.  This exit status should become the job's <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ExitStatus\" title=\"Exit Status\">ExitStatus</a></span> (and ExitBySignal/ExitCode/ExitSignal), and as such, reflected (recorded?) in the job ad.</blockquote>", "remarks": "<blockquote>\n<em>2013-Oct-04 14:48:22 by cat:</em> <br/>\n\nTodd Miller and I discussed a user interface for this feature. The basic idea is to introduce a new command on all VM-universe execute nodes and have it be responsible for setting up the magic on the VM guest to communicate back an exit status code.\n\n<p>Usage: condor_vm_exit EXITCODE\n\n</p><p>This command accepts a single integer exit code, intended to parallel Linux shell exit codes but really just an integer value that is open to interpretation. HTCondor validates the argument and arranges for it to be set in the job classad in the <span class=\"quote\">ExitCode</span> attribute; if the argument is missing or not valid, the job <span class=\"quote\">ExitCode</span> is set to 0; extra arguments are silently ignored.\n\n</p><p>At this time, we do not have a clear proposal for how this command will be implemented, but hey.\n\n</p><p>(For future reference: We purposefully left the name of the command slightly generic. Someday, we may decide to extend the command to shut down the VM guest properly. However, this is hard to get right (highly system dependent) and not terribly high value (once we have documented the proper shutdown command per platform, it is easy to copy and use), so we decided to focus on getting totally right the first use case of condor_vm_exit.)</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2013-Oct-04 14:48", "status": "new", "created": "2013-Oct-02 15:32", "fixed_version": "2013-Oct-02 15:32", "broken_version": "", "priority": "4", "subsystem": "VM", "assigned_to": "", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "cat@cs.wisc.edu, tlmiller@cs.wisc.edu", "due_date": ""}