{"id": 3974, "title": "Ticket #3974: EC2 jobs don't notice new X.509 authentication tokens.", "description": "<blockquote>\nFermi is seeing a problem where they refresh their X.509 user proxies, but the new proxies aren't used until they restart HTCondor.  This is different from the usual for grid universe.</blockquote>", "remarks": "<blockquote>\n<em>2013-Oct-08 18:31:21 by tlmiller:</em> <br/>\n\nThis appears to be a bug in libcurl; it seems to get different results for the same file contents (and presence/absence) depending on if the EC2 GAHP was restarted after the change.\n\n<p>For instance, I submit an EC2 job to Amazon to keep the EC2 GAHP alive.  I then submit an x509 job which goes on hold because Amazon doesn't like my grid proxy.  (This should happen.)  I then remove the contents of the proxy and submit a second x509 job, identical to the first.  It fails in the same way -- which it shouldn't -- and I kill the GAHP.  I force the GAHP (and the grid manager) to restart by submitting another EC2 job.  I then submit another x509 job.  That job fails with an error in CURL (problem with local certificate), before it gets to Amazon.  Releasing the held jobs from before causes them to fail like the new job.  Replacing the cert and submitting a new job doesn't change the error message.  Oddly enough, putting all the jobs on hold does.  Further investigation is required.\n\n</p><p>I don't think this has anything to do with the grid manager or EC2 GAHP code directly -- we don't even read the X.509 keys, much less cache them.\n\n</p><p></p><hr/>\n<em>2013-Oct-09 14:42:57 by tlmiller:</em> <br/>\n\nFurther review reveals a different potential problem: if a resource suffers an authorization failure, new jobs for that resource will automatically go on hold until the GRIDMANAGER_EMPTY_RESOURCE_DELAY seconds pass without any (active) jobs in the queue or the EC2 GAHP is restarted.\n\n<p>Parag, when you see this problem occurring, what does the HTCondor queue look like?\n\n</p><p>If it's full of held jobs, I'd like you to try setting GRIDMANAGER_EMPTY_RESOURCE_DELAY to 0 in your config file.  Then any new or released job should cause a new attempt to contact the service, which should use the new proxy.\n\n</p><p></p><hr/>\n<em>2013-Oct-09 14:44:14 by tlmiller:</em> <br/>\n\nI also wasn't able to reproduce this problem in a simple test case that should have revealed if libcurl was caching auth tokens.  The code paths aren't identical, but I'd like to get a better test case using HTCondor before proceeding now.\n\n<p></p><hr/>\n<em>2013-Oct-09 16:26:50 by tlmiller:</em> <br/>\n\nNotes on testing --\n\n<p>I have a job running on Amazon using an <a class=\"external\" href=\"https://\">https://</a> URL and normal authentication tokens; this keeps the EC2 GAHP alive.\n\n</p><p>I submit a job with a valid (but expired) X.509 proxy; because Amazon doesn't do that sort of thing, it replies with an error that the EC2 protocol level authentication is wrong, and the job goes on hold.  I then delete the contents of the proxy.  I have GRIDMANAGER_EMPTY_RESOURCE_DELAY set 0, so I can immediately submit a new copy of the same job.  This one dies because CURL doesn't like empty files as X.509 proxies.  So far, so good.  I put the second job on hold.  I copy the proxy back into the file and submit a third job -- which dies like the second job, not the first.  Short of restarting the EC2 GAHP, I haven't been able to get a job submitted after the second one to get the first one's error again.  (I have verified that I can get multiple first-job errors if I don't change the proxy.)\n\n</p><p></p><hr/>\n<em>2013-Oct-16 14:29:49 by tlmiller:</em> <br/>\n\nThis problem occurs in the simple test case, but only if you test with three requests (first one with real proxy, second with empty proxy, third with real proxy).  strace verifies that open() and read() are being called appropriately.  I wasn't able to track down the problem, but retesting with libcurl 7.33.0 seems to solve it.  I'm going to recommend Parag try using a newer version of libcurl while I start getting my changeset into shape.\n\n<p></p><hr/>\n<em>2014-Jan-09 13:45:03 by tlmiller:</em> <br/>\n\nParag writes:\n\n<p></p><div class=\"blockquote\">\n<table width=\"95%\"><tbody><tr><td> </td><td>\n  Good news! I switched to new curl 7.33.0 and now updates to the credentials are picked up correctly.</td></tr></tbody></table></div>\n\n\n<p></p><hr/>\n<em>2014-Jan-15 10:18:23 by tlmiller:</em> <br/>\n\nConfirmed with Parag that other system updates (probably to OpenSSL, although it's unclear) since 2013-10-16 resolve the problem without requiring a libcurl upgrade.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2014-Jan-15 10:19", "status": "resolved", "created": "2013-Oct-08 18:07", "fixed_version": "2013-Oct-08 18:07", "broken_version": "", "priority": "4", "subsystem": "Grid", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "fermi", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, parag@fnal.gov", "due_date": ""}