{"id": 3988, "title": "Ticket #3988: Support OpenNebula's \"unknown\" state.", "description": "<blockquote>\nParag Mhashilkar writes:\n\n<p></p><pre>  Glideinwms shutdown the VM from within the VM itself as a matter\n  of cleanup when there is no work to be done for a while. When this happens\n  in the VM launched by OpenNebula, OpenNebula puts the VM in the unknown\n  state. Condor sees this state and thinks that the VM is done and puts the VM\n  job in complete state. What we want is for condor to recognize this state\n  and to explicitly issue a terminate on that VM if the vm stays in unknown\n  state for a while. Or a solution on similar grounds so that the vms are not\n  forgotten.\n</pre>\n\n<p>...\n\n</p><p></p><pre>  Unknown state is a tricker business. From what I understand, if openenbula\n  cannot get any info about he vm from the libvirtd, it puts the vm in unknown\n  state. So the problem could be transient. However in our case, its almost\n  always a vm shutdown from within the vm. I have also mentioned this issue on\n  the opennebula mailing list that openebula should be able to get more info\n  from the libvirt and put the vm in stopped state rather than unknown. Said\n  that even if we get any fixes from openenbula, it will be a while and till\n  then we have to manually (or rather cron) remove these vms periodically to\n  free up the resource.\n</pre>\n\n<p>...\n\n</p><p></p><pre>  Terminate (on stop or unknown) is indeed what we want. Since unknown could\n  mean many things, will it be possible for htcondor to try few times before\n  issuing a terminate? Also, if and when opennebula gives more concrete info\n  on vm status, we may also have to take those changes into account.</pre>\n</blockquote>", "remarks": "<blockquote>\n<em>2013-Oct-18 10:20:06 by tlmiller:</em> <br/>\n\nParag's logs don't include the \"unknown\" state.  Replied seeking more information.\n\n<p></p><hr/>\n<em>2014-Jan-09 13:45:43 by tlmiller:</em> <br/>\n\nParag will look into this further; the \"unknown\" state was being reported by OpenNebula's tools, not its EC2 interface.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2014-Aug-04 13:12", "status": "abandoned", "created": "2013-Oct-16 10:13", "fixed_version": "2013-Oct-16 10:13", "broken_version": "", "priority": "4", "subsystem": "Grid", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "fermi", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, parag@fnal.gov", "due_date": ""}