{"id": 3995, "title": "Ticket #3995: Condor_rm'ed DAGMan waits for node jobs to exit", "description": "<blockquote>\nIt might be a good idea for a condor_rm'ed condor_dagman job to not exit until all of its child jobs have exited.  We could do this by putting DAGMan into halt mode (in a non-reversible way, rather than with the halt file), and then condor_rm'ing the node jobs.\n\n<p>I guess one question is whether there should be a way to force DAGMan to bypass this mode.</p></blockquote>", "remarks": "<blockquote>\n<em>2014-Oct-30 10:16:04 by wenger:</em> <br/>\n\nNote that if we do this, and we have implemented the quick-and-dirty fix for <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4686\" onclick=\"get_ticket_and_populate_wrapper('4686'); return false;\" title=\"DAGMan node status file incorrect on remove\">#4686</a></span>, we should undo that fix...\n\n<p></p><hr/>\n<em>2014-Oct-30 10:27:56 by bbockelm:</em> <br/>\n\nSome thoughts on this:\n\n<p></p><ul>\n<li>We would need to tell the DAGMan process how much time it should wait.  Would this be appropriate for the DAGMan config?\n</li><li>We can always use SIGUSR2 for \"immediate vacate\", right?\n</li><li>I'd also have the semantics to be that, if DAGMan returns before all jobs exit (i.e., the timeout hits), it writes out node_status with as accurate information as possible.  If the schedd removes the jobs 1 ms after DAGMan exits (invalidating the node status), that's fine - the node_status file includes the timestamp of when it was written out and the user needs to understand things happen afterward.\n</li></ul>\n\n<p></p><hr/>\n<em>2014-Oct-30 15:27:31 by wenger:</em> <br/>\n\nThis should also apply in the case of an ABORT-DAG-ON firing, and other cases where node jobs get removed.\n\n<p></p><hr/>\n<em>2015-Jan-25 19:16:15 by wenger:</em> <br/>\n\nHmm -- just thinking about this, I think we'd be at least pretty close to what we want if we go into halt mode when we get the signal because of condor_rm.  (We'd have to make sure that we <strong>stayed</strong> halted, not looking for the halt file...)</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Jan-25 19:16", "status": "new", "created": "2013-Oct-18 14:13", "fixed_version": "2013-Oct-18 14:13", "broken_version": "v080102", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "#3278", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}