{"id": 4298, "title": "Ticket #4298: Move stuff out of DAGMan Job object", "description": "<blockquote>\nTo do some of the stuff Brian is requesting for <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4115\" onclick=\"get_ticket_and_populate_wrapper('4115'); return false;\" title=\"Enhance DAGMan's node status file\">#4115</a></span>, we'll need to keep quite a bit more information associated with each node (Job object).  For example, each proc ID for multi-proc nodes, counts of job procs running, idle, etc.  But at least most of that stuff we only care about while the node is queued -- once the node has finished we can probably forget about it.\n\n<p>When I was thinking about this, it also occurred to me that we probably already have some information in the Job object that falls into this category.  For example, CondorID -- I don't think we need that after the node is finished, unless maybe it failed, for the error message.  Submit tries probably falls into this category, and maybe even node retries.\n\n</p><p>So I'm proposing that we should create a new object that contains all of this temporary information, and just instantiate the object when the jobs for a node are submitted, and then delete the object after the node has finished.\n\n</p><p>I just did a quick look through the Job object, and I think there's quite a bit there that we only care about while the node/job is in the queue, so this might give us a pretty good saving of memory for large DAGs.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2017-May-16 11:28", "status": "new", "created": "2014-Apr-04 10:55", "fixed_version": "2014-Apr-04 10:55", "broken_version": "v080105", "priority": "3", "subsystem": "Dag", "assigned_to": "", "derived_from": "#4115", "creator": "wenger", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "wenger@cs.wisc.edu, tannenba@cs.wisc.edu,bbockelm@cse.unl.edu", "due_date": ""}