{"id": 430, "title": "Ticket #430: condor_q -addr always contacts the collector", "description": "<blockquote>\ncondor_q can take an -addr argument and a sinful string, but it will never be used to contact the schedd. condor_q will always consult the collector to find the schedd. this may be an issue for other tools with -addr too.\n\n<p>It is believed that condor_submit does the same thing, and condor_rm may as well.  These should be investigated before closing this ticket.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Sep-28 15:06:48 by tstclair:</em> <br/>\n\nFrom what I gather when I trace backwards it appears to add a constraint to the collector query, where the constraint is the IP:PORT of the schedd.  From testing, the output doesn't differ if you specify one schedd versus another.  Input path will be eliminated, but I'm still determining if other tools have this behaviour.\n\n<p></p><hr/>\n<em>2009-Sep-29 09:17:48 by tstclair:</em> <br/>\n\nIt should also be noted that it was an undocumented input parameter.  From what I have scanned all other tools have a -addr / -address documented as an input param.\n\n<p></p><hr/>\n<em>2009-Oct-2 by tstclair:</em> <br/>\n\nWill be updated for 7.4.x we may need to create a branch prior to that.\n\n<p></p><hr/>\n<em>2009-Sep-29 12:21:42 by tstclair:</em> <br/>\n\nAlan and I performed another test and had seen the results differ.  It may have been because I'm using NMI for my testing.  comparing s006 vs. s005, but it appears that -addr does \"do\" the correct thing.\n\n<p></p><hr/>\n<em>2009-Sep-29 14:04:47 by adesmet:</em> <br/>\n\nCurrent assessment: the code as it stands appears to work.  It's undocumented, and it does something different from -addr in other command line tools (it still uses the collector, it just queries for the sinful string).\n\n<p>Option 1: <strong>Rip it out.</strong> It's confusing, undocumented garbage.  Rip it out (that's the patch below).\n\n</p><p>Option 2: <strong>Leave it be.</strong> It works (for some definitions of work).  Some users might be relying on it.  Leave it be.  Possibly in the future fix it to work correctly (directly contact the sinful address, don't ask the collector) and document then.\n\n</p><p>Option 3: <strong>Fix it</strong> to work correctly (directly contact the sinful address, don't ask the collector) and document it.\n\n</p><p>Option 3 is ideal in my mind, but we're too close to release to \"fix\" a feature that doesn't officially exist.\n\n</p><p>Given that, I prefer option 2, but I'm open to other thoughts.  If Tim can reproduce the bug and it actually doesn't work consistently it's more of a problem than a hidden feature and I become a strong advocate for option 1.\n\n</p><p></p><hr/>\n<em>2009-Sep-29 15:29:58 by tannenba:</em> <br/>\n\npatch below 430.txt is not what we want... if -addr is specified, then we want to use it exactly as given and NOT involve the collector at all.\n\n<p></p><hr/>\n<em>2009-Sep-29 16:18:44 by adesmet:</em> <br/>\n\nNote: as the moment condor_q supports multiple -addr arguments and you can mix them with -name arguments.  The output is the set of all schedds name.  If -addr is made \"smart\" to avoid going to the collector, this behavior should ideally be preserved.\n\n<p></p><hr/>\n<em>2009-Sep-30 07:52:40 by tstclair:</em> <br/>\n\nI agree with Alan's assessment, is there a consensus on the options provided.\n\n<p></p><hr/>\n<em>2009-Sep-30 08:51:14 by matt:</em> <br/>\n\nOption 3 is the solution, if it can't make 7.4.0 then it should make 7.4.1 and we'll carry it in the interim.\n\n<p>I consider confusing argument behavior a usability bug can fair game for a stable series.\n</p><hr/>\n<em>2010-Oct-27 16:39:01 by adesmet:</em> <br/>\n\nBulk change of target version from v070404 to v070405 using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/100/430.txt\">430.txt</a>\n1122 bytes added by tstclair on 2009-Sep-28 21:26:29 UTC.\n<br/>\nPatch for 430 for review<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "defect", "last_change": "2010-Oct-27 16:39", "status": "stalled", "created": "2009-Apr-29 12:08", "fixed_version": "2009-Apr-29 12:08", "broken_version": "v070300", "priority": "3", "subsystem": "Tools", "assigned_to": "tstclair", "derived_from": "", "creator": "matt", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}