{"id": 4373, "title": "Ticket #4373: Upload HTCondor Week 2014 tutorials (and some talks) to web site", "description": "<blockquote>\nThe tutorials and some talks for HTCondor Week 2014 should be posted online.  Ideally they would be available for download and for streaming.  Don't post anything by someone not on HTCondor staff without getting clear permission from them.  At the moment there are <em>no</em> non-HTCondor staff talks we plan on posting.\n\n<p>Work: Some of these steps may be merged together\n</p><ol>\n<li>Check with speakers to ensure they think it's a good idea to post them.  There is a strong bias in favor of posting them!  This has been done for User, DAGMan and Admin tutorials, which are the most important three.\n</li><li>Decide between the mp4 files and wmv files as a source.  Consider quality, legibility of the slides, and space wasted on letterboxing/pillarboxing.  Might want to use mp4 for the speaker and wmv for the slides.\n</li><li>Split files that contain multiple tutorials into individual files.\n</li><li>Trim \"dead time\" (time when we have recordings before or after the tutorial). In some cases we've just got video of a basically empty room. In others, we've got video of the word \"RECORDING.\"  In the case of the User and DAGMan tutorials, there is people loitering and and getting set up.\n</li><li>Cropping to remove pillar-boxing/letter-boxing/etc\n</li><li>Cropping to remove useless space around the speaker. Most important for the User and DAGMan tutorials, as there there are audience members nearby, and their motion is distracting.  The User tutorial's speaker is confirmed to stay to a fairly small area; other speakers may wander around, either requiring a bigger crop space, or tracking them through the video.\n</li><li>Add a nice title page; it might be as simple as the first slide of the talk. You can get HTCondor logos at <a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/logos/htcondor_logos/\">http://research.cs.wisc.edu/htcondor/logos/htcondor_logos/</a>\n</li><li>If the video of the slides is poor, consider taking stills from the original slides (<a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/HTCondorWeek2014/monday.html\">http://research.cs.wisc.edu/htcondor/HTCondorWeek2014/monday.html</a> ) and manually adding them. The User and DAGMan tutorials would really like this, as the video quality if very poor. This won't work if there are animations (Admin tutorial), although it could work if you're willing to make a screencast and burn a lot of time.\n</li><li>Arrange resulting video in a reasonably common size; failing that a common aspect ratio; failing that just don't make it too crazy.\n</li><li>Transcode into H.264(baseline)+AAC(low complexity)+MP4 and WebM. If necessary, offer both in a low-resolution version. (See <span class=\"wiki\"><a href=\"wiki?p=HostingVideo\" title=\"Hosting Video\">HostingVideo</a></span>)\n</li><li>Set up for download (See <span class=\"wiki\"><a href=\"wiki?p=HostingVideo\" title=\"Hosting Video\">HostingVideo</a></span>)\n</li><li>Set up for streaming. (See <span class=\"wiki\"><a href=\"wiki?p=HostingVideo\" title=\"Hosting Video\">HostingVideo</a></span>)\n</li><li>Ensure links to slides are adjacent to the videos.\n</li><li>Archive the final video files to DVD and get them to Alan.\n</li></ol>\n\n<p>Alan has the raw videos on puffin.cs.wisc.edu:/scratch/adesmet/htcondor-week-2014-videos/ and on DVD (check the \"MISC\" box in Alan's office). The file names are the date and timestamp of when that \"block\" of video was supposed to start; you can determine which talks are in which files by comparing it to <a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/HTCondorWeek2014/monday.html\">http://research.cs.wisc.edu/htcondor/HTCondorWeek2014/monday.html</a>\n\n</p><p>Videos we probably want to post:\n\n</p><p></p><ul>\n<li>The essentials:\n\n<p></p><ul>\n<li><strong>DONE</strong> An Introduction to Using HTCondor, Karen Miller - Was rerecorded later as HTCondor Week 2014 version wasn't recorded. - Confirmed okay to post. - Early work suggests it should probably start at 0:11:52 and probably runs for 0:69:15 (so ending at 1:20:07)\n\n<p></p></li><li><strong>DONE</strong> Introduction to Workflows with DAGMan, Ken Wenger - Was rerecorded later as HTCondor Week 2014 version wasn't recorded. - Confirmed okay to post.\n\n<p></p></li><li><strong>DONE</strong> Advanced Workflows with DAGMan, Kent Wenger - Confirmed okay to post - ./Disc 6/2014-04-30-14-55.*\n\n<p></p></li><li><strong>DONE</strong> Administrating HTCondor, Alan De Smet - Confirmed okay to post. - Disc 1/2014-04-28-10-50-admin.*\n</li></ul>\n\n<p></p></li><li>Would be nice:\n\n<p></p><ul>\n<li><strong>DONE</strong> Python and HTCondor, Tim Theisen - Disc 5/2014-04-30-13-40-resources.* roughly 0:16:20, interrupted and continues in /Disc 5/2014-04-30-13-55-python.* roughly 0:15:57.  Don't know how much we lost; need to assess. If it's non-trivial, consider it a lost cause. - Confirmed permission\n\n<p></p></li><li><strong>DONE</strong> Monitoring HTCondor with Ganglia, Tim Theisen - Disc 5/2014-04-30-13-10-ganglia.* roughly 0:06:00 - Confirmed permission\n\n<p></p></li><li><strong>DONE</strong> Communicating with Users about HTCondor and High Throughput Computing, Lauren Michael - Disc 4/2014-04-30-09-00.mp4 and Disc 5/2014-04-30-09-00.wmv starting about 0:59:55 - Confirmed permission\n\n<p></p></li><li><strong>DONE</strong> Managing GPUs as a custom resource with condor_gpu_discovery, John (TJ) Knoeller - Disc 5/2014-04-30-13-10-ganglia.* roughly 0:34:00, is truncated and continues in Disc 5/2014-04-30-13-40-resources.* at start - This video starts a minute or two late; we don't have the missing video. Assess, if non-trivial amount is missing, consider it a lost cause. - Confirmed permission\n\n<p></p></li><li><strong>DONE</strong> Securing a Basic HTCondor Pool, Zach Miller - ./Disc 6/2014-04-30-14-55.* starting roughly 0:51:00 - Confirmed permission\n</li></ul>\n\n<p></p></li><li>Bonus:\n\n<p></p><ul>\n<li>How High Throughput was My Cluster?, Greg Thain - Disc 1/2014-04-28-13-00.* starting roughly 1:37:06\n\n<p></p></li><li>HTCondor networking: present and future, Alan De Smet\n\n<p></p></li><li>Improvements to Configuration, John (TJ) Knoeller - Confirmed permission\n\n<p></p></li><li>Releasing HTCondor: Upstream, downstream, and more, Tim Theisen - Confirmed permission\n</li></ul>\n</li></ul>\n\n<p>See the attached images (bottom of ticket) for some possibilities for layout.  These are based on the user tutorial.</p></blockquote>", "remarks": "<blockquote>\n<em>2014-Nov-05 15:38:13 by adesmet:</em> <br/>\n\nAll the essential work and a bunch of the bonus work is done. Deeming done and closing.\n\n<p></p><hr/>\n<em>2014-Nov-05 15:46:29 by adesmet:</em> <br/>\n\nThe videos are at <a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/tutorials/videos/2014/\">http://research.cs.wisc.edu/htcondor/tutorials/videos/2014/</a></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/849/user-tutorial-example-1.jpg\">user-tutorial-example-1.jpg</a>\n20628 bytes added by adesmet on 2014-Oct-20 20:12:55 UTC.\n<br/>\nExample arrangement of videos. This one crops both the slides and the speaker pretty aggressively and preserves both in their native resolutions. The result is a weird size and aspect ratio, but very \"true\" to the source material we have.<br/>\n</li><li><a href=\"../files/850/user-tutorial-example-2.jpg\">user-tutorial-example-2.jpg</a>\n51334 bytes added by adesmet on 2014-Oct-20 20:14:39 UTC.\n<br/>\nExample arrangement of videos. This one crops both the slides and the speaker pretty aggressively.  Shows a way to fully fill a 16:9 aspect ratio. Native resolutions have been discarded, and the result is 720p. Probably wasteful.<br/>\n</li></ul>\n</blockquote></body></html>", "check_ins": "", "type": "todo", "last_change": "2015-Jan-23 12:29", "status": "resolved", "created": "2014-May-22 13:10", "fixed_version": "2014-May-22 13:10", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "calderon", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}