{"id": 44, "title": "Ticket #44: Condor KRB support with Active Directory", "description": "<blockquote>\nCondor uses MIT Kerberos. Theoretically, Condor should also work when Windows Active Directory is being used as the KDC. It is not known whether this works in practice, though. We need to figure out and document Condor's support for Kerberos authentication within a Windows Server domain.</blockquote>", "remarks": "<blockquote>\n<em>2009-Jan-20 13:44:58 by gquinn:</em> <br/>\n\nI am working on this with Liam Gretton, who has reported his experiences trying to get Condor to work in his AD environment on condor-users:\n\n<p><a class=\"external\" href=\"https://lists.cs.wisc.edu/archive/condor-users/2008-December/msg00097.shtml\">https://lists.cs.wisc.edu/archive/condor-users/2008-December/msg00097.shtml</a>\n\n</p><p>He has managed to get his Linux machines to work by generating a keytab file for each Linux host, which can be done using KTPASS.EXE from the Domain Controller. I suspect that he could do the same for Windows hosts as well, and have requested him to try this out. Liam has requested that we augment our Kerberos support on Windows so that no keytab is needed. Instead, we could interface with the LSA which manages the Kerberos ticket cache.\n\n</p><p></p><hr/>\n<em>2009-Apr-16 10:33:36 by burnett:</em> <br/>\n\nCondor's Windows credential management subsystem will be improved to avoid dealing with user passwords when possible, such as when security infrastructures like Kerberos or PKI are in place.\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 14:49", "status": "new", "created": "2009-Jan-20 13:39", "fixed_version": "2009-Jan-20 13:39", "broken_version": "", "priority": "4", "subsystem": "Security", "assigned_to": "", "derived_from": "", "creator": "gquinn", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}