{"id": 4495, "title": "Ticket #4495: IPv6: mixed-mode central manager", "description": "<blockquote>\n(This is very early notes!)\n\n<p><span class=\"section\"></span></p><h2>Goal </h2>\n\n<p>Support mixed pools where some nodes speak IPv4 only and some nodes speak IPv6 only.  Matchmaking must avoid matches where the two hosts cannot communicate because one is IPv4 only and the other is IPv6 only.\n\n</p><p><span class=\"section\"></span></p><h2>Acceptable Limitations</h2>\n\n<p>The project can be considered complete even if the final work includes these limitations. Later projects may remove limitations. It is likely that some limitations will prove to be unnecessary.\n\n</p><p></p><ul>\n<li>The condor_collector and condor_negotiator must be able to receive and establish connections over both IPv6 and IPv4.\n</li><li>Other daemons will not support IPv6 and IPv4 simultaneously.\n</li><li>Non-central manager nodes will not support IPv6 and IPv4 simultaneously.\n</li><li>If IPv6 is enabled for a given daemon, that daemon can only listen to a single IPv6 address and a single IPv4 address.\n</li><li>Only the vanilla universe is supported.\n</li><li>NETWORK_INTERFACE only supports a single address, IPv4 or IPv6.\n</li><li>Private and link local addresses are not supported.\n</li><li>A node configured for IPv4 or IPv6 only cannot communicate with a node only using the other protocol.\n</li><li>Versions of HTCondor post-mixed-mode cannot communicate with pre-mixed-mode versions.\n</li><li>CCB cannot act as a tunnel between IPv4 and IPv6.\n</li><li>There is a one-to-one mapping between a daemon (or other running process) and contact information for it. This contact information will have a unique serialization suitable for passing between processes and a unique internal data structure.\n</li><li>All nodes must have a working IPv4 loopback at 127.0.0.1. This includes nodes otherwise configured to exclusively use IPv6.\n</li><li><span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=PrivAddr\" title=\"Priv Addr\">PrivAddr</a></span> only supports a single address, IPv4 or IPv6.</li></ul>\n</blockquote>", "remarks": "<blockquote>\nSuperseded.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-May-28 12:48", "status": "resolved", "created": "2014-Jul-29 10:49", "fixed_version": "2014-Jul-29 10:49", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "#4492", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "adesmet@cs.wisc.edu", "due_date": ""}