{"id": 4496, "title": "Ticket #4496: Predictable hostname detection", "description": "<blockquote>\nWe need to document the current hostname detection algorithm and improve it.\n\n<p>CURRENT deficiencies:\n</p><ul>\n<li>condor_gethostname (the default UTS hostname detection) doesn't appear to work with IPv6 if NO_DNS is enabled\n</li><li>Hostname is a function of the configuration file (depending on ENABLE_IPV6 or ENABLE_IPV4).  However, the configuration is a function of the hostname.  Hence, it's quite possible to have a non-convergent configuration.\n</li><li>We show no preference for the local hostname - instead taking the last hostname from the highest desirability.\n</li><li>There's no way to override the hostname.\n</li></ul>\n\n<p>Summary of proposal:\n</p><ul>\n<li>Default the \"local hostname\" to the value of environment variable CONDOR_HOSTNAME; if this is not present, use the UTS hostname through gethostname.\n</li><li>If NETWORK_INTERFACE is set in the config file as non-default, issue a warning.  Allow it to be set as the CONDOR_NETWORK_IP environment variable instead.\n<ul>\n<li>(Upgrade the network_interface_to_ip function to work with IPv6 addresses.)\n</li></ul>\n</li><li>Do a reverse lookup for <strong>all</strong> IP addresses, v4 and v6.  Use the existing desirability rankings algorithm for iterating through addresses; introduce a level \"4\" for IP addresses which match the local hostname.\n<ul>\n<li>The first IP address with highest desirability is used as the default IPv4/6 address.  As suggested in <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=4461\" onclick=\"get_ticket_and_populate_wrapper('4461'); return false;\" title=\"IPv6 used by default if enabled\">#4461</a></span>, track the default IPv4 and IPv6 addresses separately.\n</li><li>The default IP address (if v4 or v6 is not specified) will be determined by the IP address above with the highest desirability.</li></ul>\n</li></ul>\n</blockquote>", "remarks": "<blockquote>\n<em>2014-Jul-29 15:35:07 by bbockelm:</em> <br/>\n\nThe biggest outcome of the proposed algorithm is that the hostname and IP address detection becomes independent of the configuration file - meaning we don't have to worry about non-convergent configurations!\n\n<p>I think it's OK to take the key configuration variables from the environment because, currently, NETWORK_INTERFACES and ENABLE_IPV6 only function if present on the global config file.  Accordingly, the only way to change these are to go against best practices for managing configuration files.\n\n</p><p>Another change to note is we could utilize a hostname derived from an IPv6 interface even if ENABLE_IPV6=false.  This would be the wrong hostname if the IPv6 hostname is different from the IPv4 hostname <strong>and</strong> the default hostname is the IPv6 one).  I'd argue this is a sufficiently rare setup (and really, quite a bad idea!) that we can instruct affected users to override using the CONDOR_HOSTNAME environment variable.  With the patches in <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=4461\" onclick=\"get_ticket_and_populate_wrapper('4461'); return false;\" title=\"IPv6 used by default if enabled\">#4461</a></span> and the changes set above, the correct local IPv4 address would still be used even in this case.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2014-Jul-29 15:35", "status": "new", "created": "2014-Jul-29 15:22", "fixed_version": "2014-Jul-29 15:22", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "bbockelm", "rust": "", "customer_group": "lark", "visibility": "public", "notify": "", "due_date": ""}