{"id": 452, "title": "Ticket #452: remote job in grid universe can be killed even after lease renewed", "description": "<blockquote>\nIn Condor-C, the gridmanager on the submit side will renew the job lease attributes in the job <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span> on the remote schedd.  <em>However</em>, if the remote job is already running, the remote side schedd will have spawned a shadow.  This shadow has a cached copy of the job classad upon which it evaluates job policy expressions, such as the expression that says the job should be killed when the lease expires.  The problem is the submit side gridmanager updates the copy of the remote job ad in the schedd, but the job can still be killed because the remote side shadow never sees the update.\n\n<p>This problem is blocking the BatLab's ETICs deployment.\n\n</p><p>Note we have observed this problem w/ Condor-C, but the same trouble may very well exist for Condor-G due to caching of the job ad by the gridmanager.  In addition, the job router caches the job ad... maybe another problem area.\n\n</p><p>Two solutions are proposed, an immediate short term work-around for <span class=\"quote\">BatLab</span>, and the real fix.\n\n</p><p></p><ol>\n<li><strong>Short Term</strong>.  Detailed in <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=453\" onclick=\"get_ticket_and_populate_wrapper('453'); return false;\" title=\"Short-term fix for Condor-C ignoring job lease renewal of running jobs\">#453</a></span>.\n</li><li><strong>Real Fix</strong>.  The schedd should signal the shadow (and/or gridmanager and/or jobmanager) when the shadow should refresh its copy of the job ad from the schedd.  The schedd would send this signal whenever a job ad is changed by a tool <em>other than the shadow itself</em>.  This distinction could be made because the schedd has a public port (used by tools like condor_q) and a private port used for shadow/gridmanager connections.  Changes to the ad initiated by the private port should be ignored.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<em>2009-Oct-29 14:21:09 by jfrey:</em> <br/>\n\nThis problems doesn't exist for Condor-C jobs that become grid universe jobs on the remote schedd. The gridmanager checks for renewed leases once a minute from the schedd. The gridmangaer's lease update checking could be made more efficient, though.\n\n<p></p><hr/>\n<em>2009-Nov-17 11:39:45 by jfrey:</em> <br/>\n\nWe need to determine if the real fix outlined above is necessary, or if the temporary solution (now that it's in place) is sufficient.\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=453\" onclick=\"get_ticket_and_populate_wrapper('453'); return false;\" title=\"Short-term fix for Condor-C ignoring job lease renewal of running jobs\">#453</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nShort-term fix for Condor-C ignoring job lease renewal of running jobs</td></tr>\n</tbody></table>", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2011-Feb-01 14:50", "status": "defer", "created": "2009-May-05 13:41", "fixed_version": "2009-May-05 13:41", "broken_version": "v070200", "priority": "3", "subsystem": "Grid", "assigned_to": "jfrey", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "bgietzel@cs.wisc.edu", "due_date": ""}