{"id": 4541, "title": "Ticket #4541: ordering of configuration files not well documented", "description": "<blockquote>\nWhich configuration files are local, and which are global?  What is the exact order of evaluation?  How is this different on Windows from Linux?  Many of these details are documented, but some of the information is buried in the installation section, and other parts are in section 3.3 (Configuration).\n\n<p>Details are to be placed and revised as this ticket's content, and after that, all the info will get into the manual,  <strong>in a single location</strong>.\n</p><hr/>\nOrdering is important.  The last time a variable's value is set wins, where there are multiple locations/files that set a particular variable.\n\n<p>The various kinds of files or environment variables that might specify configuration have an ordered evaluation.  In order:\n\n</p><p></p><ol>\n<li>a single configuration file; we tend to call this the <strong>global</strong> configuration file\n</li><li>other configuration file(s), referenced and parsed due to specification within the global configuration file; we tend to call these <strong>local</strong> configuration files, and there may be more than one\n</li><li>environment variables\n</li></ol>\n\n<p>So, if variable <code>FOO</code> is set in both the global configuration and in a local configuration file, the value that sets <code>FOO</code> is the local configuration file one, as it is evaluated later than the global configuration one.\n\n</p><p>For Linux, we search for a single <strong>global</strong> configuration file, starting at the top of the following list. We use the first one that exists, and then remaining possible file locations from this list become irrelevant.\n\n</p><p></p><ol>\n<li>File specified in the CONDOR_CONFIG environment variable\n</li><li><code>$(HOME)/.condor/condor_config</code>  <em>(Ticket <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=3158\" onclick=\"get_ticket_and_populate_wrapper('3158'); return false;\" title=\"condor_config in $HOME is not practical\">#3158</a></span> for version 8.3.1: this file is removed from this list of possibilities for the global configuration file.  It becomes an automatically checked location for use as a local configuration file.)</em>\n</li><li><code>/etc/condor/condor_config</code>\n</li><li><code>/usr/local/etc/condor_config</code>\n</li><li><code>~condor/condor_config</code>\n</li></ol>\n\n<p>For Windows, the location of the <strong>global</strong> configuration file is determined by the contents of the environment variable <code>CONDOR_CONFIG</code>.  If this environment variable is not defined, then the location is the registry value of\n<code>HKEY_LOCAL_MACHINE/Software/Condor/CONDOR_CONFIG</code>.\n\n</p><p>The global configuration file may contain a specification of one or more local configuration files.  Since the last definition of a variable sets the value, we must fully specify the ordering of parsing these <strong>local</strong> configuration files.  In order:\n\n</p><p></p><ol>\n<li>The value of <code>LOCAL_CONFIG_DIR</code> lists one or more directories which contain configuration files.  The list is parsed from left to right.  The leftmost (first) in the list is parsed first.  Within <em>each</em> directory, a lexicographical ordering by file name determines the ordering of file consideration.\n</li><li>The value of <code>LOCAL_CONFIG_FILE</code> lists one or more configuration files.  These files are considered in left to right within the list.\n</li><li>If one of these steps <em>changes the value (RHS)</em> of <code>LOCAL_CONFIG_DIR</code>, then <code>LOCAL_CONFIG_DIR</code> is processed for a second time, using the changed list of directories.\n</li></ol>\n\n<p></p><hr/>\nAn unrelated detail to get correct in updated documentation:\n\n<p>If the value of <code>LOCAL_CONFIG_FILE</code>  ends in the pipe character (|), then the variable's value cannot be as defined (a list of files).  It must instead be the command to execute.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2014-Sep-04 14:20</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/11fd1c0c4802f1aa039ab935f69695b83f1fe1ea\">[41104]</a></span>: better documentation of how we locate and the order of parsing the variety of configuration files <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4541\" onclick=\"get_ticket_and_populate_wrapper('4541'); return false;\" title=\"ordering of configuration files not well documented\">#4541</a></span>  (By Karen Miller )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2014-Sep-04 15:47", "status": "resolved", "created": "2014-Aug-15 13:52", "fixed_version": "2014-Aug-15 13:52", "broken_version": "v080200", "priority": "3", "subsystem": "", "assigned_to": "smoler", "derived_from": "#3158", "creator": "smoler", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}