{"id": 4637, "title": "Ticket #4637: Support scope-id specification for link-local IPv6 addresses.", "description": "<blockquote>\nWhen you configure HTCondor to use IPv6 only on a machine that does not have a global IPv6 address, HTCondor (rightly) prefers the link-local address.  However, Linux (et alia?) requires a link-local IPv6 address to be specified with a trailing <code>%&lt;scope-id&gt;</code>.  Problems:\n\n<p></p><ul>\n<li>HTCondor appears to blithely ignores non-numerics after an IPv6 address.\n</li><li>HTCondor address discovery doesn't supply interface information.\n</li><li>HTCondor probably discards interface information when writing to its .address file.\n</li><li>HTCondor probably discards interface information when writing a sinful and/or to a classad.\n</li></ul>\n\n<p>I don't imagine this is important to fix any time soon (who actually <em>uses</em> link-local addresses?), but it might be wise to temporarily suppress their generation until they actually work.\n\n</p><p>inet_pton should be doing the correct thing.  condor_sockaddr should be correctly holding on to the scope id in v6.sin6_scope_id. Conversion into Sinful almost certainly loses it!\n\n</p><p>A scope ID can always be an integer (it's an index of the interface). Linux, at least, allows an interface name; inet_pton will find the matching integer.  It's okay if we throw away the interface name and only use the integer internally.\n\n</p><p>Observation: the only way to determine the correct scope-id is to get it off an active connection to the host in question.  The server cannot know what scope-id you'll need, nor can the negotiator.  Is there any point to trying to support them at all?   It seems like it might be useful for setting up a pool quickly (just slap some machines on a switch and rely on the link local addresses), but we're literally down to guessing which interface to use.  We could potentially support binding to a single IPv6 link local interface and assuming that all link-local connections should use it.\n\n</p><p>Ideally we should always support specifications on the command line.</p></blockquote>", "remarks": "<blockquote>\n<em>2018-Jan-16 14:25:57 by jfrey:</em> <br/>\n\nTicket <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=6518\" onclick=\"get_ticket_and_populate_wrapper('6518'); return false;\" title=\"IPv6 usability improvements\">#6518</a></span> includes improvements so that scope-ids are handled correctly in the following situations:\n<ul>\n<li>There's a single link-local IPv6 address on the local machine.\n</li><li>A single link-local IPv6 address is specified by the NETWORK_INTERFACE config param.\n</li></ul>\n\n<p>This should handle a lot of use cases, including \"just slap some machines on a switch\".</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2018-Jan-16 14:25", "status": "new", "created": "2014-Oct-06 16:28", "fixed_version": "2014-Oct-06 16:28", "broken_version": "", "priority": "3", "subsystem": "Libs", "assigned_to": "", "derived_from": "#4492", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, adesmet@cs.wisc.edu", "due_date": ""}