{"id": 4867, "title": "Ticket #4867: Docker Universe should check command at submit time.", "description": "<blockquote>\nThe following submit file currently causes us grief.\n\n<p></p><div class=\"code\">\n<pre class=\"code\"></pre></div>\n\nuniverse = docker\ncommand = file-on-disk\ndocker_image = ubuntu\nqueue 1\n{encode}\n\n<p>condor_submit will set <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=TransferExecutable\" title=\"Transfer Executable\">TransferExecutable</a></span> to false, which will cause the starter to conclude that shouldn't prepend the full path to the command passed to Docker.  Even if we actually did transfer the executable, the job still won't run because the sandbox is not in the PATH by default.\n\n</p><p>condor_submit should check to see if the commmand exists on the submit disk in the usual way.  If it does, do nothing special.  (Let it be transferred, or not, according to the usual rules.)  If it does not exist, then fail if transfer_executable is <em>not</em> false, explaining that setting transfer_executable to false in Docker universe is how you tell HTCondor that you want to run a command from the image, not from the sandbox.\n\n</p><p>The starter will then prepend the sandbox('s mountpoint) to the command if and only if transfer_executable is not false (true or absent) and the path is relative.  (This assumes that transfer executable is true or absent when running jobs off a shared file system.)</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Nov-12 15:02", "status": "new", "created": "2015-Feb-04 15:02", "fixed_version": "2015-Feb-04 15:02", "broken_version": "", "priority": "2", "subsystem": "DaemonsExecNode", "assigned_to": "johnkn", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "johnkn@cs.wisc.edu", "due_date": ""}