{"id": 4890, "title": "Ticket #4890: Mistakes and confusion around documentation of CPU core detection", "description": "<blockquote>\nThe documentation surrounding CPU core detection and counting seems to be a mess, and should be fixed asap.  Below I cut-n-pasted the relevant knob notes as they currently stand in the manual.  I think the blurb for $(DETECTED_CORES) is the only one that looks fine :).  With DETECTED_CPUS, I think the documentation says the exact opposite of the truth!  The rest are confusing and/or use inconsistent language (mixing the idea of number of CPUs vs the number of CPU cores, interchanging terminology like 'hyper-threaded cores' vs 'virtual CPUs' vs 'hyperthread CPUs' vs 'hyper-threaded processors' vs 'CPUs/cores').  For NUM_CPUS, it says it is \"disabled by default\", and then goes on to give a default value.  The documentation on <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=DetectedCpus\" title=\"Detected Cpus\">DetectedCpus</a></span> attribute in the machine ad is also meaningless - is it equal to $(DETECTED_CORES), or $(DETECTED_CPUS), or something else?  I have no idea.\n\n<p>Current wording of Manual Entries we should improve -\n\n</p><p></p><ul>\n<li>$(DETECTED_CORES)\n    The number of detected CPU cores. This includes hyper-threaded cores, if there are any.\n\n<p></p></li><li>$(DETECTED_PHYSICAL_CPUS)\n    The integer number of physical (non hyper-threaded) CPUs.\n\n<p></p></li><li>$(DETECTED_CPUS)\n    The integer number of physical (non hyper-threaded) CPUs, as given by $(DETECTED_PHYSICAL_CPUS), when COUNT_HYPERTHREAD_CPUS is True. The integer number of hyper-threaded CPUs, as given by $(DETECTED_CORES), when COUNT_HYPERTHREAD_CPUS is False.\n\n<p></p></li><li>COUNT_HYPERTHREAD_CPUS\n    This macro controls how HTCondor sees hyper-threaded processors. When set to True (the default), it includes virtual CPUs in the default value of NUM_CPUS. On dedicated cluster nodes, counting virtual CPUs can sometimes improve total throughput at the expense of individual job speed. However, counting them on desktop workstations can interfere with interactive job performance.\n\n<p></p></li><li>NUM_CPUS\n    An integer value, which can be used to lie to the condor_startd daemon about how many CPUs a machine has. When set, it overrides the value determined with HTCondor's automatic computation of the number of CPUs in the machine. Lying in this way can allow multiple HTCondor jobs to run on a single-CPU machine, by having that machine treated like a multi-core machine with multiple CPUs, which could have different HTCondor jobs running on each one. Or, a multi-core machine may advertise more slots than it has CPUs. However, lying in this manner will hurt the performance of the jobs, since now multiple jobs will run on the same CPU, and the jobs will compete with each other. The option is only meant for people who specifically want this behavior and know what they are doing. It is disabled by default. The default value is set by $(DETECTED_CPUS).\n\n<p></p></li><li>Startd Ad attribiute <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=DetectedCpus\" title=\"Detected Cpus\">DetectedCpus</a></span>:\n    The number of detected machine CPUs/cores.</li></ul>\n</blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2015-Feb-16 15:47</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/19ee3d45d9ca431fc966260ad0d0f0a9aa865cbf\">[43370]</a></span>: doc changes to complete <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4890\" onclick=\"get_ticket_and_populate_wrapper('4890'); return false;\" title=\"Mistakes and confusion around documentation of CPU core detection\">#4890</a></span>  (By Karen Miller )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2015-Feb-16 15:50", "status": "resolved", "created": "2015-Feb-16 12:11", "fixed_version": "2015-Feb-16 12:11", "broken_version": "v080200", "priority": "3", "subsystem": "DaemonsExecNode", "assigned_to": "smoler", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "tannenba@cs.wisc.edu, johnkn@cs.wisc.edu", "due_date": ""}