{"id": 5060, "title": "Ticket #5060: Add \"foreach\" capability to DAGMan", "description": "<blockquote>\nA possibility that was discussed during HTCondor Week is adding something like the new condor_submit \"foreach\" capability to DAGMan.  (One note on condor_submit \"foreach\":  I don't know if we want to encourage people to heavily use that within DAGMan, because if you have submit files that generate a lot of jobs, you really decrease the value of rescue DAGs.)\n\n<p>Anyhow, I think that something like this is a good idea, but the big question is whether this should be incorporated directly into DAGMan, or whether it should be part of a DAG-generation tool (see <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=2646\" onclick=\"get_ticket_and_populate_wrapper('2646'); return false;\" title=\"Create a DAG generation tool\">#2646</a></span>).</p></blockquote>", "remarks": "<blockquote>\n<em>2015-May-22 09:46:23 by wenger:</em> <br/>\n\nHmm -- if we do this inside DAGMan, an interesting question is when the expansion should take place -- at DAG parse time, or when you actually get to that part of the DAG?  If you're doing the file globbing form, that could make a big difference, if the stuff you're globbing was produced by an earlier part of the DAG.\n\n<p>I suspect that it would be quite a bit easier to do the expansion at parse time, but doing it when you get to the relevant part of the DAG could be useful (although you could get a lot of the benefit of the latter with sub-DAGs).</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-May-22 09:46", "status": "new", "created": "2015-May-21 10:14", "fixed_version": "2015-May-21 10:14", "broken_version": "v080306", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "#2646", "creator": "wenger", "rust": "", "customer_group": "other", "visibility": "public", "notify": "wenger@cs.wisc.edu, zmiller@cs.wisc.edu, tannenba@cs.wisc.edu", "due_date": ""}