{"id": 5102, "title": "Ticket #5102: Merge various blahp codebases", "description": "<blockquote>\nFor the 8.5 series, we'd like to review the differences between the OSG-shipped blahp and the UW-shipped blahp and get things down to a single code base.</blockquote>", "remarks": "<blockquote>\n<em>2015-Sep-28 14:17:05 by tannenba:</em> <br/>\n\nAt the OSG meeting last week, it was suggested that Jaime take the lead on this activity, but most of the work (at least at the start) for going through patches in OSG and comparing to what is in HTCondor could be done by Derek @ UNL with occasional consultation help from Brian (OSG) and Jaime (HTCondor).\n\n<p></p><hr/>\n<em>2015-Oct-23 10:12:26 by dweitzel:</em> <br/>\n\nI created a spreadsheet of differences between HTCondor's blahp and the OSG's.\n<a class=\"external\" href=\"https://docs.google.com/spreadsheets/d/1tZLW1aSWiYpeQkuVFylAf5hSLhMe8onQD_MYk-4GUPo/edit?usp=sharing\">Google Spreadsheet</a>\n\n<p></p><hr/>\n<em>2015-Nov-23 16:10:29 by blin:</em> <br/>\n\nDerek, are there any patches that are in the HTCondor codebase but not in the OSG's?\n\n<p></p><hr/>\n<em>2015-Dec-16 11:40:29 by blin:</em> <br/>\n\nDerek, not sure if you saw my previous comment: Are there any patches that are in the HTCondor codebase but not in the OSG's?\n\n<p></p><hr/>\n<em>2016-Jan-13 11:53:24 by blin:</em> <br/>\n\nOops, I had it the other way around. We've got the list of patches that are in HTCondor but not in the OSG. There are likely a glut of patches that are in the OSG but not in HTCondor and they would be the remaining commits.\n\n<p>Another thing is that it looks like Condor is using 1.16.5.1. It looks like OSG forked blahp 1.18.1? It's hard to tell from the commit history where exactly the fork happened.\n\n</p><p></p><hr/>\n<em>2016-Mar-29 10:44:11 by blin:</em> <br/>\n\nDerek, can you work with Jaime on the next steps here? We should obviously be able to drop the patches that are both in the HTCondor and the OSG blahp. Now we have to look at the patches that are in one version or the other and decide if they can be incorporated into the Great Blahp Merger.\n\n<p></p><hr/>\n<em>2016-Apr-06 15:41:09 by dweitzel:</em> <br/>\n\nI'm not sure there is a way to exactly tell the changes in a concise way between the OSG blahp and HTCondor's Blahp.  I counted, and there are 1243 commits to OSG's blahp since we forked the blahp from upstream.\n\n<p>We know that the OSG has (almost) all of the changes that HTCondor implements in patches.  See spreadsheet above.\n\n</p><p>We should probably have another meeting on this topic, but my suggested next step is to set HTCondor's blahp upstream to OSG's blahp.  Test, test, test, and release.\n\n</p><p></p><hr/>\n<em>2016-Apr-26 11:47:31 by dweitzel:</em> <br/>\n\nAdding blahp.diff. The massive diff between HTCondor's blahp (post patches, V8_5_4-branch, e92402eeee) and OSG's Blahp (v1_18_bosco, 9b2bcbb8).\n\n<p>Quick summary stats:\n</p><ul>\n<li>~6k lines in diff.\n</li><li>The two blahps where forked from upstream almost exactly 1 year apart, HTCondor: 2011/02/07, OSG: 2012/02/06\n</li></ul>\n\n<p>I'll add more analysis after reading deeply through the diff.\n\n</p><p></p><hr/>\n<em>2016-Apr-26 15:57:07 by dweitzel:</em> <br/>\n\nAfter reading through the diff, I have these conclusions:\n\n<p></p><ol>\n<li>There are many, many changes.\n</li><li>Most of the changes are to parts of the blahp that are not used in either HTCondor or the OSG, and for which I cannot speak knowledgeably about.  For example, the changes to the <code>blupdater</code>, which is a daemon that is not run in either HTCondor or OSG when the blahp is used.  Most of these changes seem to be because of the difference in when HTCondor and the OSG forked from upstream.  There are small changes in <code>server.c</code>, but otherwise the compiled files are largely untouched from upstream.\n</li><li>About 1/4 of the changes are to the scripts used to communicate with the local scheduler, which are used by both HTCondor and the OSG.  There are some differences to the base scripts such as <code>blah_common_submit_functions.sh</code>, but they are minor.\n</li><li>The differences of the scripts between HTCondor and OSG are isolated.  Mostly, I can point to the OSG scripts as having more up to date logic.  For example, the OSG's <code>pbs_submit.sh</code> correctly submits PBSPro jobs with the <code>select</code> statement, HTCondor's does not.\n</li></ol>\n\n<p></p><hr/>\n<em>2016-Apr-26 16:26:05 by blin:</em> <br/>\n\nJust one correction to 2: I believe SLAC uses the blupdater in front of their LSF cluster.\n\n<p></p><hr/>\n<em>2016-Apr-28 09:18:21 by cat:</em> <br/>\n\nThanks, Derek, the more detailed analysis seems quite helpful.\n\n<p>Looking at things from the other direction - changes in HTCondor's version that are NOT in the OSG version... There were not many, IIRC. But can you list and characterize them here? If the proposal is to just use OSG's version for HTCondor, what would be missing or broken in HTCondor as a result?\n\n</p><p></p><hr/>\n<em>2016-May-02 16:05:52 by dweitzel:</em> <br/>\n\nI have listed and characterized all of the changes in the HTCondor version in the <a class=\"external\" href=\"https://docs.google.com/spreadsheets/d/1tZLW1aSWiYpeQkuVFylAf5hSLhMe8onQD_MYk-4GUPo/edit?usp=sharing\">Google Spreadsheet</a>.\n\n<p>I added the 3 more patches/additions that have been added to the Blahp since my last analysis, the nolimit proxies patch, HTCondor multi-core support, and adding Slurm support.\n\n</p><p></p><hr/>\n<em>2016-Jun-07 10:36:08 by blin:</em> <br/>\n\nWe've add the HTCondor multicore + native Slurm support to the OSG's blahp from HTCondor's blahp. Where does everything else stand?\n\n<p></p><hr/>\n<em>2016-Oct-28 13:44:11 by blin:</em> <br/>\n\nThere has been an additional change to HTCondor's blahp that has not made it into the OSG's blahp (<a class=\"external\" href=\"https://jira.opensciencegrid.org/browse/SOFTWARE-2386\">https://jira.opensciencegrid.org/browse/SOFTWARE-2386</a>). Are there any more?\n\n<p>What's the status of merging OSG changes into HTCondor's blahp?\n\n</p><p></p><hr/>\n<em>2016-Oct-28 16:21:42 by bbockelm:</em> <br/>\n\nHi BrianL,\n\n<p>The intent is still to start the merge work once a branch is made for 8.6.\n\n</p><p>Brian\n\n</p><p></p><hr/>\n<em>2018-Mar-12 16:46:19 by edquist:</em> <br/>\n\nHi all,\n\n<p>I'm looking at this ticket now for the first time.\n\n</p><p>Presumably the osg-bosco version is <a class=\"external\" href=\"https://github.com/osg-bosco/BLAH\">https://github.com/osg-bosco/BLAH</a>\n\n</p><p>Where does the HTCondor version live within the condor sources?  Or is it just the external blahp 1.16.5.1 + patches?\n\n</p><p>Thanks,\nCarl\n\n</p><p></p><hr/>\n<em>2018-Mar-12 16:52:53 by edquist:</em> <br/>\n\n... So it's looking to me like the HTCondor version of the blahp is built as an external (blahp 1.16.5.1) + the condor patches.\n\n<p>Does anybody know what the upstream is for the blahp external?\n\n</p><p></p><hr/>\n<em>2018-Mar-13 08:52:37 by jfrey:</em> <br/>\n\nThe CMakeFile for the blahp external in the Condor source shows the URL it was pulled from. It predates the codebase's move to git, and it appears the tags and branches from the previous CVS repository didn't make it to github. And the old website no longer exists.\n\n<p></p><hr/>\n<em>2019-May-10 16:14:43 by blin:</em> <br/>\n\nThe OSG/HTCondor teams had a meeting to discuss next steps and this is what we came up with:\n\n<p></p><ol>\n<li>Create a CHTC BLAH git repo cloned from <a class=\"external\" href=\"https://github.com/opensciencegrid/BLAH\">https://github.com/opensciencegrid/BLAH</a> (this contains all HTCondor patches except the blahp -&gt; batch_gahp and m4 changes).\n<ol>\n<li>We'll use the 'devel' branch as our main branch for work based off the OSG 'v1_18_bosco' branch. The idea being that we'd have 'devel' and 'stable' branches that would align with the HTCondor development/stable series.\n</li><li>For the time being, flightworthy will continue to build the blahp as an external with the remaining patches using a tarball generated off of tags from this git repo. We should continue with the OSG versioning scheme, dropping the {{.bosco}} suffix.\n</li></ol>\n</li><li>Use blahp instead of batch_gahp. Some work is required to transition existing installations using batch_gahp config to blahp.\n</li><li>Set up <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=GitHub\" title=\"Git Hub\">GitHub</a></span> forwarding with <a class=\"external\" href=\"https://github.com/prelz/BLAH\">https://github.com/prelz/BLAH</a> as the upstream\n</li><li>Pull the blahp into HTCondor proper. We noted two options, which we can decide on based on build-system support:\n<ol>\n<li>Drop the blahp under src/ in the HTCondor repo as a git submodule. It was noted that 'git archive' does not automatically populate submodules.\n</li><li>Add the blahp tarball as a secondary source in the packaging and drop things in at build time.\n</li></ol>\n</li></ol>\n\n<p></p><hr/>\n<em>2019-Jun-27 17:22:02 by edquist:</em> <br/>\n\nI had some issues building the updated blahp as an external, apparently due to some update dependencies.\n\n<p>Anyway after some discussion it was decided that we'll just build the blahp rpm into the condor repo on koji, which will then be placed into the htcondor yum repo.  This will need to be manually rebuilt whenever the classads library is updated.\n\n</p><p>Current blahp builds in koji's condor repo:\n\n</p><p><a class=\"external\" href=\"https://koji.chtc.wisc.edu/koji/buildinfo?buildID=12748\">https://koji.chtc.wisc.edu/koji/buildinfo?buildID=12748</a>\n\n</p><p><a class=\"external\" href=\"https://koji.chtc.wisc.edu/koji/buildinfo?buildID=12749\">https://koji.chtc.wisc.edu/koji/buildinfo?buildID=12749</a>\n\n</p><p>And in the condor repo I've made a new <code>V8_9-gt5102-drop_blahp_external</code> branch (commits referenced in this ticket), which removes the stuff for the blahp external build and renames the config paths.\n\n</p><p></p><hr/>\n<em>2019-Jun-28 10:50:12 by blin:</em> <br/>\n\nGreat! But before we completely rip out the blahp external, we'll need to sort out the Debian and tarball packaging. How's that work going?\n\n<p></p><hr/>\n<em>2019-Jun-28 17:41:50 by edquist:</em> <br/>\n\n&gt;How about dat Debian and tarball packaging?\n\n<p>I was focused first on getting successful builds of the blahp and condor without the blahp.  I started down the path of debian packaging tutorials, and taking a look at the existing debian packaging in the condor source repo - but I have not gone far.\n\n</p><p>I discussed the topic with TimT also and note a few things:\n\n</p><p>1. The current debian builds are PROPER and (thus) do not include the blahp.\n\n</p><p>This isn't to say that we should not also package the blahp, but it is worth noting that anyone using the current debian packaging of condor is apparently <em>not</em> using the blahp.\n\n</p><p>2. Who uses the blahp?  Who uses the tarballs?  (Bosco?)\n\n</p><p>3. Based on Miron's direction from last Friday's meeting, we want to get out of the business of bundling everything with condor.  TimT suggested that this probably means the tarball too - thus, no blahp in the tarballs.\n\n</p><p>However, if the tarballs are used by people who can't install system packages and also still use the blahp, perhaps we still need some kind of tarball solution for them.\n\n</p><p>Can we make a separate tarball for the blahp, rather than including in it condor's?\n\n</p><p></p><hr/>\n<em>2019-Jul-01 07:59:28 by bbockelm:</em> <br/>\n\nFolks -\n\n<p>At some point this could use a modest design document to detail precisely what we intend to accomplish (even if it's solely for historical purposes).  The ticket is sufficiently long that it is starting to get difficult to follow.\n\n</p><p></p><hr/>\n<em>2019-Jul-11 13:58:46 by edquist:</em> <br/>\n\nHere's something to get started:\n\n<p><a class=\"external\" href=\"https://docs.google.com/document/d/1Cw6PqcR6V8EJWKAONldv2vW5qWBxZpA68SJTrhVX9sk/edit?usp=sharing\">https://docs.google.com/document/d/1Cw6PqcR6V8EJWKAONldv2vW5qWBxZpA68SJTrhVX9sk/edit?usp=sharing</a>\n\n</p><p>Permissions are currently set so anyone with UW-Madison G Suite with the link can edit.  Not sure if that's how FW normally does design docs - if not let me know and I can change as appropriate.\n\n</p><p></p><hr/>\n<em>2019-Jul-11 14:52:36 by tannenba:</em> <br/>\n\nCarl,\n\n<p>See <span class=\"wiki\"><a href=\"wiki?p=DesignDoc\" title=\"Design Doc\">DesignDoc</a></span> about format of your design document, and <span class=\"wiki\"><a href=\"wiki?p=GoogleDriveWisdom\" title=\"Google Drive Wisdom\">GoogleDriveWisdom</a></span> for information about how to post them (they need to go into a specific Google Drive shared folder).\n\n</p><p></p><hr/>\n<em>2019-Jul-16 16:44:04 by edquist:</em> <br/>\n\nJust to note it here, I do not seem to have access to modify the HTCondor Design Documents folder, which seems to be preventing me from \"moving\" my existing doc to the \"Unreviewed Designs\" folder, or making a new one there.\n\n<p></p><hr/>\n<em>2019-Aug-05 16:00:53 by edquist:</em> <br/>\n\nI discussed the topic of the tarballs with TimT -\n\n<p>Tim suggests that we add the appropriate cmake logic so that for the tarball builds, blahp is built as an external, which then gets bundled with the rest of the build in the tarball.\n\n</p><p>On the other hand, for the package builds (rpm, deb), we can make a separate \"condor-grid\" meta package, which requires the blahp package, and also includes the bits from condor_gridmanager.\n\n</p><p></p><hr/>\n<em>2020-Aug-10 14:04:03 by tim:</em> <br/>\n\nFinishing up with the <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=7681\" onclick=\"get_ticket_and_populate_wrapper('7681'); return false;\" title=\"Use externals from EPEL for RPMs\">#7681</a></span></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body><blockquote>\n<ul>\n<li><a href=\"../files/939/blahp.diff\">blahp.diff</a>\n211298 bytes added by dweitzel on 2016-Apr-26 16:45:52 UTC.\n<br/>\nAdding blahp.diff.  The massive diff between HTCondor's diff (post patches, V8_5_4-branch, e92402eeee) and OSG's Blahp (v1_18_bosco, 9b2bcbb8).\n\n<p>Quick summary stats:\n* ~6k lines in diff.\n* The two blahps where forked from upstream almost exactly 1 year apart, HTCondor: 2011/02/07, OSG: 2012/02/06\n\n</p><p>I'll add more analysis in a comment.<br/>\n</p></li></ul>\n</blockquote></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Jun-27 17:01</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/758cbe354e01e794e6d0e719f9131039af9010da\">[57247]</a></span>: remove blahp version from external dir (<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=5102\" onclick=\"get_ticket_and_populate_wrapper('5102'); return false;\" title=\"Merge various blahp codebases\">#5102</a></span>) we're no longer tying the blahp external to a specific version  (By Carl Edquist )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Jun-27 16:34</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/b55277b29d7caed60b242db350df27cb1215311b\">[57245]</a></span>: support original name for blah.config (<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=5102\" onclick=\"get_ticket_and_populate_wrapper('5102'); return false;\" title=\"Merge various blahp codebases\">#5102</a></span>)  (By Carl Edquist )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Jun-27 16:33</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/0e3056ac5975c7aaa7e67d80cbbe368fd7585e22\">[57244]</a></span>: drop blahp external stuff from condor.spec (<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=5102\" onclick=\"get_ticket_and_populate_wrapper('5102'); return false;\" title=\"Merge various blahp codebases\">#5102</a></span>) Note there are still some scripts in a %blahp section that come from src/condor_gridmanager, but these are not from the external.  (By Carl Edquist )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Jun-27 16:33</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/ce88891de7931ed370f3071ac11a870d4d2ca40a\">[57243]</a></span>: drop blahp external (<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=5102\" onclick=\"get_ticket_and_populate_wrapper('5102'); return false;\" title=\"Merge various blahp codebases\">#5102</a></span>) Actually we still need to set a couple cmake variables for BLAHP; we'll keep a small amount of cmake logic from the external around for that. Or this logic could be moved up into build/cmake/CondorConfigure.cmake SOFTWARE-3587  (By Carl Edquist )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2020-Aug-10 14:04", "status": "new", "created": "2015-Jun-17 21:12", "fixed_version": "2015-Jun-17 21:12", "broken_version": "", "priority": "1", "subsystem": "DaemonsSubmitNode", "assigned_to": "tim", "derived_from": "#5045", "creator": "bbockelm", "rust": "", "customer_group": "osg", "visibility": "public", "notify": "jfrey@cs.wisc.edu, tannenba@cs.wisc.edu, bbockelm@cse.unl.edu, blin@cs.wisc.edu, cat@cs.wisc.edu dweitzel@cse.unl.edu blin@cs.wisc.edu", "due_date": ""}