{"id": 5120, "title": "Ticket #5120: Change outcome of transfer_output_files failure", "description": "<blockquote>\nCurrently, if user specifies \"transfer_output_files\" and such files do not exist when the job completes (success or failure) the job goes on hold, without any return value reported in the user log, and without stderr or stdout, which leads to the following:\n\n<p></p><ol>\n<li>User can't troubleshoot job\n</li><li>Users <strong>have</strong> to release said jobs, or often remove them and resubmit (two steps) if they don't know about \"release\" options.\n</li><li>Users aware of \"release\" options often resort to a <code>PeriodicRelease</code>, which, if the jobs fail immediately, results in jobs \"thrashing\" between held &gt; idle &gt; running &gt; held &gt; (so on).\nWe've seen this render the schedd unresponsive in many cases.\n</li></ol>\n\n<p>Instead, can a change be made to:\n</p><ol>\n<li>Let jobs fail if the files in \"transfer_output_files\" did not exist, reporting the return value in the user log (which might still be \"0\").\n</li><li>Transfer back, anyway, the stderr and stdout, for troubleshooting purposes.\n</li><li>Add information in the user log or elsewhere that tells the user the contents of the sandbox when the job exited, but only including the top level - not recursive.)\n</li><li>Perhaps add submit file \"knobs\" to specify which option (current 'hold' method, or remove job from queue and transfer what \"can\" be transferred, but with an indication of transfer issue in the user log.)\n</li></ol>\n\n<p>Though the jobs will fail instead of going on hold:\n</p><ol>\n<li>It is unlikely that the user can \"fix\" the job while it's in the queue by using condor_qedit, anyway.\n</li><li>There are options to retry failed jobs, both with submit file specifications AND with DAGMan features, which would be the better way to handle cases where <strong>some</strong> jobs fail to produce the desired output (and where a retry might actually result in job success.)\n</li></ol>\n\n<p>Thank you,\nLauren (CHTC)</p></blockquote>", "remarks": "<blockquote>\n<em>2015-Jun-24 14:49:22 by tannenba:</em> <br/>\n\nA few comments on the above....\n\n<p>Things are not quite as bad as Lauren writes above (unless functionality has regressed).  Specifically if a file listed in transfer_output_files does not exist, HTCondor is still supposed to\n</p><ol>\n<li>transfer back all the files that do exist (including stderr, stdout, etc) - see <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=487\" onclick=\"get_ticket_and_populate_wrapper('487'); return false;\" title=\"Transfer as much output as possible (think: --keep-going)\">#487</a></span>.\n</li><li>set all job classad exit attributes like <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ExitStatus\" title=\"Exit Status\">ExitStatus</a></span>, <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ExitSignal\" title=\"Exit Signal\">ExitSignal</a></span>, etc, as well as set hold reason codes, allowing policy expressions using on_exit_remove and periodic_release to take the exit status of the job into consideration. See <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1587\" onclick=\"get_ticket_and_populate_wrapper('1587'); return false;\" title=\"Problems with semantics of failed file transfer\">#1587</a></span>.\n</li></ol>\n\n<p>Also note that many of the items requested in this ticket are a duplicate of items requested in <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1587\" onclick=\"get_ticket_and_populate_wrapper('1587'); return false;\" title=\"Problems with semantics of failed file transfer\">#1587</a></span>.  Since Zach code reviewed and resolved both <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1587\" onclick=\"get_ticket_and_populate_wrapper('1587'); return false;\" title=\"Problems with semantics of failed file transfer\">#1587</a></span> and <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=487\" onclick=\"get_ticket_and_populate_wrapper('487'); return false;\" title=\"Transfer as much output as possible (think: --keep-going)\">#487</a></span>, he now gets to deal with this ticket as well :).\n\n</p><p>Perhaps a simple immediate workaround for the \"send these files back if they exist, but it isn't a big deal if they dont\" behavior is to have zero-length files of the same name in the input file set.  That way those files will always exist :).\n\n</p><p>Seems like what we really need is a new event log event, or add more information to an existing file transfer completed log event.  Also, the file transfer code should distinguish between 1) \"failed to transfer back output file\" and 2) \"output file did not exist upon job exiting\", provide a first-class switch for saying if the job should go on hold for reason 2 (false by default?), and use different hold reason subcodes for these two failures.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2016-Nov-16 10:04", "status": "new", "created": "2015-Jun-24 13:31", "fixed_version": "2015-Jun-24 13:31", "broken_version": "", "priority": "3", "subsystem": "FileTransfer", "assigned_to": "zmiller", "derived_from": "", "creator": "lmichael", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "lmichael@wisc.edu tannenba@cs.wisc.edu johnkn@cs.wisc.edu zmiller@cs.wisc.edu", "due_date": ""}