{"id": 5275, "title": "Ticket #5275: Clarify documentation for DAGMan maxidle and maxjobs", "description": "<blockquote>\nPer multiple complaints from users (and Lauren, herself!), the documentation for \"maxidle\" and \"maxjobs\" features in the command-line manual pages is confusing. For example, the output for \"man condor_submit_dag\" says the following:\n\n<p>-maxidle <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=NumberOfJobs\" title=\"Number Of Jobs\">NumberOfJobs</a></span>\n\n</p><p></p><pre>          Sets the maximum number of idle jobs allowed before condor_dagman  stops  submitting  more  jobs.\n          Once  idle jobs start to run, condor_dagman will resume submitting jobs.  NumberOfJobs is a posi-\n          tive integer. If the option is omitted, the number of idle jobs is defined by configuration vari-\n          able  DAGMAN_MAX_JOBS_IDLE , which defaults to 1000. Note that for this argument, each individual\n          process within a cluster counts as a job, which is inconsistent with -maxjobs .  Nothing  special\n          is done to the submit description file. Setting  queue 5000 in the submit description file, where\n          -maxidle is set to 250 will result in a cluster of 5000 new jobs  being  submitted  to  the  con-\n          dor_schedd . In this case, condor_dagman will resume submitting jobs when the number of idle jobs\n          falls below 250.\n</pre>\n\n<p>Currently, the statement that \"each individual process within a cluster counts as a job\" is ambiguous, as it doesn't clearly specify that the count only applies to when DAGMan decides to submit the next \"JOB\" submit file (and that processes are not considered in a way that would only queue some of the processes for the next submit file). Lauren is happy to discuss this ambiguity further, and to show examples of users complaining about the confusion.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "doc", "last_change": "2015-Sep-24 10:42", "status": "new", "created": "2015-Sep-24 10:42", "fixed_version": "2015-Sep-24 10:42", "broken_version": "", "priority": "4", "subsystem": "Dag", "assigned_to": "", "derived_from": "", "creator": "lmichael", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "lmichael@wisc.edu", "due_date": ""}