{"id": 5293, "title": "Ticket #5293: Clarify DAG priority documentation", "description": "<blockquote>\nFrom htcondor-users today:\n\n<p>I would like to raise something which is unclear in the documentation, and that's around the idea of \"priority\".\n\n</p><p>At first glance it seems that there are two distinct and unrelated priorities.\n\n</p><p>(1) The job priority, which is set in the submit file with \"priority = XXX\" or using the condor_prio command line tool, and is reflected in the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=JobPrio\" title=\"Job Prio\">JobPrio</a></span> <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span> attribute.\n\n</p><p>When there is a choice of jobs in the queue to be run next, for the same user/accounting group, then the negotiator will pick the one with the highest priority.\n\n</p><p><a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/manual/current/condor_submit.html\">http://research.cs.wisc.edu/htcondor/manual/current/condor_submit.html</a>\n\n</p><p>\"priority = &lt;integer&gt;\nAn HTCondor job priority can be any integer, with 0 being the default. Jobs with higher numerical priority will run before jobs with lower numerical priority. Note that this priority is on a per user basis. One user with many jobs may use this command to order his/her own jobs, and this will have no effect on whether or not these jobs will run ahead of another user's jobs.\"\n\n</p><p>(2) The DAG node priority, which is set using the \"PRIORITY &lt;node&gt; &lt;value&gt;\" statement in the DAG file.\n\n</p><p>When condor_dagman has a choice of which jobs to submit next into the queue, it chooses the one with the highest priority.\n\n</p><p><a class=\"external\" href=\"http://research.cs.wisc.edu/htcondor/manual/current/2_10DAGMan_Applications.html#SECTION003108300000000000000\">http://research.cs.wisc.edu/htcondor/manual/current/2_10DAGMan_Applications.html#SECTION003108300000000000000</a>\n\n</p><p>\"The node priority affects the order in which nodes that are ready at the same time will be submitted. Note that node priority does not override the DAG dependencies.\n\n</p><p>Node priority is mainly relevant if node submission is throttled via the -maxjobs or -maxidle command-line arguments or the DAGMAN_MAX_JOBS_SUBMITTED or DAGMAN_MAX_JOBS_IDLE configuration variables.\"\n\n</p><p>Now, the documentation doesn't say at this point if the DAG node priority is related to the job priority. However, testing shows that it is (see end of message). What appears to happen is that the DAG node priority is also being used as the job priority. Not only that, but the DAG node priority <strong>overrides</strong> any job priority set explicitly in the submit file.\n\n</p><p>On reading the documentation again, there is a hint of this behaviour where it says later on:\n\n</p><p>\"There is no way to change the priority in the submit description file for a job, as DAGMan will override any priority command placed in a submit description file.\"\n\n</p><p>But until that point, I couldn't find any indication that the DAG node priority was in any way related to the job priority.\n\n</p><p>Where this becomes important is where I've made a DAG with explicit node priorities - influencing the order in which things are run to optimise throughput - but then I decide that I want one DAG to take priority over another. It seems now that I have to apply offsets to all the DAG node priorities.\n\n</p><p>I don't really have a problem with this behaviour - indeed it would probably be confusing to have two distinct priorities - but I think it could be made a lot clearer in the documentation for condor_dagman. The following would do the trick:\n\n</p><p>\"The PRIORITY keyword assigns a priority to a DAG node. The syntax for PRIORITY is\n\n</p><p>PRIORITY <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=JobName\" title=\"Job Name\">JobName</a></span> <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=PriorityValue\" title=\"Priority Value\">PriorityValue</a></span>\n\n</p><p>The node priority affects the order in which nodes that are ready at the same time will be submitted, and it also sets the job's priority in the queue, i.e. its <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=JobPrio\" title=\"Job Prio\">JobPrio</a></span> attribute. Note that node priority does not override the DAG dependencies.\"</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2016-Aug-03 13:27</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/d65ef3276b0703ef992090f3ccc2475bd78544df\">[48938]</a></span>: Gittrac <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=5293\" onclick=\"get_ticket_and_populate_wrapper('5293'); return false;\" title=\"Clarify DAG priority documentation\">#5293</a></span>: Cleaned up the documentation of DAG node priorities, partly based on comments on htcondor-users; also added a note to the condor_submit man page about the priority setting getting overridden for DAG nodes.  (By Kent Wenger )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2016-Aug-03 13:30", "status": "resolved", "created": "2015-Oct-05 16:39", "fixed_version": "2015-Oct-05 16:39", "broken_version": "v080208", "priority": "3", "subsystem": "Dag", "assigned_to": "wenger", "derived_from": "", "creator": "wenger", "rust": "", "customer_group": "users", "visibility": "public", "notify": "wenger@cs.wisc.edu", "due_date": ""}