{"id": 5319, "title": "Ticket #5319: Fix argument parsing for jobs", "description": "<blockquote>\nBoth of our argument parsing systems are weird messes a bit unlike everything else.  Both systems are confusing.\n\n<p>Proposed:\n</p><ul>\n<li>There is a new argument entry in the submit file. Maybe args or newarguments.\n</li><li>The new entry's value is preserved exactly in the job's <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span>\n</li><li>On the execute side, the string is passed...\n<ul>\n<li>on Linux/Unix via execv(\"/bin/sh\", \"-c\", escaped_executable + \" \" + arguments, null)\n<ul>\n<li>(Bonus optimization: If the arguments contain no \"interesting\" characters that a shell might interpret, including but not limited to the set [\"'\\$], break the string on whitespace and call execve(executable,arglist);\n</li></ul>\n</li><li>on Windows the arguments as passed in as the single argument passed to winmain.\n</li></ul>\n</li></ul>\n\n<p>Thus on Linux/Unix the escaping syntax is \"Whatever Bourne shell uses\" (the defacto standard and what system() does). On Windows the escaping syntax is \"Whatever your program does (which is probably the default C library's behavior)\" which is the native behavior.\n\n</p><p>Thus, we are (mostly) out of the escaping/argument parsing business and users get to use escaping they are likely already familiar with.\n\n</p><p>Potential problem: does the bash -c linger between the parent and the real job? Will it end up catching signals we intend for the real job?\n\n</p><p>How do we select the new, non-backward compatible behavior? New keyword (arguments3?)? Clever attempt to detect the need? (Not technically backward compatible, but may work in practice.) A Perl-style \"require=8.12\" to use all sorts of new behavior?</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2015-Oct-19 13:25", "status": "new", "created": "2015-Oct-19 12:46", "fixed_version": "2015-Oct-19 12:46", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}