{"id": 534, "title": "Ticket #534: Problem running Cygwin jobs - keyboard activity detected?", "description": "<blockquote>\nThe problem is not quite nailed down yet, but it looks like Windows jobs @ Monash are being suspended when they should not be.  At first blush, it appears that Condor is detected keyboard activity when in fact there is not any.  The only thing noticeably different about these errant jobs -vs- other Win32 jobs is the jobs are Cygwin jobs.\n\n<p>David, if you have more information, please email condor-admin@cs.wisc.edu... this will give you a ticket number back as well.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Oct-21 15:21:21 by psilord:</em> <br/>\n\nBen Burnett has left the Condor project. This ticket being being unassigned.\n\n<p></p><hr/>\n<em>2010-Feb-01 13:40:56 by adesmet:</em> <br/>\n\n(From the user:)\n\n<p>We here at [DELETED] have just noticed there has been some traffic with regards to the ticket <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=534\" onclick=\"get_ticket_and_populate_wrapper('534'); return false;\" title=\"Problem running Cygwin jobs - keyboard activity detected?\">#534</a></span>. Our initial problem was that Condor was suspending Cygwin jobs due to it thinking that the local PC load was higher than the load coming from Cygwin. The actual problem really was that Condor was not tracking properly the process tree of Cygwin job where the child process was thought to be the PC load instead of Condor load. As you can imagine with the condor configured to suspend condor jobs if the local load is high, this would keep pausing our Cygwin jobs and as we were expecting heart-beats from them, we would eventually lose the whole process. We experienced these problems with Condor v6.8.\n\n</p><p>In any case to keep the long story short, we have installed and tested our software with Condor v7.2 and we are not experiencing this problem anymore. So to us it seems that you have addressed this issue in some way between versions of 6.8 and 7.2 and probably can close this ticket.  If you do have some spare time it would be nice if you could tell us what was the problem and what you have done to fix it. That is if your fix wasn't accidental\n\n</p><p></p><hr/>\n<em>2010-Feb-01 13:44:31 by adesmet:</em> <br/>\n\nReplying to user, but saving here for future reference:\n\n<p>We have improved Condor's process management in a variety of ways since 6.8.x specifically to reduce the number of cases in which processes could \"escape\" Condor's management.  I expect one of these fixed your problem.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2010-Feb-01 13:45", "status": "resolved", "created": "2009-Jun-02 11:29", "fixed_version": "2009-Jun-02 11:29", "broken_version": "v070200", "priority": "4", "subsystem": "Win32", "assigned_to": "ziliang", "derived_from": "", "creator": "tannenba", "rust": "a20225", "customer_group": "other", "visibility": "public", "notify": "david.abramson@infotech.monash.edu.au", "due_date": ""}