{"id": 560, "title": "Ticket #560: Investigate MSI features", "description": "<blockquote>\nThe current packaging of the Windows MSI takes a long time according to Ben so I will be taking a look at WiX as a replacement.  Furthermore, I will be examining the update features in MSI to see if we can do some kind of hotpatching of running processes.  More details will follow in comments as I dig up more information about WiX and MSI.</blockquote>", "remarks": "<blockquote>\n<em>2009-Jun-12 15:06:59 by burnett:</em> <br/>\n\nThis is just for a proof of concept.  MakeMSI works well right now, but if we cannot get it to run under Condor, then we will need another solution.  Thus we are looking at WiX, but more specifically, the work for this ticket is to try and asses the capabilities of MSIs.  For instance, can we ship a hot-fix MSI with just the relevant changes and expect the installer to do the right thing?  Can clean upgrades be made vs. clobbering the current install (which is what we currently do)? etc.\n\n<p></p><hr/>\n<em>2009-Jun-12 16:08:01 by matt:</em> <br/>\n\nWhy is patching a running process of interest at all, or are you just referring to the inability to change a file on disk that is a running executable?\n\n<p></p><hr/>\n<em>2009-Jun-12 16:15:21 by ziliang:</em> <br/>\n\nTo Mat: Yes, that's what we're referring to.  And perhaps restarting the service afterward.\n\n<p></p><hr/>\n<em>2009-Jun-12 16:17:23 by burnett:</em> <br/>\n\nPrecisely; I'm hoping that we can reproduce what the <span class=\"quote\">*nix</span> master can do, and replace the underling daemon and have the master restart it.  If the Windows MSI architecture supports replacing running executables, then I'm all for using it.  If not, we can look at other options.  <strong>Disclaimer:</strong> Most of the stuff here is just us thinking out loud, so it may not be as precise outlined as it could/should be.\n\n<p></p><hr/>\n<em>2009-Jun-15 11:14:33 by tannenba:</em> <br/>\n\nBen says:\n\n<p><em>MakeMSI works well right now, but if we cannot get it to run under Condor, then we will need another solution. Thus we are looking at WiX...</em>\n\n</p><p>I thought we discussed this previously; I really disagree w/ the above.  If we cannot get MakeMSI to run under Condor, we need to fix Condor.  Dumping MakeMSI is avoiding the issue.  If MakeMSI cannot run under Condor, undoubtedly there are other applications in the same boat.  If MakeMSI predictably fails under Condor, and therefore we can easily reproduce the problem, we are half way to fixing it.  Any man hours that would have gone to looking at WiX should go at looking into why Condor cannot run MakeMSI!!\n\n</p><p>For this reason, IMO this ticket should be abandoned.\n\n</p><p></p><hr/>\n<em>2009-Jun-15 11:29:39 by burnett:</em> <br/>\n\n<em>For this reason, IMO this ticket should be abandoned.</em>\n\n<p>...\n\n</p><p><em>[S]pecifically, the work for this ticket is to try and asses the capabilities of MSIs</em>\n\n</p><p>Even if we don't ever switch to WiX, I still think researching MSI's capabilities is still very important.  The more powerful and flexible an installer we can make, the better the end user experience.\n\n</p><p></p><hr/>\n<em>2009-Jun-26 17:27:17 by ziliang:</em> <br/>\n\nIt seems that MSI in Vista and up has a feature in which it can tell applications that they need to shut down for an update to happen.  It's also capable of forcibly shutting down said application.  We can also make applications aware of this so that it can at least try to clean up some stuff.  After the update completes, the manager in Vista and up will restart the applications.\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\nSee <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=1657\" onclick=\"get_ticket_and_populate_wrapper('1657'); return false;\" title=\"Update condor's installer to use WiX\">#1657</a></span></blockquote>", "derived_tickets": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=571\" onclick=\"get_ticket_and_populate_wrapper('571'); return false;\" title=\"Get Condor to run MakeMSI and have it create a sample MSI\">#571</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nGet Condor to run MakeMSI and have it create a sample MSI</td></tr>\n</tbody></table>", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Jan-24 14:10", "status": "abandoned", "created": "2009-Jun-12 14:53", "fixed_version": "2009-Jun-12 14:53", "broken_version": "v070300", "priority": "4", "subsystem": "Win32", "assigned_to": "ziliang", "derived_from": "", "creator": "ziliang", "rust": "", "customer_group": "other", "visibility": "public", "notify": "burnett@cs.wisc.edu, willb@redhat.com", "due_date": ""}