{"id": 5658, "title": "Ticket #5658: userlog 020 event still says \"Globus\" instead of \"Grid\"", "description": "<blockquote>\nThis is loooow priority, but I noticed during some OSG debugging that one of the userlog events (020) still says \"Globus\" instead of having been converted to the \"Grid\" terminology that the other events have used ever since Globus code hasn't necessarily been involved in every grid transaction.  Here's a snippet:\n\n<p></p><div class=\"verbatim\">\n<pre>020 (242060.000.000) 05/03 19:13:35 Detected Down Globus Resource\n    RM-Contact: ldas-grid.ligo.la.caltech.edu\n...\n026 (242060.000.000) 05/03 19:13:35 Detected Down Grid Resource\n    GridResource: condor ldas-grid.ligo.la.caltech.edu ldas-grid.ligo.la.caltech.edu:9619\n</pre></div>\n\n\n<p>Aside from removing the misleading Globus name, it would make the events consistent with one another.\n\n</p><p>Or is there some way in which the 020 event is in fact most accurately associated with a \"Globus\" resource?  This is all Condor CE (and not GRAM) infrastructure, I believe.</p></blockquote>", "remarks": "<blockquote>\n<em>2017-Jan-20 13:44:38 by jfrey:</em> <br/>\n\nThe Globus log events are meant to be retired, in favor of the Grid log events. Changing the text in the events would mess up existing log reading code. I propose we stop writing the Globus events entirely in 8.7, possibly with a knob to re-enable in case some users need it.\n\n<p></p><hr/>\n<em>2017-Jan-21 10:16:12 by pfc:</em> <br/>\n\nRe, \"Changing the text in the events would mess up existing log reading code\" -- are you sure?  Log reading code should be using the event number, not the text, and anything that isn't doing so is totally broken by design.  Do you know of any examples of code that reads this specific log event text?  I don't...\n\n<p></p><hr/>\n<em>2017-Jan-23 10:13:05 by jfrey:</em> <br/>\n\nThe log reading code that ships with HTCondor (and used by DAGMan) reads the event text, and will fail to read the given event if the text were to change. While completely static text like the first line of the Globus events could be ignored by the reader, most events do have dynamic information that some consumers will want to recover.\n\n<p>I suppose the HTCondor log reader code could return a partial parse failure that essentially said \"Saw event 20 but failed to parse the details\". But that's not how it currently works.\n\n</p><p></p><hr/>\n<em>2017-Jan-23 10:22:53 by pfc:</em> <br/>\n\nThanks -- I stand corrected!</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2017-Feb-15 09:42", "status": "defer", "created": "2016-May-05 11:27", "fixed_version": "2016-May-05 11:27", "broken_version": "v080504", "priority": "5", "subsystem": "DaemonsSubmitNode", "assigned_to": "jfrey", "derived_from": "", "creator": "pfc", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "pfcouvar@syr.edu,pcouvare@caltech.edu", "due_date": ""}