{"id": 5752, "title": "Ticket #5752: starters and shadows don't receive reconfig", "description": "<blockquote>\nIf you run condor_reconfig on an execute node, the startd is reconfigured but any running starter daemons are not.\n\n<p>Likewise, on a submit node, the schedd is reconfigured but running shadows do not receive a reconfig.\n\n</p><p>This issue manifested itself (as just one example) when updating the CERTIFICATE_MAPFILE with a new DN, and running jobs then suddenly started experience security issues due to not trusting remote connections from the new DN.\n\n</p><p>We should be careful on the submit side since there may be 10's of thousands of shadows running simultaneously.  It may take a while to signal them all, and moreover they will all attempt to simultaneously read the same config file (which may be stored on NFS or some such).  Possibly need to rate-limit the reconfig.</p></blockquote>", "remarks": "<blockquote>\n<em>2016-Jul-07 13:49:45 by tannenba:</em> <br/>\n\nSeems to me the code to forward the reconfig signal to children daemons does not below in the condor_master, but instead belongs in the daemoncore library.  Hopefully daemoncore knows which child processes are htcondor daemons and which are not (I think it does), since obviously the signal should only be forwarded to other daemons.\n\n<p></p><hr/>\n<em>2016-Aug-17 14:16:14 by johnkn:</em> <br/>\n\nThis is not a defect, it is by design. you can't change the config on a running starter/shadow.\n\n<p></p><hr/>\n<em>2016-Sep-07 11:13:10 by zmiller:</em> <br/>\n\nIn a FW meeting, we hypothesized that this is rare enough that it's not worth figuring out a complex mechanism to deal with this situation.  Marking as \"won't fix\".</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2016-Sep-07 11:17", "status": "abandoned", "created": "2016-Jun-24 16:38", "fixed_version": "2016-Jun-24 16:38", "broken_version": "v080400", "priority": "3", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "zmiller", "rust": "", "customer_group": "fermi", "visibility": "public", "notify": "zmiller@cs.wisc.edu", "due_date": ""}