{"id": 589, "title": "Ticket #589: Condor security manual updates", "description": "<blockquote>\nIn general, the security section of the manual should be improved, and some explicit examples/recipes should be provided (probably on the HOWTO section of the wiki, and the Manual could refer to them).  Currently much of this explicit HOWTO wisdom only lives in Zach's powerpoint files.\n\n<p>Other thoughts -\n\n</p><p>ANONYMOUS causes the user to be identified as \"CONDOR_ANONYMOUS_USER\"  This is completely insecure, but may be suitable for limited purposes.  For example, ANONYMOUS access could be used to allow public read-only access to a collector or schedd.\n\n</p><p>A bunch of stuff that might be appropriate to add somewhere:\n\n</p><p>- FS - Very secure. Easy to set up.  Only works for\n  communications on a single computer.  I recommend always using\n  this.\n\n</p><p>- PASSWORD - Very secure.  Moderate complexity to set up.  Only\n  works for authenticating daemon-to-daemon communications.\n\n</p><p>- SSL - Very secure.  Complex to set up.  Suitable for all\n  purposes.\n\n</p><p>- GSI - Very secure.  Very complex to set up.  Suitable for all\n  purposes.  This is really just SSL with additional\n  functionality to support the Globus Security Infrastructure.\n  If you are not already using Globus for other purposes, I\n  recommend against this.  May not be available for Windows.\n\n</p><p>- KERBEROS - Very secure.  Very complex to set up.  Suitable for\n  all purposes.  If you are not already using Kerberos for other\n  purposes, I recommend against this.  May not be available for\n  Windows.\n\n</p><p>- FS_REMOTE - Variable security.  Moderate complexity to set up.\n  Relies on the security of your network filesystem for security.\n  I recommend NOT using.\n\n</p><p>- NTSSPI - Low security.  Easy to set up.  Microsoft\n  Windows authentication.  Only works on Windows.  Authentication is\n  security, but encryption and integrity checks are not.\n\n</p><p>- CLAIMTOBE - Insecure.  Easy to set up.  If enabled, anyone can\n  claim to be anyone!  It's really just for debugging.  I\n  recommend NOT using.\n\n</p><p>- ANONYMOUS - Insecure.  Easy to set up.  While insecure, it does\n  limit users to the \"CONDOR_ANONYMOUS_USER\", a rough equivalent\n  to unix's \"nobody\" account or Window's \"guest\". it can be\n  useful if you want to allow read-only public access to parts of\n  the system.\n\n</p><p>You can use more than one, and I recommend that you do so.  My\ngeneral recommendation is:\n\n</p><p>1. Use FS.  It's simple and secure.  In a typical configuration\nusers run condor_submit on the same computer that the\ncondor_schedd is running on.  In this case, FS is easy for both\nadministrators and users.\n\n</p><p>2. Users frequently ant read-only access to at least the\ncondor_collector.  This makes it easier for them to check the\nstate of the pool, and is required to \"condor_q -analyze\" or\n\"-better-analyze\" to work.  If your collector information is\npublic, you can use ANONYMOUS to accomplish this easily.  If this\nisn't public, use the same option described in <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=3\" onclick=\"get_ticket_and_populate_wrapper('3'); return false;\" title=\"Customize GitTrac\">#3</a></span> below.\n\n</p><p>3. If users want to be able to use \"condor_submit -remote\",\n\"condor_q -name\" or other remote access, you'll need another\nsystem beyond FS.  If you are already using GSI for other\npurposes, I recommend GSI.  If you are already using Kerberos for\nother purposes, I recommend KERBEROS.  Otherwise SSL is the\neasiest secure option.\n\n</p><p>4. Condor daemons need to authenticate as well.  If you're using\nSSL, GSI, or KERBEROS, you can probably also use it for the\ndaemons.  Otherwise I recommend PASSWORD as the easiest secure\noption.</p></blockquote>", "remarks": "<blockquote>\n<em>2012-Aug-17 10:04:20 by smoler:</em> <br/>\n\nFrom Todd T:\nIn the security section of the manual, we list the available authentication methods,\nbut we do not point out that not all methods are supported on all platforms.\nSee the below post to condor-users.\nTodd\n\n<p>On 8/16/2012 9:01 PM, Jewell, Chris wrote:\n</p><div class=\"verbatim\">\n<pre>&gt; Hi,\n&gt;\n&gt; I've just downloaded the Windows binaries for Condor 7.8.2, and am trying to configure GSI security.  I get messages such as:\n&gt;\n&gt; *** Last 20 line(s) of file C:\\condor/log/NegotiatorLog:\n&gt; 08/17/12 13:42:24 SECMAN: new session, doing initial authentication.\n&gt; 08/17/12 13:42:24 SECMAN: Auth methods: GSI\n&gt; 08/17/12 13:42:24 HANDSHAKE: in handshake(my_methods = 'GSI')\n&gt; 08/17/12 13:42:24 HANDSHAKE: handshake() - i am the client\n&gt; 08/17/12 13:42:24 HANDSHAKE: sending (methods == 32) to server\n&gt; 08/17/12 13:42:24 HANDSHAKE: server replied (method = 32)\n&gt; 08/17/12 13:42:24 AUTHENTICATE: unsupported method: 32, failing.\n&gt;\n&gt; Does this mean that the Windows version is not GSI capable?\n&gt;\n\nCorrect.  GSI has never been ported to Windows. If you want something similar on Windows,\nconsider SSL, which also uses public key certificates (but doesn't do the limited proxy delegation that GSI does).\n\nThese Condor authentication methods work on Condor for Windows:\n\n    SSL\n    KERBEROS\n    PASSWORD\n    NTSSPI\n    CLAIMTOBE\n    ANONYMOUS\n\nand these Condor authentication methods do not work on Windows:\n\n    GSI\n    FS\n    FS_REMOTE\n</pre></div>\n\n\n<p></p><hr/>\n<em>2013-Aug-26 15:09:23 by bbockelm:</em> <br/>\n\nZach - for PASSWORD security, we should make a note that this is based on shared secret (right?) - one credential compromise on any node means all nodes could be compromised.  That makes its use inappropriate in several uncommon use cases.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2012-Sep-13 14:28</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/a8f68bdc59affc2634417aeba776addac7e106fc\">[33331]</a></span>: identify authentication methods that do NOT work on Windows ===GT=== <span class=\"ticket\"><a class=\"active\" href=\"/wiki-archive/tickets/?ticket=589\" onclick=\"get_ticket_and_populate_wrapper('589'); return false;\" title=\"Condor security manual updates\">#589</a></span>  (By Karen Miller )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2014-May-21 10:43", "status": "active", "created": "2009-Jun-19 18:30", "fixed_version": "2009-Jun-19 18:30", "broken_version": "v070706", "priority": "3", "subsystem": "Security", "assigned_to": "zmiller", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "smoler@cs.wisc.edu", "due_date": ""}