{"id": 5910, "title": "Ticket #5910: GSI credential map callout caching problem", "description": "<blockquote>\nCERN has encountered a problem whereby one HTCondor-CE server that is setup to use a GSI credential map callout cache via config knob <code>GSS_ASSIST_GRIDMAP_CACHE_EXPIRATION</code> (see <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=4138\" onclick=\"get_ticket_and_populate_wrapper('4138'); return false;\" title=\"Globus authz callout should be cached\">#4138</a></span>) is occasionally returning the wrong values from the cache.  The result is GSI cert DN's get mapped to the wrong user! Very strangely, is this is only happening on one of three CE servers; doing a dump between the misbehaving CE and the other two behaving CEs show no config diffs barring the obvious hostname ones.  Even setting the cache expiration to just 10 minutes results in faulty mapping on this one CE; disabling it completely (setting the expiration time to 0) eliminates the problem.\n\n<p>BrianB at one point suggested that there could be a stuck sec session grid-manager side. I know they've had their condor restarted when the selection exprs change was made.\n\n</p><p>Even though this is happening on just one CE and cannot be reproduced at this time, with the increasing deployments and interest in HTCondor-CE and the fact the result is an incorrect credential mapping, we should understand what is going on.</p></blockquote>", "remarks": "<blockquote>\n<em>2016-Sep-20 21:55:45 by bbockelm:</em> <br/>\n\nPoking through the code:\n<ul>\n<li>I can confirm that the hash key is based on the credential used for the GSI auth.\n</li><li>The hash key is formed from the concatenation of the DN and the VOMS attributes, provided USE_VOMS_ATTRIBUTES is set to true (default).\n</li><li>I don't see USE_VOMS_ATTRIBUTES being overridden anywhere at CERN.\n</li><li>The code used to form the hash key (in extract_VOMS_info) is extremely scary-looking pointer arithmetic.  I'm unable to determine its correctness without much more time spent.\n</li></ul>\n\n<p>One theory is that the same <code>condor_c_worker_thread</code> process is being used to submit two jobs that have different VOMS roles.  The theory doesn't seem very likely: we are pretty sure we got the submit side to make that change.  Further, it doesn't explain why only one CE is affected.\n\n</p><p>Another theory is that VOMS validation is failing on the \"broken CE\".  This would cause the VOMS library to return zero attributes, then causing both jobs to be mapped to the same hash key, hence the same user.\n\n</p><p>A third theory is there's some incorrect usage of the hash map that is only \"slightly wrong\" - memory management issues that only hit one CE.  Rare, but not implausible.\n\n</p><p></p><hr/>\n<em>2016-Sep-20 22:02:12 by bbockelm:</em> <br/>\n\nOh!  Indeed - one of the three CEs has an empty <code>/etc/grid-security/vomsdir</code>.  That means the VOMS role isn't validated, hence it's not included in the hash key for the credential cache.  So any credential with the same DN - regardless of the VOMS role - will get mapped to the same username.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2016-Sep-27 14:35", "status": "resolved", "created": "2016-Sep-19 17:06", "fixed_version": "2016-Sep-19 17:06", "broken_version": "v080400", "priority": "2", "subsystem": "Security", "assigned_to": "zmiller", "derived_from": "", "creator": "tannenba", "rust": "", "customer_group": "cern", "visibility": "public", "notify": "iain.steers@cern.ch, jfrey@cs.wisc.edu, tannenba@cs.wisc.edu, zmiller@cs.wisc.edu, bbockelm@cse.unl.edu, blin@cs.wisc.edu", "due_date": ""}