{"id": 5964, "title": "Ticket #5964: Inconsistencies in credential filenames when using accounting groups", "description": "<blockquote>\nIain reported that credentials were being swept prematurely.  Everything worked fine until he started playing with accounting groups.  Some very preliminary investigation showed that there is some disagreement on the names of the files between various entities, where some assume that the name is simply the unix username (e.g. \"zmiller\") and some are including the accounting group information (e.g. \"physics.zmiller\").\n\n<p>The correct behavior here should be to ignore accounting groups and always use the \"Owner\" of the job when dealing with credentials in the SEC_CREDENTIAL_DIRECTORY.\n\n</p><p>A more thorough investigation would be needed to determine how exactly the mismatch is manifesting itself, but clearly it's wrong and can just be fixed.</p></blockquote>", "remarks": "<blockquote>\n<em>2016-Oct-13 11:54:50 by zmiller:</em> <br/>\n\nIain, any other remarks or wisdom you would like to add to this ticket would be helpful.  Thanks!\n\n<p></p><hr/>\n<em>2016-Oct-13 12:01:32 by iain.steers:</em> <br/>\n\nSo, at the moment we're working round this by using SEC_CREDENTIAL_SWEEP_TIME set to 2 weeks.\n\n<p>For the most part this seems okay.\n\n</p><p>However there is a slight snag in that the afs tokens seem to go \"stale\" or disappear even with renewal.\n\n</p><p>For example:\n\n</p><p>1. I submit a job or set of jobs which run fine.\n\n</p><p>2. As per the work-around my credential is left in the cred dir.\n\n</p><p>3. Some hours-day later I come back and submit some more jobs.\n\n</p><p>4. Get file warnings from condor_submit as the schedd is unable to access afs.\n\n</p><p>There will have been other users, potentially in the same accounting group in the meantime.\n\n</p><p>I'm thinking either the PAG was eaten by something or the schedd is attempting to use the wrong PAG, potentially as a side-effect of this bug.\n\n</p><p>Unfortunately given where the PAGs sit and their interaction with kernel space its basically impossible barring some information from keyctl to tell where the PAG is and what happens to it.\n\n</p><p>Note: This doesn't appear to be a problem on the worker-node side as the aklog is done under the EUID of the user.\n\n</p><p>This doesn't work for the schedd, presumably due to the single-process nature.\n\n</p><p></p><hr/>\n<em>2016-Nov-28 13:23:43 by zmiller:</em> <br/>\n\n<strong>CODE REVIEW</strong>: Looks good.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2016-Oct-17 14:22</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/f31d22d410dd114128e91552a0d1c2f709f34f65\">[49444]</a></span>: Fix credential filenames when using accounting groups. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=5964\" onclick=\"get_ticket_and_populate_wrapper('5964'); return false;\" title=\"Inconsistencies in credential filenames when using accounting groups\">#5964</a></span> Credential files in SEC_CREDENTIAL_DIRECTORY are named after the job owner. The schedd was using submitter names to detect when a credential should be removed. When accounting groups are being used, the submitter name is different than the [...]\n (By Jaime Frey )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2016-Nov-28 13:24", "status": "resolved", "created": "2016-Oct-13 11:54", "fixed_version": "2016-Oct-13 11:54", "broken_version": "v080507", "priority": "1", "subsystem": "Security", "assigned_to": "zmiller", "derived_from": "#5272", "creator": "zmiller", "rust": "", "customer_group": "cern", "visibility": "public", "notify": "tannenba@cs.wisc.edu, iain.steers@cern.ch", "due_date": ""}