{"id": 6031, "title": "Ticket #6031: Improve RANK documentation", "description": "<blockquote>\nOn 11/30/2016 2:00 PM, Aaron Moate wrote:\n&gt; Below is HTCondor manual section 3.5.1.4 regarding RANK\n&gt; expressions.  I believe RANK only effects jobs that are\n&gt; already running in comparison to jobs that are being\n&gt; considered for matches (as opposed to two jobs that are\n&gt; not yet running and being considered for matches)?\n&gt; And that if preemption is disabled then RANK is meaningless?\n&gt; <strong>If</strong> this is so, I would suggest making section 3.5.1.4\n&gt; more clear.  Reading it gives me the impression that\n&gt; RANK will effect matchmaking while the slot is idle\n&gt; (which it may?  This has always confused me).\n&gt;\n&gt; -Moate\n\n<p>Hi Moate,\n\n</p><p>Your belief is correct; startd RANK only effects jobs that are already\nrunning.  People on htcondor-users often have the same confusion; in\nfact, I answered a question about this very topic just a few days ago\n--- see the below email thread.  You do subscribe to htcondor-users,\nright? ;-)  Kent, below may have text you can lift for improving the\ndocumentation in the section Moate referenced.\n\n</p><p>regards,\nTodd\n\n</p><p>-------- Forwarded Message --------\nSubject: Re: Jobs taking a long time to match\nDate: Tue, 22 Nov 2016 13:28:38 -0600\nFrom: Todd Tannenbaum &lt;tannenba@cs.wisc.edu&gt;\nTo: Szabolcs Horvátth &lt;szabolcs.horvatth@gmail.com&gt;,\nhtcondor-users@cs.wisc.edu\n\n</p><p>On 11/22/2016 1:00 PM, Szabolcs Horvátth wrote:\n &gt; Hi,\n &gt;\n &gt; I'm trying to find the reason why some of our condor jobs can take a\n &gt; really long time to get matched. The situation is the following:\n &gt;\n &gt; - There are submitted jobs that have high machine rank so they are\n &gt; supposed to start as soon as slots are available.\n &gt; - There are available slots that match the job requirements, condor_q\n &gt; analyze confirms that, but other users' lower ranked jobs get matched to\n &gt; these slots.\n\n</p><p>Setting the startd rank (i.e. RANK = .... in condor_config) does not\ncontrol how fast slots get matched, nor does it prevent lower ranked\njobs from getting matched to those slots.\n\n</p><p>What startd rank DOES do is tells the startd \"if possible, preempt and\nreplace the currently running job with a higher ranked idle job\".\nEssentially, it is a way for the machine to rank how much it likes the\njob it is currently matched with, and tells the condor_negotiator to\nkeep looking for a match it likes better than its current one.\n\n</p><p>So if a machine has an unclaimed slot, it will first be offered to the\nhighest priority user (regardless of startd RANK).  Once the slot is\nclaimed by the highest priority user with a job that matches the slot,\nstartd RANK kicks in and the condor_negotiator will continue to look to\nsee if there are jobs from a different user that RANK higher - if so,\nthe job from the highest priority user will be preempted and replaced\nwith the job that ranks higher.\n\n</p><p>Note that startd RANK always implies preemption- if you don't want job\nto be preempted, startd rank does not help you.\n\n</p><p>If you want to control who gets \"first shot\" at a slot, you would\nnormally adjust user priorities (aka condor_userprio -setfactor\nuser@domain 1) or group quotas.\n\n</p><p>If you want to increase the frequency at which matchmaking occurs (it\nonly happens every NEGOTIATOR_INTERVAL seconds, or when someone run\ncondor_submit, condor_reschedule), decrease NEGOTIATOR_INTERVAL.\n\n</p><p>Hope the above helps,\nTodd</p></blockquote>", "remarks": "<blockquote>\n<em>2016-Dec-01 09:17:52 by wenger:</em>\n\n<p></p><pre>  ... except that the default NEGOTIATOR_PRE_JOB_RANK includes\nMy.Rank, which according to the manual, refers to the machine rank, not\nthe job rank.  (The manual appears to say that the sort goes in the\nfollowing order:\n</pre>\n\n<p></p><pre>  NEGOTIATOR_PRE_JOB_RANK\n  job's rank\n  NEGOTIATOR_POST_JOB_RANK\n  PREEMPTION_RANK\n</pre>\n\n<p>where the job's rank is a hard-coded sort key and can't be ignored.  This\nI'm less sure about.)\n\n</p><p>- ToddM</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "doc", "last_change": "2016-Dec-01 09:17", "status": "new", "created": "2016-Dec-01 09:12", "fixed_version": "2016-Dec-01 09:12", "broken_version": "v080508", "priority": "3", "subsystem": "Unknown", "assigned_to": "wenger", "derived_from": "", "creator": "wenger", "rust": "", "customer_group": "chtc", "visibility": "public", "notify": "wenger@cs.wisc.edu", "due_date": ""}