{"id": 6109, "title": "Ticket #6109: bosco should support a Suse target architecture", "description": "<blockquote>\nHi,\n\n<p>Installing bosco 1.2.6 at NERSC, none of the provided bosco architectures supports NERSC since Cray XC30 and XC40 are Suse based.\n\n</p><p>Worked around it by forcing it to install the RedHat6 tarball and then manually copied two SL6 libraries into the bosco/glite/lib folder at NERSC (otherwise the pilot wouldn't work)\n\n</p><p>libcrypto.so.10\nlibssl.so.10\n\n</p><p>Cheers\n\n</p><p>Dirk</p></blockquote>", "remarks": "<blockquote>\n<em>2017-Jan-24 13:32:25 by jfrey:</em> <br/>\n\nDoing this properly would require doing a port of HTCondor to SUSE, including adding a SUSE machine to UW's build cluster. Even without making SUSE an official supported release platform, this would take some planning and effort.\n\n<p></p><hr/>\n<em>2017-Jan-25 18:00:43 by hufnagel:</em> <br/>\n\nOk, if a fully supported Suse version is out of the question in the short term, how about workarounds in the installation for now ?\n\n<p>I mean, it seems like most of what is installed at the remote end is OS independent and the few pieces that are not can be made to work by shipping a few additional libraries.\n\n</p><p>I am looking at the difference between hacking the install scripts and figuring out which libraries to copy to the remote end and the installer maybe suggesting to override the remote end target OS and suggesting what libraries might be needed to make things work here. Or maybe just having the remote target OS override and suggesting on the release twiki what target OS and extra libs work for certain officially unsupported systems.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2017-Feb-07 16:02", "status": "new", "created": "2017-Jan-24 00:40", "fixed_version": "2017-Jan-24 00:40", "broken_version": "v080507", "priority": "4", "subsystem": "Grid", "assigned_to": "", "derived_from": "", "creator": "hufnagel", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}