{"id": 6564, "title": "Ticket #6564: Report recent metrics for custom machine resources (GPUs)", "description": "<blockquote>\n<span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=IceCube\" title=\"Ice Cube\">IceCube</a></span> would also like to have what we've called \"recent\" metrics about GPUs, ideally broken down by device, available in the same places and ways (excepting the user log's summary) as the job metrics.  (It could be useful to the administrator(s) to advertise this information in the slot ads.)\n\n<p>Ideally, STATISTICS_WINDOW_SECONDS would determine the recency period.\n\n</p><p>On a technical level, this implies some changes to what we do when we react to new output from the monitoring jobs.  Primarily, that in addition to the ClassAd-based recording we already do, we associate one of the exiting recency code's ring buffers which each reported attribute; each time we get a new value to push, we can \"tick\" the clock or not appropriately, and then insert into the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=ClassAd\" title=\"Class Ad\">ClassAd</a></span> the resulting recent value (via the probe's Publish() method?).\n\n</p><p>We will need to record the last tick time and first sample times on our own, however, it appears; and monitoring jobs should write zeroes when they start up so that we can establish the first interval.\n\n</p><p>See other notes from discussion with TJ and rediscuss with him as necessary.</p></blockquote>", "remarks": "<blockquote>\n<em>2018-Mar-14 16:50:32 by tlmiller:</em> <br/>\n\nThis feature implies its own (large) set of regression tests.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2018-Mar-14 16:50", "status": "new", "created": "2018-Feb-12 12:12", "fixed_version": "2018-Feb-12 12:12", "broken_version": "v080707", "priority": "3", "subsystem": "DaemonsExecNode", "assigned_to": "tlmiller", "derived_from": "#6477", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu", "due_date": ""}