{"id": 6726, "title": "Ticket #6726: Make interactive submission more first-class", "description": "<blockquote>\nFor a variety of reasons, some forward-thinking, the user experience for interactive jobs needs improvement:\n\n<p>1) Submit files from interactive jobs should be able to be submitted for non-interactive batch jobs, without modification.\n\n</p><p>Currently, the \"executable\" line is ignored and an error given if it's included in a submit file submitted with \"condor_submit -i\".\n\n</p><p>Improvement: HTCondor should accept jobs submitted this way, and transfer the executable (as for a non-interactive job), but not run the executable.\nCould: give the user a warning statement that the executable will be transferred, but not executed\n\n</p><p>2) A better, less error-looking message should be given to the user if the job environment is not ready.\n\n</p><p>Roughly monthly CHTC RCFs encounter a user who thinks they've done something wrong. E.g:\n\n</p><p>---\nThe last error occurs sometimes when I submit a job. My request is rejected but I am still assigned to some cluster. Following is an error message:\n\n</p><p>[szhao64@submit-3 ~]$ condor_submit -i debug.sub\nSubmitting job(s).\n1 job(s) submitted to cluster 121316375.\nWaiting for job to start...\nslot1_12@e185.chtc.wisc.edu: Rejecting request, because the job execution environment is not yet ready.\nWelcome to slot1_12@e185.chtc.wisc.edu!\n\n</p><p>Can you help me fix these problems? Do I need to add some options in the command line?\n---\n\n</p><p>Improvement: make the \"Rejecting request...\" message more informative and less scary. Maybe something like \"Preparing job environment.\"\n\n</p><p>3) Interactive jobs in the queue are hard to identify and decode.\n\n</p><p>Currently, interactive jobs (a) list \"sleep\" as the executable in the condor_q output, and (b) may go on hold and stay on hold if the interactive job overuses resources (or other hold reason). There should be a more informative error message in these cases and the job should probably be removed from the queue rather than going on hold.\n\n</p><p>Improvement: (1) replace \"sleep\" with \"(interactive job)\" in the condor_q output\n(2) remove interactive jobs from the queue if held, and perhaps give hold reason as an error message when the SSH is terminated.</p></blockquote>", "remarks": "<blockquote>\n<em>2019-Aug-05 15:04:18 by tlmiller:</em> <br/>\n\nSee <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=7158\" onclick=\"get_ticket_and_populate_wrapper('7158'); return false;\" title=\"Learning from the Instructors (OSG Summer School)\">#7158</a></span> for problem 2.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2019-Aug-05 15:04", "status": "new", "created": "2018-Aug-01 15:10", "fixed_version": "2018-Aug-01 15:10", "broken_version": "", "priority": "3", "subsystem": "Unknown", "assigned_to": "", "derived_from": "", "creator": "lmichael", "rust": "", "customer_group": "other", "visibility": "public", "notify": "lmichael@wisc.edu", "due_date": ""}