{"id": 6881, "title": "Ticket #6881: User Job Log Improvements", "description": "<blockquote>\npart (a): reduce clutter / length by removing the useless image size\nupdate events.  (Continue to send and receive them, just don't write them\nto the log.)\n\n<p>part (b): replace \"your job's usage looks sane after start-up\" functionality\nwith a starter-side event that dumps the *Usage values from the job ad after\nfive minutes (or maybe the second update from the starter).\n\n</p><p>part (c): keep <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=6854\" onclick=\"get_ticket_and_populate_wrapper('6854'); return false;\" title=\"Add file transfer events to user log.\">#6854</a></span>, but consider eliding whichever transfer event's\ntiming is redundant (with job start and with job end, presumambly).</p></blockquote>", "remarks": "<blockquote>\n<em>2019-Jan-27 18:23:30 by tlmiller:</em> <br/>\n\nBased on Friday's team meeting, it sounds like there's some interest in making the user job log more useful; people seemed to like the idea of the file transfer events.  People seemed broadly in favor of removing the image size updates themselves, but weren't sure about the proposed replacement, or what to do about the secondary \"liveness\" function of the image size updates.\n\n<p>Regarding the more philosophical questions, I guess the distinguishing feature of the user job log is that can and does provide more information about the history of a job than its ad does.  Certain questions about the current state of the job may be better answered by improving condor_q, but some current-state information may be useful to provide in the log for provide debugging context (under the assumption that nobody looks at the log unless something has gone wrong).\n\n</p><p>There is or was a secondary function regarding a non-polling alternative for job status updates, but I think that's been entirely superceded by the DAGMan event log.\n\n</p><p></p><hr/>\n<em>2019-Jan-27 18:33:06 by tlmiller:</em> <br/>\n\nAs ToddT observed, it may no longer be necessary for the log to be a formal log any longer.  For example, using zero- or space- filled fields in a periodic (notice of liveness -style) event would reserve space for us to update the event (atomically, or at least in a single write) when the new event comes in, rather than clutter the log with new events.\n\n<p>Certain diagnostic or historic data could also be stored directly by the shadow in a directly usable format (e.g., storing *Usage attributes over time in an RRD).\n\n</p><p></p><hr/>\n<em>2019-Jan-27 21:03:48 by karpel:</em> <br/>\n\nTwo thoughts:\n\n<p>HTMap is using the event log as a non-polling job status tracker (and also one that doesn't depend on being able to talk to the daemons), but could presumably be switched to use DAGMan and its event log internally.\n\n</p><p>On image size events: perhaps a reasonable criteria would be to only write them to the event log if they're larger than the previously-largest image size event recorded? This is the information many people (and admins) actually care about.\n\n</p><p>(That information is also in terminated events, but if I remember correctly there's some problem with being able to pull it out of them programatically.)\n\n</p><p></p><hr/>\n<em>2019-Jan-29 14:01:22 by tlmiller:</em> <br/>\n\nToddT also asked why or if the user event log still needed to be a formal log; one idea that sparked in my mind was the possibility of writing a bunch of extra zeros or spaces in the usage/image size event and then just updating the information in-place.\n\n<p>That could be bad if it included the event time-stamp; maybe it makes more sense to add another event-internal field that's the last-update time-stamp.  (You could also only update the event if it's the last one in the log, but that won't have the desired effect in multi-job logs.  I guess each writer could only update an event if there had been no intervening event?)\n</p><hr/>\n<em>2020-Apr-10 07:46:13 by tim:</em> <br/>\n\nBulk change of target version from v080906 to v080907 using ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Nov-09 10:53", "status": "new", "created": "2019-Jan-24 14:59", "fixed_version": "2019-Jan-24 14:59", "broken_version": "v080901", "priority": "3", "subsystem": "DaemonsSubmitNode", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, tannenba@cs.wisc.edu, johnkn@cs.wisc.edu, karpel@wisc.edu", "due_date": ""}