{"id": 6922, "title": "Ticket #6922: Embed local, subsys, or config name in shared port socket name", "description": "<blockquote>\nIt would help in debugging for daemons to include their local, subsystem, or configuration (as in DAEMON_LIST) name in their shared port socket names.\n\n<p>The master already sets a daemon's local name to its configuration name if appropriate, but since the master also creates (or at least names) the shared point endpoints for its children, we can't just change the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=SharedPortEndpoint\" title=\"Shared Port Endpoint\">SharedPortEndpoint</a></span> constructor.  Instead, let's split the knowledge about magic names out of the constructor and have the master (or the constructor, if necessary) supply the daemon's local/subsystem/configuration name.\n\n</p><p><em>(Original ticket text follows)</em>\n\n</p><p></p><hr/>\nIt would be less user-hostile, and possibly enable some useful configuration options, if a daemon's shared port socket name was the daemon's local name, if set, or otherwise its config name (entry in the DAEMON_LIST).</blockquote>", "remarks": "<blockquote>\n<em>2019-Feb-20 20:52:33 by bbockelm:</em> <br/>\n\n(Worth noting that this could always fall back to randomly-generated strings if the preferred name is taken...)\n\n<p></p><hr/>\n<em>2019-Feb-21 14:31:37 by tlmiller:</em> <br/>\n\nOn Windows, we need to worry about global uniqueness.  To maintain the utility of being able to specify shared port sinfuls in configuration, we'd like for them to not always have embedded PIDs.  We can do this by having daemons started as a service (or by the master if it's running as a service) <em>not</em> embed PIDs, on the theory that very few people will want to run two HTCondor installations as a service at the same time, and that for them, a command-line flag to force shared port IDs to have PIDs or not will suffice.\n\n<p>More generally, we also need to address the issue of grandchildren of the master.  These will never be addressed at configuration time, so it's OK for them to include the PID if that's useful; however, it would still be nice to identify them as starters or shadows (or grid managers) as appropriate.  This can probably be accomplished just by including the subsystem in the shared port endpoint constructor's default identity strings.\n\n</p><p>The first step is probably just to embed the localname/subsystem name of the spawned daemon into its socket name, and not make any other changes for now.  (I think, at least on Linux, we can safely assume that each HTCondor instance gets its own daemon socket directory and that therefore collisions should be handled as they are currently, where we assume the old name is stale.)\n\n</p><p></p><hr/>\n<em>2019-Feb-21 14:51:18 by tlmiller:</em> <br/>\n\nThe Windows global pipe dir supposedly allows '/' in the pipe name, which suggests a schema where the DAEMON_SOCKET_DIR we actually operate in is the configured DAEMON_SOCKET_DIR followed by '/' and the master's PID.  The shared port daemon only does lookups with that prefix, and the the shared port code in condor_io/ only creates sockets with that prefix.  (The PID of the process's parent, unless we decide to pass the master PID along as an explicit command-line interface.)\n\n<p>If necessary, the master could create sockets in that directory with semantically-important names (so that a user tool couldn't create a socket with the name 'schedd').\n\n</p><p>... speaking of user-level named sockets, would they just create things in the configured DAEMON_SOCKET_DIR and the shared port daemon would check there second?  (The master would create its PID directory with permissions so that user processes couldn't use it, and then purge the other ones, I guess.)\n\n</p><p></p><hr/>\n<em>2019-Feb-25 10:25:24 by tlmiller:</em> <br/>\n\n... does this need documentation?\n\n<p></p><hr/>\n<em>2019-Mar-26 13:49:31 by tlmiller:</em> <br/>\n\nWe decided in the 2019-03-25 meeting that this doens't need documentation.</blockquote>", "derived_tickets": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">\n<span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=6928\" onclick=\"get_ticket_and_populate_wrapper('6928'); return false;\" title=\"Allow fixed shared port socket names\">#6928</a></span></td>\n<td align=\"center\" valign=\"center\" width=\"30\">\n<span class=\"icon ptr1\"> </span></td>\n<td align=\"left\" valign=\"top\">\nAllow fixed shared port socket names</td></tr>\n</tbody></table>", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Feb-22 11:20</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/4dad5244093db98853ac8c7a5c5d0a0336d17c62\">[56239]</a></span>: (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=6922\" onclick=\"get_ticket_and_populate_wrapper('6922'); return false;\" title=\"Embed local, subsys, or config name in shared port socket name\">#6922</a></span>) The schedd and startd now spawn their children with meaningful shared port socket names.  (By Todd L Miller )</td></tr>\n<tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Feb-21 16:41</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/787cd3e3d4b887d66af303a92658768ec55b177a\">[56238]</a></span>: (<span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=6922\" onclick=\"get_ticket_and_populate_wrapper('6922'); return false;\" title=\"Embed local, subsys, or config name in shared port socket name\">#6922</a></span>) Add 'master' to the master's shared port socket name and the corresponding name from the config file to the other daemons the master starts.  (By Todd L Miller )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2019-Mar-26 13:49", "status": "resolved", "created": "2019-Feb-20 14:31", "fixed_version": "2019-Feb-20 14:31", "broken_version": "v080900", "priority": "3", "subsystem": "DaemonSharedP", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, johnkn@cs.wisc.edu", "due_date": ""}