{"id": 7150, "title": "Ticket #7150: Sinful alias and daemon name inconsistencies", "description": "<blockquote>\nFor SSL/X.509, it's unreliable at best, at a security hole at worst, to assume that reverse DNS maps to the subject name of a given host.  (For instance, foo.org may be a CNAME to bar.org, which means reverse DNS would return bar.org, which is not the site to which you're trying to connect.)  HTCondor deals with this by including the 'alias' attribute in its Sinful strings.\n\n<p>Brian Bockelman observed two problems:\n\n</p><p></p><ol>\n<li>The flock collector list's daemon (client) objects return Sinfuls without aliases.\n</li><li>The collector list's Sinfuls have aliases, but Daemon (client) objects constructed from those Sinfuls have no <code>name()</code>.\n</li></ol>\n\n<p>The former is almost certainly wrong.  The latter could be defended by arguing that Sinfuls have a <code>getAlias()</code> member function.  It's unclear why the Daemon (client) object has no <code>name()</code>, and it's unclear if it should always correspond to the <code>alias</code> attribute.\n\n</p><p>Straw-man proposal is for the latter is to make <code>name()</code> return the Sinful <code>alias</code> if the Daemon object wasn't constructed from a name.  The obvious thing to do for the former is to set the Sinful alias to the string used in the config file (which we'd just call name if that weren't potentially confusing), which I think is always passed as the name parameter in the constructor.\n\n</p><p>The potential issue is here is the existence and meaning of the HOST_ALIAS knob.  However, I believe that knob is intended for precisely this purpose (so that the daemons on a given host will advertise Sinfuls with an alias which matches their certificate), so this is likely fine.  (If specified, HOST_ALIAS should set the Sinful alias rather than the daemon's name; otherwise, the Sinful's <code>alias</code> attribute and the daemon's <code>name()</code> should always be the same.)</p></blockquote>", "remarks": "<blockquote>\n<em>2019-Jul-19 17:27:03 by tlmiller:</em> <br/>\n\nI can't reproduce the first problem.  I'll have to ask BrianB for more details.\n\n<p></p><hr/>\n<em>2019-Jul-26 14:51:10 by tlmiller:</em> <br/>\n\nEven checking where <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/48c152643dd756b43d438c502cedd9bcfc87ec2c\">[57429]</a></span> changed from <code>-&gt;addr()</code> to <code>-&gt;name()</code> reveals no problems with the Sinful aliases.  However, I verified that constructing a Daemon (client) object from a Sinful with an alias does not set the Daemon object's <code>name()</code>.  This shouldn't matter (since its Sinful has the alias), since the only place <code>_alias</code> is used is to set the Daemon object Sinful's alias property.\n\n<p>The branch contains a bunch of debug code for if we ever decide to pick this up again.  The changes include a patch that sets Daemon object's <code>name()</code> to the Sinful's alias if it's available and <code>name()</code> is otherwise not set.  (And a patch to set _alias, although it never matters, and a bunch of debug code.)</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2019-Jul-26 14:47</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/cac6aec51195054e65c9cf41f651b9cfc55aa0b8\">[57504]</a></span>: (<span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=7150\" onclick=\"get_ticket_and_populate_wrapper('7150'); return false;\" title=\"Sinful alias and daemon name inconsistencies\">#7150</a></span>) Lots of debug code (which should be reverted) and two patch files (which should be reverted, but contain the useful changes. patch.1.diff addresses the direct issue by itself.) Untested.  (By Todd L Miller )</td></tr>\n</tbody></table>", "type": "defect", "last_change": "2019-Jul-26 14:51", "status": "abandoned", "created": "2019-Jul-15 16:47", "fixed_version": "2019-Jul-15 16:47", "broken_version": "", "priority": "2", "subsystem": "Daemons", "assigned_to": "tlmiller", "derived_from": "#7093", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu", "due_date": ""}