{"id": 727, "title": "Ticket #727: VOMS support not documented", "description": "<blockquote>\nVOMS does not appear to be documented in the main manual.</blockquote>", "remarks": "<blockquote>\n<em>2009-Dec-08 12:58:35 by smoler:</em> <br/>\n\nAs of Dec 8, 2009:\n\n<p>The 7.4.0 manual has a version history item identifying that VOMS does not work in 7.4.0, and that it should be disabled.\n\n</p><p><em>2010-Jan-28 14:38:35 by zmiller:</em> <br/>\n\nWrote first pass, assigned to karen in review state.\n\n</p><p></p><hr/>\n<em>2010-Jan-28 15:24:33 by smoler:</em> <br/>\n\nZach's documentation:\n\n<p>There are two new uses of VOMS in Condor.  The first is that VOMS attributes\nnow appear in the Job Ad when x509userproxy is specified in the submit file.\nThese attributes can then be used for matchmaking or for accounting.\n\n</p><p>x509UserProxySubject: This attribute contains only the Distinguished Name (DN)\nof the credential used to submit the job.  This was already present and the\nVOMS work does not change the meaning of this attribute.\n\n</p><p>x509UserProxyVOName: This attribute contains the name of the VO that the user's\ncredential is part of.\n\n</p><p>x509UserProxyFirstFQAN: This attribute is equal to only the primary role of the\ncredential.  A credential may have multiple roles defined, but by convention the one listed first is the primary role.\n\n</p><p>x509UserProxyFQAN: This is a serialized list of the DN and all FQAN.  A comma is\nused as a separator, and any existing commas in the DN or FQAN are replaced\nwith the string '&amp;comma;'.  Likewise, any ampersands in the DN or FQAN are\nreplaced with '&amp;amp;'.\n\n</p><p>It should be noted that these attributes are placed into the Job Ad but they are\nNOT verified, and can be modified using condor_qedit after the job is submitted.\nTherefore, you should not rely on their authenticity.\n\n</p><p></p><hr/>\nThe other area of Condor that is enhanced by the recent VOMS work is the\nmapping of users using the CERTIFICATE_MAPFILE.  Normally, rules for the GSI\nmethod are executed using the DN of the credential used for authentication.\n\n<p>Now, with the integration of VOMS, the rules are first interpreted using the\nfull serialized DN and FQAN (quoted if needed in the same way as\nx509UserProxyFQAN was above).  If no matching rules can be found using the\nfull DN and FQAN, the DN is then used on its own without the FQAN.\n\n</p><p>Using the regular expression capabilities of the CERTIFICATE_MAPFILE, you can\nthen extract roles or usernames from the VOMS attributes to be used as the\ntarget for mapping.\n\n</p><p>In this case, the FQAN are verified, and you can rely on their authenticity.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2010-Feb-01 11:25</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/a96cdd12e177b08fc8231df4af74d8690b0ca157\">[25256]</a></span>: initial documentation of integration with VOMS; gittrac <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=727\" onclick=\"get_ticket_and_populate_wrapper('727'); return false;\" title=\"VOMS support not documented\">#727</a></span>  (By Karen Miller )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2010-Feb-01 11:27", "status": "resolved", "created": "2009-Sep-10 14:12", "fixed_version": "2009-Sep-10 14:12", "broken_version": "v070401", "priority": "1", "subsystem": "Unknown", "assigned_to": "smoler", "derived_from": "#161", "creator": "zmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": "20100121"}