{"id": 7309, "title": "Ticket #7309: Slow-starting HTCondor jobs need a way to checkpoint", "description": "<blockquote>\nSome long-running jobs also take a long time to start.  This violates one of the requirements* for using HTCondor's existing support infrastructure for self-checkpointing jobs.  The fast-restart requirement stems from the need to make sure that the checkpoint (which may be more than one file) ends up in a consistent state in the spool.  A simple way to signal that a new checkpoint has been written is to exit with specific code.  This method has the further advantage that it's hard for the job to (accidentally) make changes to the checkpoint after it (or, rather, its root process) has exited.\n\n<p>Rather than abandoning such jobs to the vagaries of file transfer after an eviction, we should make it possible (and ideally easy) for them to trigger the same file transfer that would occur if they had exited with their specified checkpoint code.  To avoid interfering with file transfer, however, the job needs to know when the file transfer has completed.  (The other option is to specify a set of checkpoint files and checkpoint file remaps, where the job guarantees it won't touch the former and the latter moves the former to where it needs to go to be useful on restart.  However, even if this case, since file transfer takes arbitrarily long, the job would have to be sure to never use the same checkpoint files twice.)  A simple way to meet those two conditions would be to provide a tool (perhaps based on chirp) which causes the starter to begin file transfer and blocks until the starter is done.\n\n</p><p></p><ul>\n<li><a class=\"external\" href=\"https://htcondor.readthedocs.io/en/latest/users-manual/self-checkpointing-applications.html\">https://htcondor.readthedocs.io/en/latest/users-manual/self-checkpointing-applications.html</a></li></ul>\n</blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2019-Oct-08 17:57", "status": "new", "created": "2019-Oct-08 17:57", "fixed_version": "2019-Oct-08 17:57", "broken_version": "", "priority": "4", "subsystem": "DaemonsExecNode", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "ligo", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, pcouvare@caltech.edu", "due_date": ""}