{"id": 765, "title": "Ticket #765: Scheduler universe jobs should not trigger a matchmaking cycle", "description": "<blockquote>\nOur visitor Hailong noticed a problem. I had a memory of it being fixed a while ago, but at least in 7.2.4 it's not fixed. I couldn't find anything in the release notes for 7.3.x that suggest it has been fixed.\n\n<p>The problem is that when he submits a DAGMan job, the first job has to wait five minutes to run after DAGMan submits it.\n\n</p><p>My understanding of the problem is that the schedd tells the negotiator to run a matchmaking cycle when the scheduler universe job for DAGMan is submitted. When DAGMan submits the next job in less than 20 seconds, the negotiator ignores the request to run a matchmaking cycles, and we have to wait five minutes for the next matchmaking cycle.\n\n</p><p>I know that we can change the matchmaking cycle to be shorter (and that's what we've done for now), but it seems that two things should be true:\n\n</p><p></p><ol>\n<li>Submitting a scheduler universe job shouldn't tell the negotiator to start a matchmaking cycle. That would avoid the whole problem.\n\n<p></p></li><li>If something requests a matchmaking cycle, but we haven't exceeded NEGOTIATOR_CYCLE_DELAY, we should automatically start another matchmaking cycle when the NEGOTIATOR_CYCLE_DELAY has been exceeded. That is, we should delay a matchmaking cycle but not ignore it.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<em>2009-Oct-02 11:47:07 by tannenba:</em> <br/>\n\nIn testing, this looks to be much better in 7.3.2 - the dagman job went into the queue and a reschedule happened, but when dagman submitted the first job another negotiation cycle happened after 20 seconds.  :)\n\n<p>So I am resolving this ticket.  However, thinking about this inspired me to create enhance ticket <span class=\"ticket\"><a class=\"abandoned\" href=\"/wiki-archive/tickets/?ticket=810\" onclick=\"get_ticket_and_populate_wrapper('810'); return false;\" title=\"Schedd should be able to intelligently reschedule all on its own\">#810</a></span>  that details how this all should <em>really</em> work.</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2010-Jan-31 13:40", "status": "resolved", "created": "2009-Sep-23 10:14", "fixed_version": "2009-Sep-23 10:14", "broken_version": "v070204", "priority": "2", "subsystem": "Daemons", "assigned_to": "tannenba", "derived_from": "", "creator": "roy", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}