{"id": 7684, "title": "Ticket #7684: Easy way to get platform-specific config via client tool", "description": "<blockquote>\nThe most recent idea batted around in <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=7669\" onclick=\"get_ticket_and_populate_wrapper('7669'); return false;\" title=\"Add configuration template to generate a secure personal condor\">#7669</a></span> was something like <code>condor_config_val -write:platform</code>. ToddM has some different ideas, maybe he can add them here.\n\n<p>Let's agree on something and do it.\n\n</p><p></p><hr/>\nMy original proposal was to split the platform-specific <code>/etc/condor_config</code> into two pieces: the platform-specific piece that should probably only contain information about paths on disk, and everything else (e.g., 'use security: host_based').  Then it would be easy to copy the bits you need just to know where the binaries and libraries are, and ignored everything else.\n\n<p>Josh pointed out that the number of different places that Metronome looks for <code>condor_config.example</code> -- which is how it solves this problem -- is kind of absurd, and so maybe it's better to let the installer solve the problem of getting HTCondor's executable into the PATH and instead supply an executable that just spits the platform-specific bits out when run.\n\n</p><p>The key idea here is that executable != binary, or at least doesn't have to, which means we don't have to decide anything at compile time or at run-time; the platform-specific installer can write the platform-specific script at package or install -time, whichever is easier.</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Nov-09 12:18", "status": "new", "created": "2020-Jun-12 17:14", "fixed_version": "2020-Jun-12 17:14", "broken_version": "", "priority": "4", "subsystem": "Tools", "assigned_to": "johnkn", "derived_from": "#7669", "creator": "karpel", "rust": "", "customer_group": "other", "visibility": "public", "notify": "karpel@wisc.edu tim@cs.wisc.edu tlmiller@cs.wisc.edu johnkn@cs.wisc.edu bbocklem@morgridge.org", "due_date": ""}