{"id": 7744, "title": "Ticket #7744: checkpointing should allow incremental output transfer", "description": "<blockquote>\nHTCondor currently requires the job to copy its output to spool after every checkpoint, so that the complete set of output is available for copying to its final destination when the job completes.\n\n<p>It is apparently common for the output of a job to be both large and unnecessary for resuming the application after a checkpoint; for instance, a log (perhaps in many different files) of simulation states, where only the most recent simulation state is necessary for continuing, but earlier entries in the log are of interest and are part of the output.  In this scenario, transferring the partial output back to spool at each checkpoint is too inefficient an approach to be useful.\n\n</p><p></p><hr/>\nOptions:\n\n<p></p><ul>\n<li>allow the user to specify that some files should be transferred on checkpoint, but stored as output instead of in spool\n</li><li>the same, but mark those files as not to be transferred back from spool\n</li><li>how do we deal with partial output files?  (that is, ones that may get appended to between checkpoints)  If we have to deal with those, and can do so without transferring the whole thing again, should we just apply that to storage in spool and not make the user have to worry about it?  (Compute the hashes during the upload and store them so the submit node doesn't have to keep doing that.)\n</li></ul>\n\n<p>issues -- doe we require the user to remove previous partial outputs between checkpoints?  where would we store the list of files we've already transferred, if not?  (if we don't, and instead transfer to spool but not back, we would need a list of files in spool from the shadow that match the don't-transfer list to avoid transferring them again)</p></blockquote>", "remarks": "<blockquote>\n<em>2020-Jul-20 14:02:05 by tlmiller:</em> <br/>\n\nLaurenM expects that when jobs of this type voluntarily checkpoint, their timestep files will either be complete or missing entirely, which may simplify things for us, initially.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Jul-20 14:02", "status": "new", "created": "2020-Jul-20 12:41", "fixed_version": "2020-Jul-20 12:41", "broken_version": "", "priority": "3", "subsystem": "DaemonsExecNode", "assigned_to": "tlmiller", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, lmichael@wisc.edu", "due_date": ""}