{"id": 7784, "title": "Ticket #7784: condor_qedit should not adversly affect condor_schedd operations", "description": "<blockquote>\nIn stable versions 8.8.9 and earlier, as well as development version 8.9.8 and earlier, there were some issues with the <code>condor_schedd</code> validating the input provided by <code>condor_qedit</code>.\n\n<p><span class=\"subsubsection\"></span></p><h4>Deleting Attributes</h4>\n\n<p>There are certain attributes that the SchedD will not let you modify, such as <code>Owner</code>.  However, the same checks were not applied when deleting attributes, which can leave jobs in a state that they are not runnable.  Possibly, if the administrator has configured submit attributes, job transforms, and set <code>PROTECTED_ATTRIBUTES</code>, the user would be able to remove an attribute that should be protected which could influence policy used in matchmaking.\n\n</p><p><span class=\"subsubsection\"></span></p><h4>Special Attributes</h4>\n\n<p>Certain internal attributes in the SchedD should not be editable by users, but the SchedD was not correctly enforcing this.  While there are no known security issues with this, the user can disrupt the SchedD by modifying the state such that the next time the SchecD attempts to start up, it cannot.\n\n</p><p>It is suggested that you upgrade to the latest stable or development release.  However, if you cannot, there is a workaround for this issue which is to set:\n</p><div class=\"code\">\n<pre class=\"code\">SECURE_JOB_ATTRS=NextClusterNum, NextJobSetNum\n</pre></div>\n</blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2020-Aug-07 16:46", "status": "resolved", "created": "2020-Aug-04 17:10", "fixed_version": "2020-Aug-04 17:10", "broken_version": "", "priority": "1", "subsystem": "", "assigned_to": "zmiller", "derived_from": "", "creator": "tim", "rust": "", "customer_group": "other", "visibility": "public", "notify": "zmiller@cs.wisc.edu, jfrey@cs.wisc.edu, tim@cs.wisc.edu", "due_date": ""}