{"id": 7818, "title": "Ticket #7818: Fix Python 3 and Ornithology on Windows", "description": "<blockquote>\nOf our three Windows machines, only on Windows 7 do Python 3 (and therefore Ornithology) tests run with any kind of success.\n\n<p>The failures are usually one of two things:\n\n</p><p></p><ul>\n<li>the inability to run Python <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/3b4033cb37b20c859748d024820ecdc40b63a1f4\">[3]</a></span> scripts from HTCondor configuration, e.g., as startd cron jobs or custom machine resource inventory scripts,\n</li><li>the inability to run Python <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/3b4033cb37b20c859748d024820ecdc40b63a1f4\">[3]</a></span> scripts as jobs.\n</li></ul>\n\n<p>TJ has plans to address the former.  There are two problems: first, my_popen() doesn't check the Windows registry for associations; and second, even if it did, it seems reasonable to assume that the scripts-in-configuration would expect the bindings they load to match the version they're running under, which is at best difficult to arrange via a registry entry.  Both issues would be resolved by having HTCondor 'know' how to invoke Python scripts (given a configured Python binary and its own LIB directory) in the desired way.\n\n</p><p>It would much less annoying to address the latter by properly registering the .py extension on the Windows machines, but TJ doesn't want to do that.  Arguably, in the spirits of both minimizing the set-up required to run the tests and the principle of least astonishment, test jobs should be run with the Python interpreter used to run the test.  (And when the previous paragraph is implemented, the configured Python for scripts-in-configuration should also be the same as the one used to run the test.)</p></blockquote>", "remarks": "<blockquote>\n</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2020-Aug-25 19:28", "status": "new", "created": "2020-Aug-25 19:28", "fixed_version": "2020-Aug-25 19:28", "broken_version": "", "priority": "2", "subsystem": "", "assigned_to": "", "derived_from": "#7811", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu, johnkn@cs.wisc.edu", "due_date": ""}