{"id": 813, "title": "Ticket #813: Remove MASTER_NEW_BINARY_DELAY param", "description": "<blockquote>\n<a class=\"external\" href=\"http://www.cs.wisc.edu/condor/manual/v7.3/3_3Configuration.html#17412\">http://www.cs.wisc.edu/condor/manual/v7.3/3_3Configuration.html#17412</a>\n\n<p></p><div class=\"verbatim\">\n<pre>MASTER_NEW_BINARY_DELAY\n    Once the condor_master has discovered a new binary, this macro controls how long it waits before attempting to execute the new binary. This delay exists because the condor_master might notice a new binary while it is in the process of being copied, in which case trying to execute it yields unpredictable results. The entry is defined in seconds and defaults to 120 (2 minutes).\n</pre></div>\n\n\n<p>It sounds like this param was introduced to avoid a race condition. Copying binaries onto a system was taking longer than it took the condor_master to restart the binary. This param just gives the copy a 2 minute window to finish - surely that's all that'll ever be needed. It seems this is a hack-workaround. A fix would be for the master to record some stat info for each binary and only restart when the info stabilizes. A TOCTOU still exists there of course, but a user doesn't have to remember about the delay.\n\n</p><p>Why care? I've run into situations where the delay is rather unexpected and causes user confusion - especially while restarting an entire pool. It's also yet another behavior people need to remember to understand how Condor will behave - Condor's cognitive footprint.</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:46:04 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 14:52", "status": "new", "created": "2009-Oct-05 07:44", "fixed_version": "2009-Oct-05 07:44", "broken_version": "", "priority": "4", "subsystem": "Daemons", "assigned_to": "", "derived_from": "", "creator": "matt", "rust": "", "customer_group": "other", "visibility": "public", "notify": "matt@cs.wisc.edu", "due_date": ""}