{"id": 880, "title": "Ticket #880: Condor issues in ETICS production pool", "description": "<blockquote>\nETICS is running a Condor 6.9.5 prerelease on their pool, because as of last year it was the newest set of binaries we could provide to them that did not have a critical component broken.   The SL5 machines don't appear to work well with the RHEL 3 binaries running on them.  Jobs are not completing and are getting stuck in the middle of their build processes. This is in the ETICS production pool and is affecting production users.  There is no indication of error caused by Metronome in the Metronome logfiles.  An example of a recent problem from the StarterLog.vm1 on a SL5 platform:\n\n<p></p><div class=\"verbatim\">\n<pre>10/8 23:34:46 Process exited, pid=3808, signal=9\n10/8 23:34:46 condor_write(): Socket closed when trying to write 305 bytes to &lt;128.142.142.97:23356&gt;, fd is 5\n10/8 23:34:46 Buf::write(): condor_write() failed\n10/8 23:34:46 Failed to send job exit status to shadow\n10/8 23:34:46 JobExit() failed, waiting for job lease to expire or for a reconnect attempt\n10/8 23:35:07 Got SIGTERM. Performing graceful shutdown.\n10/8 23:35:07 ShutdownGraceful all jobs.\n10/8 23:35:07 Result of \"get_usage\" operation from ProcD: ERROR: No family with the given PID is registered\n10/8 23:35:07 error getting family usage in VanillaProc::PublishUpdateAd()\n10/8 23:35:07 condor_write(): Socket closed when trying to write 67 bytes to &lt;128.142.142.97:23356&gt;, fd is 5\n10/8 23:35:07 Buf::write(): condor_write() failed\n10/8 23:35:07 Failed to send job exit status to shadow\n10/8 23:35:07 JobExit() failed, waiting for job lease to expire or for a reconnect attempt\n10/8 23:35:12 **** condor_starter (condor_STARTER) EXITING WITH STATUS 0\n</pre></div>\n\n\n<p>RHEL5 builds were available for Condor 6.9.5, though it would take a bit of digging/work to resubmit the prerelease build and obtain binaries that may end up working on that platform.   This does not seem like the best solution, as it requires a lot of time and effort spent on older binaries and may not resolve the problem.\n\n</p><p>I have experimented with several newer versions of Condor in the ETICS test pool for the job migration work, which is when I uncovered the 7.1 &lt;-&gt; 7.2 incompatibility problem.  The <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=BatLab\" title=\"Bat Lab\">BatLab</a></span> pool is stuck running Condor 7.1.4.  In order to maintain versions at ETICS and UoW that are compatible for job migration work, I recommend we upgrade both pools to the same version of Condor. ETICS prefers the stable series for their production pool.  Which version to choose?\n\n</p><p>7.4.0\npros:\n\n</p><p>- new, latest, best release, will work with 7.4.0 built for old platforms, pool is happy, etc.\n\n</p><p>cons:\n\n</p><p>-not out yet\n\n</p><p>7.3.2\npros:\n\n</p><p>- stable series\n\n</p><p>cons:\n\n</p><p>- Do we know of the 7.4.0 binaries Nick built for our older platforms will work with a 7.3.2 submitter?\n- Any Condor upgrade for ETICS will require Condor config file changes and some of my time for assistance.  They are still using vms instead of slots, for example.\n- If any bugs found after 7.3.2 affect us or ETICS, namely any of the 7.4.0 blockers, we'll have to perform a second upgrade to 7.4.0 at UoW and ETICS when it's released.</p></blockquote>", "remarks": "<blockquote>\n<em>2009-Oct-23 12:17:41 by tannenba:</em> <br/>\n\nAccording to the log above, the job exited w/ signal 9.\n\n<p>Typically this means one of two possibilities:\n</p><ol>\n<li>Especially if the job exited immediately upon startup, the job is a dynamically linked executable and one or more of the dynamic libraries is not present on the machine. (or not in the LD library path)\n</li><li>The job was removed via condor_rm or a periodic remove expression.\n</li></ol>\n\n<p>Apparently Becky has reason to believe the latter may actually be what is going on, so she is pursuing that course.\n\n</p><p>As for a recommendation about what version of Condor to move towards, I am probably biased, but I would do v7.4.0 if I were you.\n\n</p><p></p><hr/>\n<em>2009-Oct-23 12:31:46 by tannenba:</em> <br/>\n\nAfter discussion w/ Becky, we are going to move this ticket to status defer until Marion makes some changes to the auto-removal policy...</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "incident", "last_change": "2009-Dec-26 20:40", "status": "defer", "created": "2009-Oct-22 14:17", "fixed_version": "2009-Oct-22 14:17", "broken_version": "v060905", "priority": "4", "subsystem": "Daemons", "assigned_to": "tannenba", "derived_from": "", "creator": "bgietzel", "rust": "", "customer_group": "batlab", "visibility": "public", "notify": "bgietzel@cs.wisc.edu, roy@cs.wisc.edu", "due_date": ""}