{"id": 977, "title": "Ticket #977: Windows (Starter?) Weirdness", "description": "<blockquote>\nI saw an odd problem working on Metronome's \"remote DAG\" implementation.  I had a Condor job submitted to the local schedd that pointed at a script file without an extension.  Condor complained that it couldn't figure out how to run the file, since it had no extension.  So far, so good.  However, it took me quite a while to figure the problem out, because the local schedd was reporting the job as running the whole time.</blockquote>", "remarks": "<blockquote>\n<em>2009-Nov-18 21:04:52 by matt:</em> <br/>\n\nA job is considered running while it has an active shadow.\n\n<p>This might be a usability bug. Did the job go on hold with a useful reason or did you have to look at the <span class=\"wiki\"><a class=\"missing\" href=\"wiki?p=StarterLog\" title=\"Starter Log\">StarterLog</a></span> on the remote machine?\n\n</p><p></p><hr/>\n<em>2009-Nov-18 21:48:08 by tlmiller:</em> <br/>\n\nThe job in the local queue (the execute node) never left the R state, AFAICT.  The job in the remote queue (the submit node) had, of course, no idea what was happening, since the perl script which started the personal condor was doing just fine.  (I'm now uncertain which 'remote' and 'local' should should be here; sorry for any confusion.  I wrote \"local\" because I was doing the debugging on the execute node.)\n\n<p></p><hr/>\n<em>2009-Nov-18 21:59:16 by matt:</em> <br/>\n\nOk, I've no idea what your setup is and what \"remote DAG\" means then. If you can lay it out a problem might pop out.\n\n<p></p><hr/>\n<em>2009-Nov-19 11:11:10 by tlmiller:</em> <br/>\n\nThe problem should have nothing to do with the setup; it just only shows up there because we don't run Windows submit nodes.  At any rate, \"remote DAG\" means that (parts of) a Metronome submission is turned into a DAG, and that it starts up a personal condor on the execute node to run that DAG.  That personal condor is the run that's reporting the job as running, even when Condor hasn't been able to start it.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "defect", "last_change": "2010-Oct-18 15:15", "status": "new", "created": "2009-Nov-18 14:11", "fixed_version": "2009-Nov-18 14:11", "broken_version": "v070400", "priority": "4", "subsystem": "Win32", "assigned_to": "johnkn", "derived_from": "", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu", "due_date": ""}