{"id": 2061, "title": "Ticket #2061: Fetch work hooks not implemented for standard universe jobs", "description": "<blockquote>\nPart of the message from condor-users, Joan J. Piles on April 13:\n\n<p>We have a hook that must be called for each job running in our cluster, an instance of  xxxxx_HOOK_JOB_EXIT. In the Vanilla universe (the one most of our jobs use), there is no problem, and it works almost as expected (I say almost because the exit reason is shown as \"evict\" even when \"condor_rm\" is used, but that's not an important problem for us).\n\n</p><p>We have recently found that this hook is completely ignored for Standard universe jobs. According to the documentation it should work, and it is condor_starter's job to run the hooks. However, there seem to be two condor_starter executables, one for most jobs, and another one (condor_starter.std) for Standard universe jobs. Furthermore, in the sourece code there are two completely different implementations, and the Standard universe one seems to have no hook capability at all, so I don't know if this is a bug or a feature ;-)\n\n</p><p>What are our options for implementing hooks for Standard Universe jobs? Is this being worked upon (in development versions), or we should find a workaround? We already tried ditching condor_starter.std, but the default condor_starter doesn't seem to be able to start Standard Universe jobs.\n\n</p><p>Thanks in advance,\n\n</p><p>Joan\n\n</p><p>And here is part of Todd T's response:\n\n</p><p>You are correct, standard universe has its own shadow/starter pair that does not support a bunch of mechanisms found in the newer shadow/starter pair that supports other universes like Vanilla, Java, etc.  Besides hooks, other features like ssh_to_job and CCB do not work in standard universe for this reason.\n\n</p><p>So, we should clearly document this limitation in the hook documentation.</p></blockquote>", "remarks": "<blockquote>\n<em>2011-Jul-01 11:39:48 by smoler:</em> <br/>\n\nLimitation already stated for CCB and condor_ssh_to_job.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2011-Jul-01 11:54</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/0a3ae29e0a4bbf2dae96fcad2ba1904dc47ca493\">[26055]</a></span>: hook mechanisms not supported by standard universe starter/shadow ===GT:Fixed=== <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=2061\" onclick=\"get_ticket_and_populate_wrapper('2061'); return false;\" title=\"Fetch work hooks not implemented for standard universe jobs\">#2061</a></span>  (By Karen Miller )</td></tr>\n</tbody></table>", "type": "doc", "last_change": "2011-Jul-01 11:56", "status": "resolved", "created": "2011-Apr-13 12:41", "fixed_version": "2011-Apr-13 12:41", "broken_version": "v070600", "priority": "3", "subsystem": "Unknown", "assigned_to": "smoler", "derived_from": "", "creator": "smoler", "rust": "", "customer_group": "users", "visibility": "public", "notify": "smoler@cs.wisc.edu", "due_date": ""}