{"id": 4639, "title": "Ticket #4639: Help CMS with group-based scheduling policy questions", "description": "<blockquote>\nJames at CMS would like to discuss group-based scheduling mechanisms in HTCondor.</blockquote>", "remarks": "<blockquote>\nStatement of the Problem:\n\n<p>In general in CMS we would like to have a 50%/50% fair-share between the production and analysis accounting groups. In this way grid resources will be shared equally between Monte Carlo production and analysis users as a group.\n\n</p><p>However, we have a certain class of resources (Tier-1 sites) where we want to have a different fair-share, 95%/5% between production and analysis.\n\n</p><p>Can HTCondor provide us with a way to have different fair-shares by accounting group on different classes of resources?\n\n</p><p>Currently we have worked around this problem by adding a resource group in the glideinWMS fronted which sends pilots with a special VOMS role to the Tier-1 sites, and the fair-share is enforced at the site level in the CE. Ideally we would like to be able to control this fair-share centrally and not delegate setting it to the Tier-1 sites.\n\n</p><p>Related Problem:\n\n</p><p>Some sites provide CMS opportunistic access to resources that are not part of their pledge to the experiment, but are accessible by the normal HTCondor/glideinWMS infrastructure in CMS. The sites would like to be able to give a preferential access to certain classes of local users before the cycles are delivered to non-local users. These local users can be identified either individually (list of users) or as members of a VOMS group, i.e. their grid DNs have a special VOMS role identifying them as members of a group such as the Spanish national group.\n\n</p><p>Currently we have worked around this problem by adding a resource group in the glideinWMS fronted which sends pilots with a special VOMS role to a class of sites, and the fair-share is enforced at the site level in the CE. While we do not wish to control this fair-share centrally, rather leaving it to the sites themselves to manage, we do not want the significant overhead of having to introduce a new glideinWMS frontend group for every site that wants to deliver low-priority opportunistic cycles to CMS.\n\n</p><p>Can HTCondor provide us with a way to have different priorities for classes of users even more finely-grained than accounting group (site-maintained list, VOMS role based) on different classes of resources?\n\n</p><p></p><hr/>\n<em>2015-Feb-05 15:04:18 by jfrey:</em> <br/>\n\nHere is a proposed solution for the different production/analysis split for Tier-1 vs non-Tier-1 sites.\n\n<p>Run two negotiators, each\nmatching a subset of machine ads in the global CMS glidein collector.\nThe first negotiator will match all glide-ins at Tier-1 sites. It will\nhave dynamic group quotas of 95% for production and 5% for analysis,\nwith surplus enabled for production.\nThe second negotiator will match all glide-ins at non-Tier-1 sites and\nTier-1 glide-ins that have been Unclaimed for more than 5 minutes. It\nwill have dynamic group quotes of 50% with surplus enabled for both\nproduction and analysis.\n\n</p><p>If there are insufficient analysis jobs, then production jobs will take\nover more than their guaranteed share of both Tier-1 and non-Tier-1\nmachines.\nIf there are insufficient production jobs, then analysis jobs will take\nover more than their guaranteed share of non-Tier-1 machines. The\nfirst negotiator will only give 5% of Tier-1 machines to analysis\njobs. Any glide-ins that go unmatched due to insufficient production\njobs will soon be picked up by the second negotiator, which will match\nthem to analysis jobs.\n\n</p><p>Fair share between analysis users will be enforced by the second\nnegotiator, except for 5% of Tier-1 glide-ins; the first negotiator\nwill enforce fair share for those glide-ins. This bifurcation of\nfair-share should be close to the stated requirement of fair-share\nacross all glide-ins running analysis jobs.\n\n</p><p></p><hr/>\n<em>2015-Feb-05 19:27:53 by bbockelm:</em> <br/>\n\nHi Jaime,\n\n<p>I think that would work (long term, I'm still interested in remote accountants!).\n\n</p><p>We'll lose some percentage of glideins due to the idle minutes and negotiation time.  It'll probably be acceptable.  Any ideas of how we can measure that?\n\n</p><p>Brian</p></blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "todo", "last_change": "2015-Feb-05 19:36", "status": "new", "created": "2014-Oct-08 16:27", "fixed_version": "2014-Oct-08 16:27", "broken_version": "", "priority": "3", "subsystem": "", "assigned_to": "gthain", "derived_from": "#4490", "creator": "tannenba", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "jletts@ucsd.edu, tannenba@cs.wisc.edu", "due_date": ""}