{"id": 7151, "title": "Ticket #7151: Improve usability of StartCommandRequest", "description": "<blockquote>\n<code>SecMan::StartCommandRequest</code> is a structure used to condense ten parameters of <code>Daemon::startCommand_internal</code> into one.  Presently, each member of the structure is initialized explicitly, on its own line.  There should be a way to improve both the usability of the interface and the readability of code using it.\n\n<p>The first step may be to eliminate redundant assignments (the structure already has initializers for all of its members).\n\n</p><p>The second step may to be add a constructor for only those variables which everybody always needs to set (e.g., which are initialized to nullptr but which aren't optional).  This may not actually help with the problem.\n\n</p><p>One further possibility is to analyze patterns in the usage and write a few well-name factory functions (but not constructors, because we can't change the names of those).\n\n</p><p>Another (suggest by GregT), is to arrange the interface as function calls describing what you want to do.  For instance:\n\n</p><p></p><div class=\"code\">\n<pre class=\"code\">StartCommandRequest scr( UPDATE_STARTD_AD, sock ); // maybe?\nscr.registerCallback( callback_fn, callback_data );\nscr.reportErrors( errStack );\n</pre></div>\n\n\n<p>although this may require making extensive changes further up the call-chain (where the semantic information originates).</p></blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2020-Apr-10 07:46:13 by tim:</em> <br/>\n\nBulk change of target version from v080906 to v080907 using ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2020-Nov-09 12:31", "status": "new", "created": "2019-Jul-15 17:47", "fixed_version": "2019-Jul-15 17:47", "broken_version": "v080903", "priority": "3", "subsystem": "Daemons", "assigned_to": "bbockelm", "derived_from": "#7093", "creator": "tlmiller", "rust": "", "customer_group": "other", "visibility": "public", "notify": "tlmiller@cs.wisc.edu", "due_date": ""}