{"id": 6415, "title": "Ticket #6415: schedd should have a way to blacklist a site of execute nodes", "description": "<blockquote>\nCMS global pool operators want the ability to blacklist a site from accepting new jobs on a schedd basis.  LIGO would also like set a per-schedd limit on the number of running jobs per user.  We think we can do both with one new schedd expression.  We plan to implement this via a constraint config knob in the schedd, which must evaluate to true for a job to activate on a slot.\n\n<p>The idea here is that, like the current <code>START_LOCAL_UNIVERSE</code> and <code>START_SCHEDULER_UNIVERSE</code> config knobs, that control when jobs of these universe types are allowed to start - there should also be a <code>START_VANILLA_UNIVERSE</code> knob that controls whether the schedd is willing to start a job for other universes (the name is tentative, this would apply to all jobs that need a condor_shadow process - not just vanilla jobs).\n\n</p><p>This check would happen when a new match arrives from the negotiator, and also when the schedd is about to re-use a claim.\n\n</p><p>The <code>START_VANILLA_UNIVERSE</code> expression would be evaluated in the context of the slot ad, the job ad, and a new \"owner\" ad that contains username and number of jobs that the current user has running, idle &amp; held.  Attribute references will be <strong>required</strong> to be scoped, but to make this clearer, the scopes will be JOB, SLOT, and OWNER.  (i.e. not MY and TARGET).\n\n</p><p>For instance.  The schedd could ban a site using the expression: </p><div class=\"code\">\n<pre class=\"code\">START_VANILLA_UNIVERSE = SLOT.Site =!= \"badsite\"</pre></div>\n or it could ban a site only for a certain user with the expression: <div class=\"code\">\n<pre class=\"code\">START_VANILLA_UNIVERSE = IfThenElse(OWNER.Name =?= \"bob\", SLOT.Site =!= \"badsite\", true)</pre></div>\n\n\n<p>The flexibility of this mechanism means it could also be used to stop or limit new job starts for a user or for jobs of a certain type.  For instance, you could refuse to start new jobs for a user that has a lot of jobs on hold with this expression: </p><div class=\"code\">\n<pre class=\"code\">START_VANILLA_UNIVERSE = OWNER.JobsHeld &lt; 10</pre></div>\n  The OWNER ad will have counts of jobs in the queue, Idle, running and held jobs that are kept up-to-date in order to facilitate this use case.\n\n<p>To prevent this new expression from becoming a large drain on CPU time in the Schedd, it will analyze the expression and optimize certain use cases - For instance.  When a new match arrives, the expression will first be analyzed without any JOB ad, and if it evaluates to true or false rather than undefined, it will not be evaluated again while the schedd looks for idle jobs in the queue that match the resource.\n\n</p><p>A further optimization will be made where the schedd reduces the expression to a sub-expression that refers to the SLOT ad and sends that sub-expression to the negotiator as part of the resource request ad.  The negotiator would then be able to skip sending matches to the schedd that the schedd would never activate.  While reducing the expression for the negotiator, the schedd will notice if the expression would resolve to true or false without referring to any SLOT attribute.  If that is the case, then the schedd will leave the resource request unmodified (if true), or skip negotiating for the job entirely (if false).\n\n</p><p>For example if </p><div class=\"code\">\n<pre class=\"code\">START_VANILLA_UNIVERSE = IfThenElse(OWNER.Name=?=\"bob\", SLOT.Site=!=\"badsite\", true) &amp;&amp; OWNER.JobsHeld &lt; 10</pre></div>\n and bob has jobs with <div class=\"code\">\n<pre class=\"code\">Requirements = OpSys==\"LINUX\"</pre></div>\n When negotiator asks for resource requests from bob, If bob has less than 10 jobs on hold, the schedd will send a resource request with <div class=\"code\">\n<pre class=\"code\">Requirements = OpSys==\"LINUX\" &amp;&amp; IfThenElse(true, TARGET.Site=!=\"badsite\", true)</pre></div>\n.  If bob has more than 10 jobs on hold, then the schedd will tell the negotiator that it doesn't want any resources for bob.\n\n<p>One caveat here is that the negotiator doesn't know anything about job Owners, it thinks in terms of submitters, and there can be a many to many relationship between owners and submitters - so it is not possible to reliably communicate constraints that refer to OWNER attributes to the negotiator that will prevent the negotiator from repeatedly trying to negotiate for bob.  What we can do is short circuit the negotiation process so that the negotiator will not actually make matches for a bob's jobs when they will never be activated.</p></blockquote>", "remarks": "<blockquote>\n<em>2017-Sep-26 12:28:19 by johnkn:</em> <br/>\n\nWhen the START_VANILLA_UNIVERSE expression refers to a JOB attribute. that attribute will have to be added to the set of significant attributes.  If this is not done, then there will be jobs that share an autocluster id, but have different results from evaluating the START_VANILLA_UNIVERSE.  This will either result in not getting matches for jobs that could run, or for getting matches that cannot be used.\n\n<p></p><hr/>\n<em>2017-Oct-26 16:54:09 by johnkn:</em> <br/>\n\nWe are not enthusiastic about the name <code>START_VANILLA_UNIVERSE</code> for this knob, and will defer documenting it until we have come up with a better name, or have decided to go with the current name.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n<tbody><tr><td align=\"right\" valign=\"top\" width=\"160\">2017-Oct-05 14:33</td>\n<td align=\"center\" valign=\"top\" width=\"30\">\n<span class=\"icon dot\"> </span></td>\n<td align=\"left\" valign=\"top\"> \nCheck-in <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/c2b7b4a614e275b88585d66ff1e4b93bcf88aead\">[52495]</a></span>: add a START_VANILLA_UNIVERSE expression to the schedd so that there is a way to blacklist sites. <span class=\"ticket\"><a class=\"resolved\" href=\"/wiki-archive/tickets/?ticket=6415\" onclick=\"get_ticket_and_populate_wrapper('6415'); return false;\" title=\"schedd should have a way to blacklist a site of execute nodes\">#6415</a></span> This commit also changes many of the dprintf messages for the schedd match handling from D_FULLDEBUG to D_MATCH and removes the split dprintf() associated with checking the runnable state of a job. [...]\n (By John (TJ) Knoeller )</td></tr>\n</tbody></table>", "type": "enhance", "last_change": "2017-Oct-27 15:04", "status": "resolved", "created": "2017-Sep-21 16:19", "fixed_version": "2017-Sep-21 16:19", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "johnkn", "derived_from": "", "creator": "johnkn", "rust": "", "customer_group": "cms", "visibility": "public", "notify": "", "due_date": ""}