{"id": 687, "title": "Ticket #687: New tests", "description": "<blockquote>\nProposals for new tests:\n\n<p></p><ol>\n<li>In the source, scan externals/bundles/*/URLS.  All URLs found should begin with <a class=\"external\" href=\"http://parrot.cs.wisc.edu/externals/\">http://parrot.cs.wisc.edu/externals/</a>.  If one doesn't, the test fails.  This ensures that code like <span class=\"chng\"><a href=\"https://github.com/htcondor/htcondor/commit/45c56aaf48e72af7662b9d8a750c1de127051a68\">[15424]</a></span> doesn't accidentally end up in a release, meaning we can't reproduce the binary later.\n\n<p></p></li><li>Scan binaries for rpaths and similiar in the form \"/home/condor/execute/\".  If any are present, the test fails.  Such a path means the binary may be erroneously looking in a directory that is a side effect of the build system, not an intentional path. (Possibly related: <span class=\"ticket\"><a class=\"new\" href=\"/wiki-archive/tickets/?ticket=291\" onclick=\"get_ticket_and_populate_wrapper('291'); return false;\" title=\"Consistent Execute Directories\">#291</a></span>)\n\n<p></p></li><li>Scan all source for forbidden function calls, the test fails if any are detected.  There should be a way of flagging a given call as valid.  (One possibility is is special comment: /*ALLOWUNSAFE*/, another possibility is a unsafe_open() wrapper)  Things to flag: open, fopen.  Maybe strcpy and sprintf.  This provides a way to detect that people are using forbidden calls without the extremely crude GCC poisoning we're using now that are causing problems. (Of course, it also handwaves the problem of detecting these cases.)\n\n<p></p></li><li>Scan all binaries (everything that ends up executable, or perhaps everything ending up in particular directories), excepting a hand maintained list.  The binary must return 0 when executed with \"-version\"; failure is an error.  This provides a very basic smoke test.\n\n<p></p></li><li>Run ldd on everything that looks like a binary.  The test fails if any dependencies are missing.  The VDT has a similar test, and it's helpful for detecting libraries that were accidentally not shipped, or where the build and test machines have different libraries.</li></ol>\n</blockquote>", "remarks": "<blockquote>\n<hr/>\n<em>2010-Oct-20 15:59:08 by jfrey:</em> <br/>\n\nBulk change of target version from v070504 to v070505 using ./ticket-target-mover.\n<hr/>\n<em>2011-Jan-27 14:21:33 by danb:</em> <br/>\n\nBulk change of target version from v070505 to v070506 using ./ticket-target-mover.\n<hr/>\n<em>2011-Feb-01 14:49:30 by tannenba:</em> <br/>\n\nBulk change of target version from v070506 to NULL using ./ticket-target-mover.</blockquote>", "derived_tickets": "", "attachments": "<html><head></head><body></body></html>", "check_ins": "", "type": "enhance", "last_change": "2011-Feb-01 14:51", "status": "new", "created": "2009-Aug-21 17:06", "fixed_version": "2009-Aug-21 17:06", "broken_version": "", "priority": "4", "subsystem": "", "assigned_to": "", "derived_from": "", "creator": "adesmet", "rust": "", "customer_group": "other", "visibility": "public", "notify": "", "due_date": ""}